zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*
** ###################################################################
**     Processors:          MCXW70ACMFT
**                          MCXW70ACMMP
**                          MCXW70ADMFT
**                          MCXW70ADMMP
**
**     Version:             rev. 1.0, 2026-01-09
**     Build:               b260813
**
**     Abstract:
**         CMSIS Peripheral Access Layer for BTU2
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2026-01-09)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file PERI_BTU2.h
 * @version 1.0
 * @date 2026-01-09
 * @brief CMSIS Peripheral Access Layer for BTU2
 *
 * CMSIS Peripheral Access Layer for BTU2
 */

#if !defined(PERI_BTU2_H_)
#define PERI_BTU2_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXW70ACMFT) || defined(CPU_MCXW70ACMMP))
#include "MCXW70AC_COMMON.h"
#elif (defined(CPU_MCXW70ADMFT) || defined(CPU_MCXW70ADMMP))
#include "MCXW70AD_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- BTU2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup BTU2_Peripheral_Access_Layer BTU2 Peripheral Access Layer
 * @{
 */

/** BTU2 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[3072];
  __IO uint16_t BTU_RIF_CTL0;                      /**< RIF Control 0, offset: 0xC00 */
       uint8_t RESERVED_1[4];
  __IO uint16_t BTU_RIF_BRF_RSSI_ADDR;             /**< RIF BRF RSSI Address, offset: 0xC06 */
       uint8_t RESERVED_2[4];
  __IO uint16_t BTU_RIF_CTRL1;                     /**< RIF Control 1, offset: 0xC0C */
  __IO uint16_t BTU_RIF_RXON;                      /**< RIF RXON, offset: 0xC0E */
  __IO uint16_t BTU_RIF_PLLCLKEN_ON_DELAY;         /**< RIF PLL Clock Enable, offset: 0xC10 */
  __IO uint16_t BTU_RIF_TXON;                      /**< RIF Tx On, offset: 0xC12 */
  __IO uint16_t BTU_RIF_PLLCLKEN_OFF_DELAY;        /**< RIF PLL Clock Enable Off Delay, offset: 0xC14 */
  __I  uint16_t BTU_RIF_FREQ;                      /**< RIF FREQ, offset: 0xC16 */
  __IO uint16_t BTU_RIF_BRF_TX_PU;                 /**< RIF BRF Power Up for TX, brf_pu is the sideband signal used to turn on the BRF's power control., offset: 0xC18 */
  __IO uint16_t BTU_RIF_CTRL2;                     /**< RIF Control 2, offset: 0xC1A */
  __IO uint16_t BTU_RIF_TX_PULSE;                  /**< RIF Tx Pulse, offset: 0xC1C */
  __IO uint16_t BTU_RIF_DBUS_TX_PWRCTL;            /**< RIF dBus Tx Power Control, offset: 0xC1E */
  __IO uint16_t BTU_RIF_DBUS_RX_PWRCTL;            /**< RIF dBus Rx Power Control, offset: 0xC20 */
  __IO uint16_t BTU_RIF_BRF_RXPWRCTL_ADDR;         /**< RIF BRF Rx Power Control Address, offset: 0xC22 */
  __IO uint16_t BTU_RIF_BRF_FSYN_ADDR;             /**< RIF BRF FSYN Address, offset: 0xC24 */
  __IO uint16_t BTU_RIF_BRF_TXPWRCTL_ADDR;         /**< RIF BRF Tx Power Control Address, offset: 0xC26 */
  __IO uint16_t BTU_RIF_BTC_DBUS_RSSI;             /**< BTC RIF dBus RSSI, offset: 0xC28 */
  __IO uint16_t BTU_RIF_DBUS_TX_FSYN;              /**< RIF Tx dBus Fsyn, offset: 0xC2A */
  __IO uint16_t BTU_RIF_DBUS_RX_FSYN;              /**< RIF Rx dBus Fsyn, offset: 0xC2C */
  __IO uint16_t BTU_RIF_DBUS_RX_PKT_LEN;           /**< RIF dBus Rx Packet Length, offset: 0xC2E */
  __IO uint16_t BTU_RIF_BLE_PULSE_RX_DELAY;        /**< RIF BLE Pulse Rx Delay, offset: 0xC30 */
  __IO uint16_t BTU_RIF_BLE_PULSE_TX_DELAY;        /**< RIF BLE Pulse Tx Delay, offset: 0xC32 */
  __IO uint16_t BTU_RIF_DBUS_RX_MODE_TYPE;         /**< RIF dBus Rx Mode Type, offset: 0xC34 */
  __IO uint16_t BTU_RIF_MODE_TYPE_TX_DELAY;        /**< RIF Mode Type Tx Delay, offset: 0xC36 */
  __IO uint16_t BTU_RIF_MODE_TYPE_RX_DELAY;        /**< RIF Mode Type Rx Delay, offset: 0xC38 */
  __IO uint16_t BTU_RIF_PKTCTL_OE_DELAY;           /**< RIF Packet Control OE Delay, offset: 0xC3A */
       uint8_t RESERVED_3[4];
  __IO uint16_t BTU_RIF_SWDBUS_CTL;                /**< RIF Software dBus Control, offset: 0xC40 */
  __IO uint16_t BTU_RIF_SWDBUS_EVENT;              /**< RIF Software dBus Event, - Max burst read or write: 8 bytes., offset: 0xC42 */
  __IO uint16_t BTU_RIF_SWDBUS_DATA_1_0;           /**< RIF Software dBus Data_1_0, offset: 0xC44 */
  __IO uint16_t BTU_RIF_SWDBUS_DATA_3_2;           /**< RIF Software dBus Data_3_2, offset: 0xC46 */
  __IO uint16_t BTU_RIF_SWDBUS_DATA_5_4;           /**< RIF Software dBus Data_5_4, offset: 0xC48 */
  __IO uint16_t BTU_RIF_SWDBUS_DATA_7_6;           /**< RIF Software dBus Data_7_6, offset: 0xC4A */
  __IO uint16_t BTU_RIF_TX_FESW;                   /**< RIF Tx FESW, offset: 0xC4C */
  __IO uint16_t BTU_RIF_RX_FESW;                   /**< RIF Rx FESW, offset: 0xC4E */
  __IO uint16_t BTU_RIF_RXPAON;                    /**< RIF Rx PA On, offset: 0xC50 */
  __IO uint16_t BTU_RIF_BRF_RX_PU;                 /**< RIF BRF Power Up for RX, brf_pu is the sideband signal used to turn on the BRF's power control., offset: 0xC52 */
  __IO uint16_t BTU_RIF_BTC_DBUS_TX_PKT_END;       /**< BTC RIF dBus Tx Packet End Control, offset: 0xC54 */
  __IO uint16_t BTU_RIF_BTC_DBUS_RX_PKT_END;       /**< BTC RIF dBus Rx Packet End Control, offset: 0xC56 */
  __IO uint16_t BTU_RIF_BTC_DBUS_TX_RAMPDOWN;      /**< BTC RIF dBus Tx Rampdown Control, offset: 0xC58 */
       uint8_t RESERVED_4[40];
  __IO uint16_t BTU_RIF_DBUS_COR_CONFIG_CTRL;      /**< RIF Correlator Configuration Control, offset: 0xC82 */
  __IO uint16_t BTU_RIF_BRF_COR_CONFIG_ADDR;       /**< RIF BRF Correlator Configuration Address, Only use in MRVL Gen3 Radio Mode., offset: 0xC84 */
  __IO uint16_t BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL; /**< RIF Syncword and Access Code Send Control, offset: 0xC86 */
  __IO uint16_t BTU_RIF_BRF_ACC_CODE_ONE_ADDR;     /**< RIF BRF Access Code 1 Address, offset: 0xC88 */
  __IO uint16_t BTU_RIF_BRF_ACC_CODE_TWO_ADDR;     /**< RIF Access Code 2 Address, offset: 0xC8A */
  __IO uint16_t BTU_RIF_BRF_RX_MODE_TYPE_ADDR;     /**< RIF Register, offset: 0xC8C */
  __IO uint16_t BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR;   /**< RIF Register, offset: 0xC8E */
  __IO uint16_t BTU_RIF_RX_SYNC_PULSE_TIMER;       /**< RIF BRF Rx Sync Pulse Timer, offset: 0xC90 */
  __IO uint16_t BTU_RIF_RX_BTC_SAMP_PHASE_ADJ;     /**< RIF Rx Sample Phase Adjustment, offset: 0xC92 */
  __IO uint16_t BTU_RIF_RX_BLE_SAMP_PHASE_ADJ;     /**< RIF Rx Sample Phase Adjustment, offset: 0xC94 */
  __IO uint16_t BTU_RIF_RX_TONE_CANCEL_CTRL;       /**< Rx Tone Cancellation Control, offset: 0xC96 */
  __IO uint16_t BTU_RIF_RX_TONE_CANCEL_CHNL10;     /**< Rx Tone Cancellation Channel, offset: 0xC98 */
  __IO uint16_t BTU_RIF_RX_TONE_CANCEL_CHNL32;     /**< Rx Tone Cancellation Channel, offset: 0xC9A */
       uint8_t RESERVED_5[4];
  __IO uint16_t BTU_RIF_BLE_CTL;                   /**< BLE RIF Control, offset: 0xCA0 */
  __IO uint16_t BTU_RIF_BLE_COR_LENGTH_SEL;        /**< BLE Correlation Length Selection, offset: 0xCA2 */
  __IO uint16_t BTU_RIF_BLE_COR_ACCESSADDR_0;      /**< BLE AccessCode, offset: 0xCA4 */
  __IO uint16_t BTU_RIF_BLE_COR_ACCESSADDR_1;      /**< BLE AccessCode, offset: 0xCA6 */
  __IO uint16_t BTU_RIF_BLE_COR_WINDOW_0;          /**< BLE Correlation Window Size, offset: 0xCA8 */
  __IO uint16_t BTU_RIF_BLE_COR_WINDOW_1;          /**< BLE Correlation Window Size, offset: 0xCAA */
  __IO uint16_t BTU_RIF_BLE_CLK_EN_DELAY;          /**< Tx/Rx Clock Enable Signal Delay, offset: 0xCAC */
  __IO uint16_t BTU_RIF_BLE_GO_DELAY;              /**< RIF Go Signal Delay, offset: 0xCAE */
  __IO uint16_t BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA;  /**< Tx Power Control DBUS Write Data, offset: 0xCB0 */
  __IO uint16_t BTU_RIF_BLE_DBUS_TX_FSYN_WDATA;    /**< Tx Fsyn DBUS Write Data, offset: 0xCB2 */
  __IO uint16_t BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA;  /**< Rx Power Control DBUS Write Data, offset: 0xCB4 */
  __IO uint16_t BTU_RIF_BLE_DBUS_RX_FSYN_WDATA;    /**< Rx Fsyn DBUS Write Data, offset: 0xCB6 */
  __IO uint16_t BTU_RIF_BLE_RX_SYNC_DELAY;         /**< BLE Rx Sync Delay, offset: 0xCB8 */
  __IO uint16_t BTU_RIF_DBUS_RX_PKT_STATUS;        /**< RIF dBus Rx Packet Status, offset: 0xCBA */
  __IO uint16_t BTU_RIF_DBUS_RX_MODETYPE;          /**< RIF dBus Rx Mode Type, offset: 0xCBC */
  __IO uint16_t BTU_RIF_BRF_RX_CTE_LEN_ADDR;       /**< RIF Register, offset: 0xCBE */
       uint8_t RESERVED_6[2];
  __IO uint16_t BTU_RIF_ARB_BLE_START_TIME_CODED;  /**< RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled., offset: 0xCC2 */
  __IO uint16_t BTU_RIF_ARB_BLE_START_TIME_1M;     /**< RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled., offset: 0xCC4 */
  __IO uint16_t BTU_RIF_ARB_BLE_START_TIME_2M;     /**< RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled., offset: 0xCC6 */
  __IO uint16_t BTU_RIF_ARB_CTL;                   /**< RIF ARB Control, offset: 0xCC8 */
       uint8_t RESERVED_7[2];
  __IO uint16_t BTU_RIF_CCA_GRANT_OFFSET_TIME;     /**< BTU CCA GRANT OFFSET TIME, BTU CCA Grant Offset Time, offset: 0xCCC */
  __IO uint16_t BTU_RIF_CCA_TX_FESW_OFFSET_TIME;   /**< BTU CCA TX FESW OFFSET TIME, BTU CCA TX FESW Offset Time, offset: 0xCCE */
  __IO uint16_t BTU_RIF_TESTBUS_SEL_0;             /**< RIF Testbus Select 0, offset: 0xCD0 */
  __IO uint16_t BTU_RIF_TESTBUS_SEL_1;             /**< RIF Testbus Select 1, offset: 0xCD2 */
  __IO uint16_t BTU_RIF_TESTBUS_OE;                /**< BTU Testbus Output Enable, offset: 0xCD4 */
  __IO uint16_t BTU_RIF_REG_DEBUG_SW_OUTDATA;      /**< BLE Debug Output Data, offset: 0xCD6 */
  __I  uint16_t BTU_RIF_REG_DEBUG_INDATA;          /**< BLE Debug Input Data, offset: 0xCD8 */
  __IO uint16_t BTU_RIF_REG_DEBUG_SW_MSG;          /**< BLE Debug Software Message, offset: 0xCDA */
  __I  uint16_t BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT; /**< BLE Debug Software Message FIFO Count, offset: 0xCDC */
  __IO uint16_t BTU_RIF_TESTBUS_CONTROL;           /**< RIF Testbus Control, offset: 0xCDE */
       uint8_t RESERVED_8[16];
  __IO uint16_t BTU_RIF_BT_CLK_GATING;             /**< RIF Bluetooth Clock Gating, offset: 0xCF0 */
       uint8_t RESERVED_9[2];
  __IO uint16_t BTU_RIF_CLK_SMPLD;                 /**< RIF Clock Sampled, Mux select for Sampled generation logic., offset: 0xCF4 */
       uint8_t RESERVED_10[2];
  __IO uint16_t BTU_RIF_BLE_CLK_GATING;            /**< RIF BLE Clock Gating, Clock Enable register for BLE Clocks., offset: 0xCF8 */
       uint8_t RESERVED_11[2];
  __IO uint16_t BTU_RIF_BLE_CLK_CTRL;              /**< RIF BLE Clock Control, Register for Clock Control Logic, offset: 0xCFC */
       uint8_t RESERVED_12[2];
  __IO uint16_t BTU_RIF_BLE_DBUS_TX_PKT_END;       /**< BLE RIF dBus Tx Packet End Control, offset: 0xD00 */
  __IO uint16_t BTU_RIF_BLE_DBUS_RX_PKT_END;       /**< BLE RIF dBus Rx Packet End Control, offset: 0xD02 */
  __IO uint16_t BTU_RIF_BLE_DBUS_TX_RAMPDOWN;      /**< BLE RIF dBus Tx Rampdown Control, offset: 0xD04 */
  __IO uint16_t BTU_RIF_BLE_DBUS_RSSI;             /**< BLE RIF dBus RSSI, offset: 0xD06 */
       uint8_t RESERVED_13[40];
  __IO uint16_t BTU_RIF_ADAPTIVITY_CTRL;           /**< BT Adaptivity Control, Register for BT Adaptivity Control, offset: 0xD30 */
       uint8_t RESERVED_14[8];
  __I  uint16_t BTU_RIF_BLE_CCA_ED_READBACK;       /**< BLE ED Mag readback value, BLE ED Mag readback value, offset: 0xD3A */
  __IO uint16_t BTU_RIF_DBUS_CCA_TX_PWRCTL;        /**< CCA TX PWRCTL Dbus, CCA TX PWRCTL Dbus, offset: 0xD3C */
  __IO uint16_t BTU_RIF_DBUS_CCA_TX_FSYN;          /**< CCA TX FSYN Dbus, CCA TX FSYN Dbus, offset: 0xD3E */
  __IO uint16_t BTU_RIF_DBUS_CCA_ED;               /**< CCA TX R2 Dbus, CCA TX R2 Dbus, offset: 0xD40 */
  __IO uint16_t BTU_RIF_BRF_CCA_ED_ADDR;           /**< BRF CCA ED Address, BRF CCA ED Address, offset: 0xD42 */
  __IO uint16_t BTU_RIF_BTC_CCA_CA1_2_DELAY;       /**< BTC CCA CA1 CA2 Delays, BTC CCA CA1 CA2 Delays, offset: 0xD44 */
       uint8_t RESERVED_15[2];
  __IO uint16_t BTU_RIF_BLE_CCA_EBRAM_ADDR;        /**< BLE CCA EBRAM Address Offset, BLE CCA EBRAM Address Offset, offset: 0xD48 */
  __IO uint16_t BTU_RIF_BLE_CCA_THRESHOLD;         /**< BLE CCA Counter thresholds, BLE CCA Counter thresholds, offset: 0xD4A */
       uint8_t RESERVED_16[4];
  __I  uint16_t BTU_RIF_CCA_BLE_THRESHOLD_MET_STS; /**< BLE CCA threshold met status, BLE CCA threshold met status, offset: 0xD50 */
       uint8_t RESERVED_17[4];
  __IO uint16_t BTU_RIF_CCA_BLE_RX_FESW_DELAY;     /**< BLE CCA RX FESW DELAYS, BLE CCA RX FESW DELAYS, offset: 0xD56 */
       uint8_t RESERVED_18[426];
  __IO uint16_t BTU_PTA_CTRL;                      /**< PTA Control, offset: 0xF02 */
  __IO uint16_t BTU_PTA_REQ_DELAY_TIMER;           /**< PTA Bt_Req Delay Timer, offset: 0xF04 */
       uint8_t RESERVED_19[14];
  __IO uint16_t BTU_PTA_BLE_RIF_ARB_COEX_PRI;      /**< BLE PTA Priority for BTC/BLE arbitration, BLE coex priority for BTC/BLE arbitration., offset: 0xF14 */
  __IO uint16_t BTU_PTA_BLE_BCA_COEX_PRI;          /**< BLE PTA Priority for BCA arbitration, BLE coex priority for BCA arbitration., offset: 0xF16 */
  __I  uint16_t BTU_PTA_MWS_INACTIVITY_REFCLK_0;   /**< Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt, offset: 0xF18 */
  __I  uint16_t BTU_PTA_MWS_INACTIVITY_REFCLK_1;   /**< Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt, offset: 0xF1A */
  __I  uint16_t BTU_PTA_MWS_INACTIVITY_REFPDB_CNT; /**< Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int Interrupt, offset: 0xF1C */
  __IO uint16_t BTU_PTA_INBAND_FREQ_SET_1;         /**< PTA Inband Frequency Set 0, BT_FREQ is set when (BT_In_Band_Hi >= freqNr >= BT_In_Band_Lo) in MRVL Coexistence mode and BT_In_Band1_Freq_En is enabled. 2 sets of band gaps; final BT_FREQ is OR version of 2 sets., offset: 0xF1E */
  __IO uint16_t BTU_PTA_MODE_SELECT;               /**< PTA Mode Select, offset: 0xF20 */
  __IO uint16_t BTU_PTA_INBAND_FREQ_SET_0;         /**< PTA Inband Frequency Set 1, BT_FREQ is set when (BT_In_Band_Hi >= freqNr >= BT_In_Band_Lo) in MRVL Coexistence mode. 2 sets of band gaps; final BT_FREQ is OR version of 2 sets., offset: 0xF22 */
  __I  uint16_t BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0; /**< Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt, offset: 0xF24 */
  __I  uint16_t BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1; /**< Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt, offset: 0xF26 */
  __I  uint16_t BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT; /**< Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt, offset: 0xF28 */
  __I  uint16_t BTU_PTA_HARQ_PATTERN_SEL_VAL;      /**< MWS Coex Signal HARQ_PATTERN_SEL Value, offset: 0xF2A */
  __IO uint16_t BTU_PTA_INFO_DELAY_TIMER;          /**< PTA Info Delay Timer, offset: 0xF2C */
       uint8_t RESERVED_20[4];
  __IO uint16_t BTU_PTA_BLE_SYNC_CTRL;             /**< PTA BLE Sync Control, offset: 0xF32 */
  __I  uint16_t BTU_PTA_PRI_INC_EBRAM_ADDR;        /**< EBRAM Base Address: PTA Priority Escalation, offset: 0xF34 */
  __IO uint16_t BTU_PTA_SYNC_CTRL;                 /**< PTA Voice/WLAN Sync Control, offset: 0xF36 */
  __IO uint16_t BTU_PTA_BLE_TX_PWR_THRHD;          /**< BLE Tx Power Threshold to Suppress Tx Overlap Assertion, offset: 0xF38 */
       uint8_t RESERVED_21[8];
  __IO uint16_t BTU_PTA_STATE_DELAY_TIMER;         /**< PTA Bt_State Delay Timer, offset: 0xF42 */
  __IO uint16_t BTU_PTA_SLNA_CTRL;                 /**< PTA SLNA Control, offset: 0xF44 */
  __IO uint16_t BTU_PTA_TX_POWER_THRESHOLD;        /**< Tx Power Threshold to Suppress Tx Overlap Assertion, offset: 0xF46 */
  __IO uint16_t BTU_PTA_MWS_TX_OVERLAP_RANGE;      /**< MWS Frequency Overlap Range for Bluetooth Tx Slot, offset: 0xF48 */
  __IO uint16_t BTU_PTA_MWS_RX_OVERLAP_RANGE;      /**< MWS Frequency Overlap Range for Bluetooth Rx Slot, offset: 0xF4A */
  __IO uint16_t BTU_PTA_MWS_COEX_BT_TX_ON_START;   /**< MWS Coex Signal BT_TX_ON Start Timer, offset: 0xF4C */
  __IO uint16_t BTU_PTA_MWS_COEX_BT_TX_ON_END;     /**< MWS Coex Signal BT_TX_ON End Timer, offset: 0xF4E */
  __IO uint16_t BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST; /**< MWS Coex Signal BT_RX_PRI Start Timer for Master Mode, offset: 0xF50 */
  __IO uint16_t BTU_PTA_MWS_COEX_BT_RX_PRI_END;    /**< MWS Coex Signal BT_RX_PRI End Timer, offset: 0xF52 */
  __I  uint16_t BTU_PTA_MWS_FRAMESYNC_REFCLK_0;    /**< Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt, offset: 0xF54 */
  __I  uint16_t BTU_PTA_MWS_FRAMESYNC_REFCLK_1;    /**< Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt, offset: 0xF56 */
  __I  uint16_t BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT;  /**< Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse Interrupt, offset: 0xF58 */
  __I  uint16_t BTU_PTA_MWS_PATTERN_REFCLK_0;      /**< Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt, offset: 0xF5A */
  __I  uint16_t BTU_PTA_MWS_PATTERN_REFCLK_1;      /**< Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt, offset: 0xF5C */
  __I  uint16_t BTU_PTA_MWS_PATTERN_REFPDB_CNT;    /**< Bluetooth Reference pdBitCounter Snapshot on MWS_Pattern_Real_Int Interrupt, offset: 0xF5E */
  __I  uint16_t BTU_PTA_MWS_PATTERN_VAL;           /**< MWS Coex Signal MWS_PATTERN Value, offset: 0xF60 */
  __I  uint16_t BTU_PTA_3DG_CLK_UPDATE_REFCLK_0;   /**< Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt, offset: 0xF62 */
  __I  uint16_t BTU_PTA_3DG_CLK_UPDATE_REFCLK_1;   /**< Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt, offset: 0xF64 */
  __I  uint16_t BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT; /**< Bluetooth Reference pdBitCounter Snapshot on BT_3DG_CLK_UPDATE Pulse Interrupt, offset: 0xF66 */
  __IO uint16_t BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4;   /**< MWS Scan Frequency Overlap Range 1~4, offset: 0xF68 */
  __IO uint16_t BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8;   /**< MWS Scan Frequency Overlap Range 5~8, offset: 0xF6A */
  __IO uint16_t BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12;  /**< MWS Scan Frequency Overlap Range 9~12, offset: 0xF6C */
  __IO uint16_t BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16; /**< MWS Scan Frequency Overlap Range 13~16, offset: 0xF6E */
  __IO uint16_t BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20; /**< MWS Scan Frequency Overlap Range 17~20, offset: 0xF70 */
  __IO uint16_t BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24; /**< MWS Scan Frequency Overlap Range 21~24, offset: 0xF72 */
  __IO uint16_t BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28; /**< MWS Scan Frequency Overlap Range 25~28, offset: 0xF74 */
  __IO uint16_t BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31; /**< MWS Scan Frequency Overlap Range 29~31, offset: 0xF76 */
  __IO uint16_t BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL;  /**< MWS Coex Early BT_RX_PRI Control, offset: 0xF78 */
  __IO uint16_t BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST; /**< MWS Coex Early BT_RX_PRI Start Offset for Master Mode, offset: 0xF7A */
  __IO uint16_t BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV; /**< MWS Coex Early BT_RX_PRI Start Offset for Slave Mode, offset: 0xF7C */
  __IO uint16_t BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV; /**< MWS Coex Signal BT_RX_PRI Start Timer for Slave Mode, offset: 0xF7E */
       uint8_t RESERVED_22[16];
  __IO uint16_t BTU_PTA_ANT_SWITCH_CTRL;           /**< PTA Antenna Switch Control, Antenna switch control for BCA arbitration., offset: 0xF90 */
       uint8_t RESERVED_23[18];
  __IO uint16_t BTU_PTA_RSSI_ARB_CTRL;             /**< BTU RSSI Arbitration Control, RSSI Based arbitration register controls like feature enable; RSSI value from EBRAM or register selection; average RSSI orRSSI for last received packet, offset: 0xFA4 */
} BTU2_Type;

/* ----------------------------------------------------------------------------
   -- BTU2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup BTU2_Register_Masks BTU2 Register Masks
 * @{
 */

/*! @name BTU_RIF_CTL0 - RIF Control 0 */
/*! @{ */

#define BTU2_BTU_RIF_CTL0_brf_rd_data_turnaround_MASK (0x1U)
#define BTU2_BTU_RIF_CTL0_brf_rd_data_turnaround_SHIFT (0U)
/*! brf_rd_data_turnaround - BRF Read Data Turnaround, 0x0: BRF read data will be ready on the next
 *    clock cycle after address given, 0x1: BRF needs one more clock cycle between address and read
 *    data
 */
#define BTU2_BTU_RIF_CTL0_brf_rd_data_turnaround(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTL0_brf_rd_data_turnaround_SHIFT)) & BTU2_BTU_RIF_CTL0_brf_rd_data_turnaround_MASK)

#define BTU2_BTU_RIF_CTL0_brf_agc_counter_readback_enable_MASK (0x2U)
#define BTU2_BTU_RIF_CTL0_brf_agc_counter_readback_enable_SHIFT (1U)
/*! brf_agc_counter_readback_enable - Enable BRF readback LNA; CBPF and ADC overflow counters after
 *    AGC freeze, 0x0: BRF only readback RSSI and noise floor values at RSSI, 0x1: BRF readback
 *    extra 3 bytes (LNA; CBPF and ADC overflow counters) after RSSI read
 */
#define BTU2_BTU_RIF_CTL0_brf_agc_counter_readback_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTL0_brf_agc_counter_readback_enable_SHIFT)) & BTU2_BTU_RIF_CTL0_brf_agc_counter_readback_enable_MASK)

#define BTU2_BTU_RIF_CTL0_radio_type_MASK        (0x700U)
#define BTU2_BTU_RIF_CTL0_radio_type_SHIFT       (8U)
/*! radio_type - Radio Type, 0x0: Unknown, 0x1: Marvell Gen3 radio; dBus mode, 0x2: Marvell Gen4 radio; dBus mode */
#define BTU2_BTU_RIF_CTL0_radio_type(x)          (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTL0_radio_type_SHIFT)) & BTU2_BTU_RIF_CTL0_radio_type_MASK)

#define BTU2_BTU_RIF_CTL0_radio_mode_MASK        (0x1800U)
#define BTU2_BTU_RIF_CTL0_radio_mode_SHIFT       (11U)
/*! radio_mode - Radio Mode Selection, 0x0: Marvell Radio Mode, 0x1: KW Radio; Sideband RIF interface, 0x2: Unused, 0x3: Unused */
#define BTU2_BTU_RIF_CTL0_radio_mode(x)          (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTL0_radio_mode_SHIFT)) & BTU2_BTU_RIF_CTL0_radio_mode_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RSSI_ADDR - RIF BRF RSSI Address */
/*! @{ */

