zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_BRF_RSSI_ADDR_rssi_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_RSSI_ADDR_rssi_addr_SHIFT (0U)
/*! rssi_addr - RSSI Address, Address of the RSSI register in the radio. */
#define BTU2_BTU_RIF_BRF_RSSI_ADDR_rssi_addr(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_RSSI_ADDR_rssi_addr_SHIFT)) & BTU2_BTU_RIF_BRF_RSSI_ADDR_rssi_addr_MASK)
/*! @} */

/*! @name BTU_RIF_CTRL1 - RIF Control 1 */
/*! @{ */

#define BTU2_BTU_RIF_CTRL1_bt_reg_rif_bt_4m_clk_ena_MASK (0x20U)
#define BTU2_BTU_RIF_CTRL1_bt_reg_rif_bt_4m_clk_ena_SHIFT (5U)
/*! bt_reg_rif_bt_4m_clk_ena - RIF Clock Gate Enable Override, RIF Clock Gate Enable Override; if
 *    set to 1; clock gating for RIF clock is disabled = ungated clocks.
 */
#define BTU2_BTU_RIF_CTRL1_bt_reg_rif_bt_4m_clk_ena(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTRL1_bt_reg_rif_bt_4m_clk_ena_SHIFT)) & BTU2_BTU_RIF_CTRL1_bt_reg_rif_bt_4m_clk_ena_MASK)

#define BTU2_BTU_RIF_CTRL1_bd_spi_data_bidir_MASK (0x40U)
#define BTU2_BTU_RIF_CTRL1_bd_spi_data_bidir_SHIFT (6U)
/*! bd_spi_data_bidir - Uni- or Bi-directional dBus Data Line Selection, 0x0: uni-directional, 0x1: bi-directional */
#define BTU2_BTU_RIF_CTRL1_bd_spi_data_bidir(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTRL1_bd_spi_data_bidir_SHIFT)) & BTU2_BTU_RIF_CTRL1_bd_spi_data_bidir_MASK)

#define BTU2_BTU_RIF_CTRL1_bd_rxtx_data_bidir_MASK (0x80U)
#define BTU2_BTU_RIF_CTRL1_bd_rxtx_data_bidir_SHIFT (7U)
/*! bd_rxtx_data_bidir - Uni- or Bi-directional RxData and TxData Line Selection, 0x0: uni-directional, 0x1: bi-directional */
#define BTU2_BTU_RIF_CTRL1_bd_rxtx_data_bidir(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTRL1_bd_rxtx_data_bidir_SHIFT)) & BTU2_BTU_RIF_CTRL1_bd_rxtx_data_bidir_MASK)

#define BTU2_BTU_RIF_CTRL1_rssi_value_MASK       (0xFF00U)
#define BTU2_BTU_RIF_CTRL1_rssi_value_SHIFT      (8U)
/*! rssi_value - RSSI Value, The latest received RSSI value from the radio. This can be used to get
 *    RSSI values before a link is setup; for example; for FCS. To get RSSI value for an existing
 *    link use the DIAG area in EBRAM.
 */
#define BTU2_BTU_RIF_CTRL1_rssi_value(x)         (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTRL1_rssi_value_SHIFT)) & BTU2_BTU_RIF_CTRL1_rssi_value_MASK)
/*! @} */

/*! @name BTU_RIF_RXON - RIF RXON */
/*! @{ */

#define BTU2_BTU_RIF_RXON_rxon_fixed_MASK        (0x80U)
#define BTU2_BTU_RIF_RXON_rxon_fixed_SHIFT       (7U)
/*! rxon_fixed - RxOn fixed or use programmable timing, 0x0: use start and stop timing parameters, 0x1: rxOn = RxOn_Start[6] */
#define BTU2_BTU_RIF_RXON_rxon_fixed(x)          (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RXON_rxon_fixed_SHIFT)) & BTU2_BTU_RIF_RXON_rxon_fixed_MASK)

#define BTU2_BTU_RIF_RXON_rxon_stop_MASK         (0xFF00U)
#define BTU2_BTU_RIF_RXON_rxon_stop_SHIFT        (8U)
/*! rxon_stop - Delay from Rx finished (rifRx low) to rxOn falling edge, - Resolution: 0.25 us. */
#define BTU2_BTU_RIF_RXON_rxon_stop(x)           (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RXON_rxon_stop_SHIFT)) & BTU2_BTU_RIF_RXON_rxon_stop_MASK)
/*! @} */

/*! @name BTU_RIF_PLLCLKEN_ON_DELAY - RIF PLL Clock Enable */
/*! @{ */

#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_on_delay_qus_MASK (0xFFU)
#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_on_delay_qus_SHIFT (0U)
/*! brf_pll_clk_en_on_delay_qus - Delay from wakeUp to turning of BRF's PLL clock, - Resolution: 0.25 us. */
#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_on_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_on_delay_qus_SHIFT)) & BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_on_delay_qus_MASK)

#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_early_en_MASK (0x2000U)
#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_early_en_SHIFT (13U)
/*! brf_pll_clk_early_en - Activate brf_pll_clk_en earlier along with brf_pu, 0x0: Activate
 *    brf_pll_clk_en at normal delay, 0x1: Activate brf_pll_clk_en earlier along with brf_pu
 */
#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_early_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_early_en_SHIFT)) & BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_early_en_MASK)

#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_nb_MASK (0x4000U)
#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_nb_SHIFT (14U)
/*! brf_pll_clk_en_nb - Activate brf_pll_clk_en during NB/MB scan packets Enable, 0x0: keep off
 *    during NB/MB scan packets, 0x1: activate brf_pll_clk_en during NB/MB scan packets
 */
#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_nb(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_nb_SHIFT)) & BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_nb_MASK)

#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_fixed_MASK (0x8000U)
#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_fixed_SHIFT (15U)
/*! brf_pll_clk_en_fixed - Use fixed value for brf_pll_clk_en, 0x0: on/off_delay registers control
 *    the timing, 0x1: brf_pll_clk_en is the fixed value of bit[0]
 */
#define BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_fixed(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_fixed_SHIFT)) & BTU2_BTU_RIF_PLLCLKEN_ON_DELAY_brf_pll_clk_en_fixed_MASK)
/*! @} */

/*! @name BTU_RIF_TXON - RIF Tx On */
/*! @{ */

#define BTU2_BTU_RIF_TXON_txon_fixed_MASK        (0x80U)
#define BTU2_BTU_RIF_TXON_txon_fixed_SHIFT       (7U)
/*! txon_fixed - TxOn fixed; or use programmable timing, 0x0: use start and stop timing parameters, 0x1: txOn = TxOn_Start[6] */
#define BTU2_BTU_RIF_TXON_txon_fixed(x)          (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TXON_txon_fixed_SHIFT)) & BTU2_BTU_RIF_TXON_txon_fixed_MASK)

#define BTU2_BTU_RIF_TXON_txon_stop_MASK         (0xFF00U)
#define BTU2_BTU_RIF_TXON_txon_stop_SHIFT        (8U)
/*! txon_stop - Delay from Tx finished (rifTx low) to txOn falling edge, - Resolution: 0.25 us. */
#define BTU2_BTU_RIF_TXON_txon_stop(x)           (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TXON_txon_stop_SHIFT)) & BTU2_BTU_RIF_TXON_txon_stop_MASK)
/*! @} */

/*! @name BTU_RIF_PLLCLKEN_OFF_DELAY - RIF PLL Clock Enable Off Delay */
/*! @{ */

