zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_PLLCLKEN_OFF_DELAY_brf_pll_clk_en_off_delay_MASK (0x7FU)
#define BTU2_BTU_RIF_PLLCLKEN_OFF_DELAY_brf_pll_clk_en_off_delay_SHIFT (0U)
/*! brf_pll_clk_en_off_delay - Delay from final dBus access finishing to turning off BRF PLL clock, - Resolution: 0.25 us. */
#define BTU2_BTU_RIF_PLLCLKEN_OFF_DELAY_brf_pll_clk_en_off_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PLLCLKEN_OFF_DELAY_brf_pll_clk_en_off_delay_SHIFT)) & BTU2_BTU_RIF_PLLCLKEN_OFF_DELAY_brf_pll_clk_en_off_delay_MASK)
/*! @} */

/*! @name BTU_RIF_FREQ - RIF FREQ */
/*! @{ */

#define BTU2_BTU_RIF_FREQ_rxtx_freq_MASK         (0x100U)
#define BTU2_BTU_RIF_FREQ_rxtx_freq_SHIFT        (8U)
/*! rxtx_freq - Rx or Tx Slot Indication, 0x0: Tx slot, 0x1: Rx slot */
#define BTU2_BTU_RIF_FREQ_rxtx_freq(x)           (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_FREQ_rxtx_freq_SHIFT)) & BTU2_BTU_RIF_FREQ_rxtx_freq_MASK)

#define BTU2_BTU_RIF_FREQ_freq_MASK              (0xFE00U)
#define BTU2_BTU_RIF_FREQ_freq_SHIFT             (9U)
/*! freq - Channel Hop Frequency Number */
#define BTU2_BTU_RIF_FREQ_freq(x)                (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_FREQ_freq_SHIFT)) & BTU2_BTU_RIF_FREQ_freq_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_TX_PU - RIF BRF Power Up for TX, brf_pu is the sideband signal used to turn on the BRF's power control. */
/*! @{ */

#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_on_delay_qus_MASK (0xFFU)
#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_on_delay_qus_SHIFT (0U)
/*! brf_tx_pu_on_delay_qus - brf_pu on delay, Delay from wakeUp to turning on brf_pu. Resolution: 0.25 us. */
#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_on_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_on_delay_qus_SHIFT)) & BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_on_delay_qus_MASK)

#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_off_delay_qus_MASK (0x7F00U)
#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_off_delay_qus_SHIFT (8U)
/*! brf_tx_pu_off_delay_qus - brf_pu off delay, Delay from last dBus access to turning off brf_pu. Resolution: 0.25 us. */
#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_off_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_off_delay_qus_SHIFT)) & BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_off_delay_qus_MASK)

#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_fixed_MASK (0x8000U)
#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_fixed_SHIFT (15U)
/*! brf_tx_pu_fixed - Set brf_pu to a fixed value., BRF power up value., 0x0: use programmable
 *    timers, 0x1: fixed; brf_pu = brf_tx_pu_on_delay_us[0]
 */
#define BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_fixed(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_fixed_SHIFT)) & BTU2_BTU_RIF_BRF_TX_PU_brf_tx_pu_fixed_MASK)
/*! @} */

/*! @name BTU_RIF_CTRL2 - RIF Control 2 */
/*! @{ */

#define BTU2_BTU_RIF_CTRL2_tx_data_inv_MASK      (0x2000U)
#define BTU2_BTU_RIF_CTRL2_tx_data_inv_SHIFT     (13U)
/*! tx_data_inv - Invert Tx data, 0x0: normal operation, 0x1: transmit data inverted */
#define BTU2_BTU_RIF_CTRL2_tx_data_inv(x)        (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTRL2_tx_data_inv_SHIFT)) & BTU2_BTU_RIF_CTRL2_tx_data_inv_MASK)

#define BTU2_BTU_RIF_CTRL2_rx_data_inv_MASK      (0x4000U)
#define BTU2_BTU_RIF_CTRL2_rx_data_inv_SHIFT     (14U)
/*! rx_data_inv - Invert Rx data, 0x0: normal operation, 0x1: receive data inverted */
#define BTU2_BTU_RIF_CTRL2_rx_data_inv(x)        (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CTRL2_rx_data_inv_SHIFT)) & BTU2_BTU_RIF_CTRL2_rx_data_inv_MASK)
/*! @} */

/*! @name BTU_RIF_TX_PULSE - RIF Tx Pulse */
/*! @{ */

#define BTU2_BTU_RIF_TX_PULSE_tx_pulse_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_TX_PULSE_tx_pulse_delay_SHIFT (0U)
/*! tx_pulse_delay - Tx Pulse Delay, Delay between wakeUp and txData sync plulse for dBus radio
 *    types. Resolution 0.25 us. The following formula must be fulfilled: doTxPulse < TxOn_Start +
 *    LinkDelay.
 */
#define BTU2_BTU_RIF_TX_PULSE_tx_pulse_delay(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TX_PULSE_tx_pulse_delay_SHIFT)) & BTU2_BTU_RIF_TX_PULSE_tx_pulse_delay_MASK)

#define BTU2_BTU_RIF_TX_PULSE_tx_pulse_en_MASK   (0x8000U)
#define BTU2_BTU_RIF_TX_PULSE_tx_pulse_en_SHIFT  (15U)
/*! tx_pulse_en - Enable TxData sync pulse, 0x0: TxData sync pulse deactivated and pulse not
 *    generated, 0x1: TxData sync pulse activated and pulse generated
 */
#define BTU2_BTU_RIF_TX_PULSE_tx_pulse_en(x)     (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TX_PULSE_tx_pulse_en_SHIFT)) & BTU2_BTU_RIF_TX_PULSE_tx_pulse_en_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_TX_PWRCTL - RIF dBus Tx Power Control */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_delay_SHIFT (0U)
/*! dbus_tx_pwr_ctrl_wr_delay - Delay from the trigger to start Tx Power Control Write dBus, Delay
 *    from rif_tx_req to enable Tx power control dBus writes. Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_delay_MASK)

#define BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_enable_SHIFT (15U)
/*! dbus_tx_pwr_ctrl_wr_enable - Enable Automatic Tx Power Control Write on the dBus */
#define BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_TX_PWRCTL_dbus_tx_pwr_ctrl_wr_enable_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_PWRCTL - RIF dBus Rx Power Control */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_delay_SHIFT (0U)
/*! dbus_rx_pwr_ctrl_wr_delay - Delay from the trigger to start Rx Power Control Write dBus, Delay
 *    from rif_rx_req to enable Rx power control dBus writes. Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_delay_MASK)

#define BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_enable_SHIFT (15U)
/*! dbus_rx_pwr_ctrl_wr_enable - Enable Automatic Rx Power Control Write on dBus */
#define BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_PWRCTL_dbus_rx_pwr_ctrl_wr_enable_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RXPWRCTL_ADDR - RIF BRF Rx Power Control Address */
/*! @{ */

#define BTU2_BTU_RIF_BRF_RXPWRCTL_ADDR_rx_pwr_ctrl_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_RXPWRCTL_ADDR_rx_pwr_ctrl_addr_SHIFT (0U)
/*! rx_pwr_ctrl_addr - Radio Register Address for Rx Power Control */
#define BTU2_BTU_RIF_BRF_RXPWRCTL_ADDR_rx_pwr_ctrl_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_RXPWRCTL_ADDR_rx_pwr_ctrl_addr_SHIFT)) & BTU2_BTU_RIF_BRF_RXPWRCTL_ADDR_rx_pwr_ctrl_addr_MASK)
/*! @} */

