zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*! @name BTU_RIF_BRF_FSYN_ADDR - RIF BRF FSYN Address */
/*! @{ */

#define BTU2_BTU_RIF_BRF_FSYN_ADDR_fsyn_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_FSYN_ADDR_fsyn_addr_SHIFT (0U)
/*! fsyn_addr - Radio Register Start Address for Fsyn data */
#define BTU2_BTU_RIF_BRF_FSYN_ADDR_fsyn_addr(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_FSYN_ADDR_fsyn_addr_SHIFT)) & BTU2_BTU_RIF_BRF_FSYN_ADDR_fsyn_addr_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_TXPWRCTL_ADDR - RIF BRF Tx Power Control Address */
/*! @{ */

#define BTU2_BTU_RIF_BRF_TXPWRCTL_ADDR_tx_pwr_ctrl_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_TXPWRCTL_ADDR_tx_pwr_ctrl_addr_SHIFT (0U)
/*! tx_pwr_ctrl_addr - Radio Register Address for Tx Power Control */
#define BTU2_BTU_RIF_BRF_TXPWRCTL_ADDR_tx_pwr_ctrl_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_TXPWRCTL_ADDR_tx_pwr_ctrl_addr_SHIFT)) & BTU2_BTU_RIF_BRF_TXPWRCTL_ADDR_tx_pwr_ctrl_addr_MASK)
/*! @} */

/*! @name BTU_RIF_BTC_DBUS_RSSI - BTC RIF dBus RSSI */
/*! @{ */

#define BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_delay_SHIFT (0U)
/*! dbus_rssi_delay - Delay from RSSI trigger to start of RSSI read, Delay from the end of
 *    rif_rx_req to enable dBus RSSI read back., Resolution 0.25 us.
 */
#define BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_delay_SHIFT)) & BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_delay_MASK)

#define BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_enable_SHIFT (15U)
/*! dbus_rssi_enable - Enable Automatic Reading of RSSI on the dBus, 0x0: disable automatic reading
 *    of RSSI, 0x1: enable automatic reading of RSSI
 */
#define BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_enable_SHIFT)) & BTU2_BTU_RIF_BTC_DBUS_RSSI_dbus_rssi_enable_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_TX_FSYN - RIF Tx dBus Fsyn */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_delay_SHIFT (0U)
/*! dbus_tx_fsyn_delay - Tx dBus Fsyn Delay, Delay from start of new Tx slot (i.e.; rif_tx_req) to
 *    sending the fsync information on the dBus., Resolution 0.25 us.
 */
#define BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_delay_MASK)

#define BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_wr_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_wr_enable_SHIFT (15U)
/*! dbus_tx_fsyn_wr_enable - Tx dBus Fsyn Enable, Enables Tx automatic sending of fsync information
 *    on the dBus., 0x0: disable automatic sending of fsync info, 0x1: enable automatic sending of
 *    fsync info
 */
#define BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_wr_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_wr_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_TX_FSYN_dbus_tx_fsyn_wr_enable_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_FSYN - RIF Rx dBus Fsyn */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_delay_SHIFT (0U)
/*! dbus_rx_fsyn_delay - Rx dBus Hop Delay, Delay time after start of Rx new slot (i.e.; rif_rx_req)
 *    to sending the fsync information on the dBus., Resolution 0.25 us.
 */
#define BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_delay_MASK)

#define BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_wr_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_wr_enable_SHIFT (15U)
/*! dbus_rx_fsyn_wr_enable - Rx dBus Fsyn Enable, Enable Rx automatic sending of fsync information
 *    on the dBus., 0x0: disable automatic sending of fsync info, 0x1: enable automatic sending of
 *    fsync info
 */
#define BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_wr_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_wr_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_FSYN_dbus_rx_fsyn_wr_enable_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_PKT_LEN - RIF dBus Rx Packet Length */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_cte_len_enable_MASK (0x4000U)
#define BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_cte_len_enable_SHIFT (14U)
/*! dbus_rx_cte_len_enable - dBus Rx CTE Length Enable, Enable Automatic Sending Rx Packet CTE
 *    Length on the dBus., 0x0: disable automatic dbus sending Rx packet CTE length, 0x1: enable
 *    automatic dbus sending Rx packet CTE length
 */
#define BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_cte_len_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_cte_len_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_cte_len_enable_MASK)

#define BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_pkt_len_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_pkt_len_enable_SHIFT (15U)
/*! dbus_rx_pkt_len_enable - dBus Rx Packet Length Enable, Enable Automatic Sending Rx Packet
 *    Payload Length (including payload header; data; and crc) on the dBus., 0x0: disable automatic dbus
 *    sending Rx packet payload length, 0x1: enable automatic dbus sending Rx packet payload length
 */
#define BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_pkt_len_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_pkt_len_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_PKT_LEN_dbus_rx_pkt_len_enable_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_PULSE_RX_DELAY - RIF BLE Pulse Rx Delay */
/*! @{ */

#define BTU2_BTU_RIF_BLE_PULSE_RX_DELAY_ble_pulse_rx_delay_MASK (0x3FFU)
#define BTU2_BTU_RIF_BLE_PULSE_RX_DELAY_ble_pulse_rx_delay_SHIFT (0U)
/*! ble_pulse_rx_delay - BLE Pulse Rx Delay, Timing Variable from rif_rx_req to BLE Pulse on Rx.
 *    Only assert under BLE traffic; and must be less or equal to BTU_RIF_RXPAON[9:0] - 4., -
 *    Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_BLE_PULSE_RX_DELAY_ble_pulse_rx_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_PULSE_RX_DELAY_ble_pulse_rx_delay_SHIFT)) & BTU2_BTU_RIF_BLE_PULSE_RX_DELAY_ble_pulse_rx_delay_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_PULSE_TX_DELAY - RIF BLE Pulse Tx Delay */
/*! @{ */

#define BTU2_BTU_RIF_BLE_PULSE_TX_DELAY_ble_pulse_tx_delay_MASK (0x3FFU)
#define BTU2_BTU_RIF_BLE_PULSE_TX_DELAY_ble_pulse_tx_delay_SHIFT (0U)
/*! ble_pulse_tx_delay - BLE Pulse Tx Delay, Timing Variable from rif_rx_req to BLE Pulse on Tx.
 *    Only assert under BLE traffic; and must be less or equal to BTU_RIF_TXPAON[9:0] - 4., -
 *    Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_BLE_PULSE_TX_DELAY_ble_pulse_tx_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_PULSE_TX_DELAY_ble_pulse_tx_delay_SHIFT)) & BTU2_BTU_RIF_BLE_PULSE_TX_DELAY_ble_pulse_tx_delay_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_MODE_TYPE - RIF dBus Rx Mode Type */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_RX_MODE_TYPE_dbus_rx_mode_type_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_RX_MODE_TYPE_dbus_rx_mode_type_enable_SHIFT (15U)
/*! dbus_rx_mode_type_enable - dBus Rx Mode Type Enable, Enable Automatic Sending Rx Mode Type
 *    (decoded from packet header) on the dBus., 0x0: disable automatic dbus sending Rx mode type, 0x1:
 *    enable automatic dbus sending Rx mode type
 */
#define BTU2_BTU_RIF_DBUS_RX_MODE_TYPE_dbus_rx_mode_type_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_MODE_TYPE_dbus_rx_mode_type_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_MODE_TYPE_dbus_rx_mode_type_enable_MASK)
/*! @} */

/*! @name BTU_RIF_MODE_TYPE_TX_DELAY - RIF Mode Type Tx Delay */
/*! @{ */

#define BTU2_BTU_RIF_MODE_TYPE_TX_DELAY_mode_type_tx_delay_MASK (0x3FFU)
#define BTU2_BTU_RIF_MODE_TYPE_TX_DELAY_mode_type_tx_delay_SHIFT (0U)
/*! mode_type_tx_delay - Mode Type Tx Delay, Time from the assertion of modTypeTx to the deassertion of modTypeTx., - Resolution: 0.25 us. */
#define BTU2_BTU_RIF_MODE_TYPE_TX_DELAY_mode_type_tx_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_MODE_TYPE_TX_DELAY_mode_type_tx_delay_SHIFT)) & BTU2_BTU_RIF_MODE_TYPE_TX_DELAY_mode_type_tx_delay_MASK)
/*! @} */

/*! @name BTU_RIF_MODE_TYPE_RX_DELAY - RIF Mode Type Rx Delay */
/*! @{ */

