zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_MODE_TYPE_RX_DELAY_mode_type_rx_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_MODE_TYPE_RX_DELAY_mode_type_rx_delay_SHIFT (0U)
/*! mode_type_rx_delay - Mode Type Rx Delay, Time from the assertion of modTypeRx to the deassertion
 *    of modTypeRx. For Gen4; it anchors the end of packet header for Rx sampling., - Resolution:
 *    0.25 us.
 */
#define BTU2_BTU_RIF_MODE_TYPE_RX_DELAY_mode_type_rx_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_MODE_TYPE_RX_DELAY_mode_type_rx_delay_SHIFT)) & BTU2_BTU_RIF_MODE_TYPE_RX_DELAY_mode_type_rx_delay_MASK)
/*! @} */

/*! @name BTU_RIF_PKTCTL_OE_DELAY - RIF Packet Control OE Delay */
/*! @{ */

#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_modetype_MASK (0xFU)
#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_modetype_SHIFT (0U)
/*! pkt_ctl_oe_delay_modetype - Packet Control OE Delay Mode Type, Time from the Deassertion of
 *    modType to the Deassertion of pktCtl_oe., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_modetype(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_modetype_SHIFT)) & BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_modetype_MASK)

#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_ppulse_MASK (0xF0U)
#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_ppulse_SHIFT (4U)
/*! pkt_ctl_oe_delay_ppulse - Packet Control OE Delay P Pulse, Time from the Deassertion of P pulse
 *    to the Deasserttion of pktCtl oe., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_ppulse(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_ppulse_SHIFT)) & BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_ppulse_MASK)

#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_hdrstart_MASK (0xF00U)
#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_hdrstart_SHIFT (8U)
/*! pkt_ctl_oe_delay_hdrstart - Packet Control OE Delay Header Start, Time from the Deassertion of
 *    Header Start pulse to the Assertion of pktCtl oe., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_hdrstart(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_hdrstart_SHIFT)) & BTU2_BTU_RIF_PKTCTL_OE_DELAY_pkt_ctl_oe_delay_hdrstart_MASK)

#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_rf_bypass_MASK (0x8000U)
#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_rf_bypass_SHIFT (15U)
/*! rf_bypass - Radio Bypass Mode Used for Baseband to Baseband Testing, When set; it will do two
 *    things on pktCtrl_1:, - On Rx slot; it sets output enable as input., - On Tx slot; it generates
 *    a sync pulse before payload.
 */
#define BTU2_BTU_RIF_PKTCTL_OE_DELAY_rf_bypass(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_PKTCTL_OE_DELAY_rf_bypass_SHIFT)) & BTU2_BTU_RIF_PKTCTL_OE_DELAY_rf_bypass_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_CTL - RIF Software dBus Control */
/*! @{ */

#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_addr_SHIFT (0U)
/*! sw_dbus_addr - dBus register address, BRF register offset address. */
#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_addr(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_addr_SHIFT)) & BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_addr_MASK)

#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_size_bytes_MASK (0x3800U)
#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_size_bytes_SHIFT (11U)
/*! sw_dbus_size_bytes - number of bytes to read or write, Burst read or write is supported; a
 *    maximum of 8 bytes at once., 0x0: 1 byte, 0x1: 2 bytes, 0x2: 3 bytes, 0x3: 4 bytes, 0x4: 5 byteS,
 *    0x5: 6 bytes, 0x6: 7 bytes, 0x7: 8 bytes
 */
#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_size_bytes(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_size_bytes_SHIFT)) & BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_size_bytes_MASK)

#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_start_MASK (0x4000U)
#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_start_SHIFT (14U)
/*! sw_dbus_start - Start a new dBus access, A new dBus register access is started when 1 is written
 *    to this bit (provided an access is not currently in progress). The read value is always 0.
 */
#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_start(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_start_SHIFT)) & BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_start_MASK)

#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_rd_MASK  (0x8000U)
#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_rd_SHIFT (15U)
/*! sw_dbus_rd - Read/write control, 0x0: write, 0x1: read */
#define BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_rd(x)    (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_rd_SHIFT)) & BTU2_BTU_RIF_SWDBUS_CTL_sw_dbus_rd_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_EVENT - RIF Software dBus Event, - Max burst read or write: 8 bytes. */
/*! @{ */

#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_count_MASK (0x7FFU)
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_count_SHIFT (0U)
/*! sw_dbus_count - Count to trigger software dBus, Count value used in conjunction with
 *    sw_dbus_event; when applicable., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_count(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_count_SHIFT)) & BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_count_MASK)

#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_rst_MASK (0x1000U)
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_rst_SHIFT (12U)
/*! sw_dbus_rst - software dBus reset, If set; software dBus FSM will reset and transition to idle
 *    state. Software dBus finish will be issued. Firmware first writes 1 and then writes 0 to this
 *    bit.
 */
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_rst(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_rst_SHIFT)) & BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_rst_MASK)

#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_finished_MASK (0x2000U)
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_finished_SHIFT (13U)
/*! sw_dbus_finished - Poll status of dBus access, When set; the dBus read or write access is
 *    finished. This bit is reset when writing to BTU_RIF_SWDBUS_CTL reg for the next access., 0x0: busy,
 *    0x1: finished
 */
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_finished(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_finished_SHIFT)) & BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_finished_MASK)

