zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_event_MASK (0xC000U)
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_event_SHIFT (14U)
/*! sw_dbus_event - Event to trigger software dBus access, SWDBUS_EVENT_NONPKT,0x0:
 *    SWDBUS_EVENT_NONPKT (when there is no packet activity), SWDBUS_EVENT_PKT_ASAP,0x1: SWDBUS_EVENT_PKT_ASAP (as
 *    soon as possible during packet activity), SWDBUS_EVENT_PKT_START,0x2: SWDBUS_EVENT_PKT_START
 *    (when rif_startCount equals sw_dbus_count), SWDBUS_EVENT_PKT_END,0x3: SWDBUS_EVENT_PKT_END (when
 *    rif_endCount equals sw_dbus_count)
 */
#define BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_event(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_event_SHIFT)) & BTU2_BTU_RIF_SWDBUS_EVENT_sw_dbus_event_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_DATA_1_0 - RIF Software dBus Data_1_0 */
/*! @{ */

#define BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata0_MASK (0xFFU)
#define BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata0_SHIFT (0U)
/*! sw_dbus_wdata0 - Software Access Data, Set write data (write access); or get the read data (read
 *    access)., Updated automatically during read., Bits[7:0] of 1st 8-bit word.
 */
#define BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata0(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata0_SHIFT)) & BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata0_MASK)

#define BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata1_MASK (0xFF00U)
#define BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata1_SHIFT (8U)
/*! sw_dbus_wdata1 - Software Access Data, Set write data (write access); or get the read data (read
 *    access)., Updated automatically during read., Bits[7:0] of 2nd 8-bit word.
 */
#define BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata1_SHIFT)) & BTU2_BTU_RIF_SWDBUS_DATA_1_0_sw_dbus_wdata1_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_DATA_3_2 - RIF Software dBus Data_3_2 */
/*! @{ */

#define BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata2_MASK (0xFFU)
#define BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata2_SHIFT (0U)
/*! sw_dbus_wdata2 - Software Access Data, Set write data (write access); or get the read data (read
 *    access)., Updated automatically during read., Bits[7:0] of 3rd 8-bit word.
 */
#define BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata2(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata2_SHIFT)) & BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata2_MASK)

#define BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata3_MASK (0xFF00U)
#define BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata3_SHIFT (8U)
/*! sw_dbus_wdata3 - Software Access Data, Set write data (write access); or get the read data (read
 *    access)., Updated automatically during read., Bits[7:0] of 4th 8-bit word.
 */
#define BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata3(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata3_SHIFT)) & BTU2_BTU_RIF_SWDBUS_DATA_3_2_sw_dbus_wdata3_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_DATA_5_4 - RIF Software dBus Data_5_4 */
/*! @{ */

#define BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata4_MASK (0xFFU)
#define BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata4_SHIFT (0U)
/*! sw_dbus_wdata4 - Software Access Data, Set write data (write access); or get the read data (read
 *    access)., Updated automatically during read., Bits[7:0] of 5th 8-bit word.
 */
#define BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata4(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata4_SHIFT)) & BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata4_MASK)

#define BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata5_MASK (0xFF00U)
#define BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata5_SHIFT (8U)
/*! sw_dbus_wdata5 - Software Access Data, Set write data (write access); or get the read data (read
 *    access)., Updated automatically during read., Bits[7:0] of 6th 8-bit word.
 */
#define BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata5(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata5_SHIFT)) & BTU2_BTU_RIF_SWDBUS_DATA_5_4_sw_dbus_wdata5_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_DATA_7_6 - RIF Software dBus Data_7_6 */
/*! @{ */

#define BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata6_MASK (0xFFU)
#define BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata6_SHIFT (0U)
/*! sw_dbus_wdata6 - Software Access Data, Set write data (write access); or get the read data (read
 *    access)., Updated automatically during read., Bits[7:0] of 7th 8-bit word.
 */
#define BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata6(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata6_SHIFT)) & BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata6_MASK)

#define BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata7_MASK (0xFF00U)
#define BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata7_SHIFT (8U)
/*! sw_dbus_wdata7 - Software Access Data, Set write data (write access); or get the read data (read
 *    access)., Updated automatically during read., Bits[7:0] of 8th 8-bit word.
 */
#define BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata7(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata7_SHIFT)) & BTU2_BTU_RIF_SWDBUS_DATA_7_6_sw_dbus_wdata7_MASK)
/*! @} */

/*! @name BTU_RIF_TX_FESW - RIF Tx FESW */
/*! @{ */

#define BTU2_BTU_RIF_TX_FESW_tx_fesw_on_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_TX_FESW_tx_fesw_on_delay_SHIFT (0U)
/*! tx_fesw_on_delay - Tx FESW On Delay, Number of microseconds from wakeUp to turning on bttx_fesw for Tx packets. */
#define BTU2_BTU_RIF_TX_FESW_tx_fesw_on_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TX_FESW_tx_fesw_on_delay_SHIFT)) & BTU2_BTU_RIF_TX_FESW_tx_fesw_on_delay_MASK)

#define BTU2_BTU_RIF_TX_FESW_tx_fesw_off_delay_MASK (0x3F00U)
#define BTU2_BTU_RIF_TX_FESW_tx_fesw_off_delay_SHIFT (8U)
/*! tx_fesw_off_delay - Tx FESW Off Delay, Number of microseconds from rifTx falling to turning off bttx_fesw. */
#define BTU2_BTU_RIF_TX_FESW_tx_fesw_off_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TX_FESW_tx_fesw_off_delay_SHIFT)) & BTU2_BTU_RIF_TX_FESW_tx_fesw_off_delay_MASK)

#define BTU2_BTU_RIF_TX_FESW_tx_fesw_en_MASK     (0x8000U)
#define BTU2_BTU_RIF_TX_FESW_tx_fesw_en_SHIFT    (15U)
/*! tx_fesw_en - Tx Front-End Switch (FESW) Enable, 0x0: bttx_fesw is fixed to 0, 0x1: enable FESW during for Tx packets */
#define BTU2_BTU_RIF_TX_FESW_tx_fesw_en(x)       (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TX_FESW_tx_fesw_en_SHIFT)) & BTU2_BTU_RIF_TX_FESW_tx_fesw_en_MASK)
/*! @} */

/*! @name BTU_RIF_RX_FESW - RIF Rx FESW */
/*! @{ */

#define BTU2_BTU_RIF_RX_FESW_rx_fesw_on_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_RX_FESW_rx_fesw_on_delay_SHIFT (0U)
/*! rx_fesw_on_delay - Rx FESW On Delay, Number of microseconds from rif_rx_req to turning on btrx_fesw for Rx packets. */
#define BTU2_BTU_RIF_RX_FESW_rx_fesw_on_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_FESW_rx_fesw_on_delay_SHIFT)) & BTU2_BTU_RIF_RX_FESW_rx_fesw_on_delay_MASK)

#define BTU2_BTU_RIF_RX_FESW_rx_fesw_off_delay_MASK (0x3F00U)
#define BTU2_BTU_RIF_RX_FESW_rx_fesw_off_delay_SHIFT (8U)
/*! rx_fesw_off_delay - Rx FESW Off Delay, Number of microseconds from rifRx falling to turning off btrx_fesw. */
#define BTU2_BTU_RIF_RX_FESW_rx_fesw_off_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_FESW_rx_fesw_off_delay_SHIFT)) & BTU2_BTU_RIF_RX_FESW_rx_fesw_off_delay_MASK)

#define BTU2_BTU_RIF_RX_FESW_rx_fesw_en_MASK     (0x8000U)
#define BTU2_BTU_RIF_RX_FESW_rx_fesw_en_SHIFT    (15U)
/*! rx_fesw_en - Rx FESW Enable, 0x0: btrx_fesw is fixed to 0, 0x1: enable FESW during for Rx packets */
#define BTU2_BTU_RIF_RX_FESW_rx_fesw_en(x)       (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_FESW_rx_fesw_en_SHIFT)) & BTU2_BTU_RIF_RX_FESW_rx_fesw_en_MASK)
/*! @} */

/*! @name BTU_RIF_RXPAON - RIF Rx PA On */
/*! @{ */

#define BTU2_BTU_RIF_RXPAON_rx_pa_on_delay_MASK  (0x3FFU)
#define BTU2_BTU_RIF_RXPAON_rx_pa_on_delay_SHIFT (0U)
/*! rx_pa_on_delay - Rx PA on Delay, Timing Variable from Wakeup (packet boundary) to PA Assertion on Rx Pulse., - Resolution: 0.25 us. */
#define BTU2_BTU_RIF_RXPAON_rx_pa_on_delay(x)    (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RXPAON_rx_pa_on_delay_SHIFT)) & BTU2_BTU_RIF_RXPAON_rx_pa_on_delay_MASK)

#define BTU2_BTU_RIF_RXPAON_rx_pa_on_en_MASK     (0x8000U)
#define BTU2_BTU_RIF_RXPAON_rx_pa_on_en_SHIFT    (15U)
/*! rx_pa_on_en - Rx PA On Delay Enable */
#define BTU2_BTU_RIF_RXPAON_rx_pa_on_en(x)       (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RXPAON_rx_pa_on_en_SHIFT)) & BTU2_BTU_RIF_RXPAON_rx_pa_on_en_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RX_PU - RIF BRF Power Up for RX, brf_pu is the sideband signal used to turn on the BRF's power control. */
/*! @{ */

#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_on_delay_qus_MASK (0xFFU)
#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_on_delay_qus_SHIFT (0U)
/*! brf_rx_pu_on_delay_qus - brf_pu on delay, Delay from wakeUp to turning on brf_pu. Resolution: 0.25 us. */
#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_on_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_on_delay_qus_SHIFT)) & BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_on_delay_qus_MASK)

