zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_off_delay_qus_MASK (0x7F00U)
#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_off_delay_qus_SHIFT (8U)
/*! brf_rx_pu_off_delay_qus - brf_pu off delay, Delay from last dBus access to turning off brf_pu. Resolution: 0.25 us. */
#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_off_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_off_delay_qus_SHIFT)) & BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_off_delay_qus_MASK)

#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_fixed_MASK (0x8000U)
#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_fixed_SHIFT (15U)
/*! brf_rx_pu_fixed - Set brf_pu to a fixed value., BRF power up value., 0x0: use programmable
 *    timers, 0x1: fixed; brf_pu = brf_pu_on_delay_us[0]
 */
#define BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_fixed(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_fixed_SHIFT)) & BTU2_BTU_RIF_BRF_RX_PU_brf_rx_pu_fixed_MASK)
/*! @} */

/*! @name BTU_RIF_BTC_DBUS_TX_PKT_END - BTC RIF dBus Tx Packet End Control */
/*! @{ */

#define BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay_SHIFT (0U)
/*! dbus_tx_pkt_end_delay - dBus Tx Packet End Delay, Time from the end of active Tx payload to dBus
 *    command that sets the radio back to IDLE., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay_SHIFT)) & BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay_MASK)

#define BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_enable_SHIFT (15U)
/*! dbus_tx_pkt_end_enable - Tx Packet End dBus Transaction Enable */
#define BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_enable_SHIFT)) & BTU2_BTU_RIF_BTC_DBUS_TX_PKT_END_dbus_tx_pkt_end_enable_MASK)
/*! @} */

/*! @name BTU_RIF_BTC_DBUS_RX_PKT_END - BTC RIF dBus Rx Packet End Control */
/*! @{ */

#define BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay_SHIFT (0U)
/*! dbus_rx_pkt_end_delay - dBus Rx Packet End Delay, Time from the end of active Rx payload to dBus
 *    command that sets the radio back to IDLE., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay_SHIFT)) & BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay_MASK)

#define BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_enable_SHIFT (15U)
/*! dbus_rx_pkt_end_enable - Rx Packet End dBus Transaction Enable */
#define BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_enable_SHIFT)) & BTU2_BTU_RIF_BTC_DBUS_RX_PKT_END_dbus_rx_pkt_end_enable_MASK)
/*! @} */

/*! @name BTU_RIF_BTC_DBUS_TX_RAMPDOWN - BTC RIF dBus Tx Rampdown Control */
/*! @{ */

#define BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay_SHIFT (0U)
/*! dbus_tx_rampdown_delay - dBus Tx Rampdown Delay, Delay time after the end of a Tx slot for
 *    ramping down the radio over the dBus., Resolution 0.25 us.
 */
#define BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay_SHIFT)) & BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay_MASK)

#define BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_enable_SHIFT (15U)
/*! dbus_tx_rampdown_enable - Enables Automatic Rampdown radio after Tx slot on the dBus, 0x0:
 *    disable automatic ramping down the radio after Tx slot, 0x1: enable automatic ramping down the
 *    radio after Tx slot
 */
#define BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_enable_SHIFT)) & BTU2_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_enable_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_COR_CONFIG_CTRL - RIF Correlator Configuration Control */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_delay_SHIFT (0U)
/*! dbus_corcfg_wr_delay - Rx Mode dBus BRF Correlator Configuration Control Delay, Delay from
 *    rif_rx_req to trigger correlator configuration dBus writes., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_delay_MASK)

#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ant_MASK (0x800U)
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ant_SHIFT (11U)
/*! cor_prem_det_gate_syncwd_en_ant - Enable BRF to start syncword detection after preamble found for Ant Mode */
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ant(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ant_SHIFT)) & BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ant_MASK)

#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_nike_MASK (0x1000U)
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_nike_SHIFT (12U)
/*! cor_prem_det_gate_syncwd_en_nike - Enable BRF to start syncword detection after preamble found for Nike Mode */
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_nike(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_nike_SHIFT)) & BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_nike_MASK)

#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ble_MASK (0x2000U)
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ble_SHIFT (13U)
/*! cor_prem_det_gate_syncwd_en_ble - Enable BRF to start syncword detection after preamble found for BLE Mode */
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ble(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ble_SHIFT)) & BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_cor_prem_det_gate_syncwd_en_ble_MASK)

#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_enable_SHIFT (15U)
/*! dbus_corcfg_wr_enable - Rx Mode dBus BRF Correlator Configuration Transaction Enable, Enable only when using MRVL Gen3 radio. */
#define BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_COR_CONFIG_CTRL_dbus_corcfg_wr_enable_MASK)
/*! @} */

