zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*! @name BTU_RIF_BRF_COR_CONFIG_ADDR - RIF BRF Correlator Configuration Address, Only use in MRVL Gen3 Radio Mode. */
/*! @{ */

#define BTU2_BTU_RIF_BRF_COR_CONFIG_ADDR_rx_cor_cfg_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_COR_CONFIG_ADDR_rx_cor_cfg_addr_SHIFT (0U)
/*! rx_cor_cfg_addr - Radio Register Address for Correlator Configuration, Only use in MRVL Gen3
 *    radio mode., The BRF register of the correlator configuration.
 */
#define BTU2_BTU_RIF_BRF_COR_CONFIG_ADDR_rx_cor_cfg_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_COR_CONFIG_ADDR_rx_cor_cfg_addr_SHIFT)) & BTU2_BTU_RIF_BRF_COR_CONFIG_ADDR_rx_cor_cfg_addr_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL - RIF Syncword and Access Code Send Control */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_delay_SHIFT (0U)
/*! dbus_syncword_wr_delay - dBus Syncword and Access Code Control Delay, Delay from rif_rx_req to
 *    trigger syncword and access code control dBus writes., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_delay_MASK)

#define BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_enable_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_enable_SHIFT (15U)
/*! dbus_syncword_wr_enable - Rx Mode dBus Syncword and Access Code Transaction Enable */
#define BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_enable(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_enable_SHIFT)) & BTU2_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_dbus_syncword_wr_enable_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_ACC_CODE_ONE_ADDR - RIF BRF Access Code 1 Address */
/*! @{ */

#define BTU2_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_rx_acc_code_one_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_rx_acc_code_one_addr_SHIFT (0U)
/*! rx_acc_code_one_addr - Radio Register Address for First Access Code, The LSB BRF register of the
 *    1st access code. Since BTC sync word is 64-bit long; the consecutive 8 BRF registers (1 byte
 *    each register) are allocated. Correlation hit used this sync word will reflect a PKT_CTL_0
 *    pulse.
 */
#define BTU2_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_rx_acc_code_one_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_rx_acc_code_one_addr_SHIFT)) & BTU2_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_rx_acc_code_one_addr_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_ACC_CODE_TWO_ADDR - RIF Access Code 2 Address */
/*! @{ */

#define BTU2_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_rx_acc_code_two_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_rx_acc_code_two_addr_SHIFT (0U)
/*! rx_acc_code_two_addr - Radio Register Address for Second Access Code, The LSB BRF register of
 *    the 2nd access code. Since BTC sync word is 64-bit long; the consecutive 8 BRF registers (1 byte
 *    each register) are allocated. Correlation hit used this sync word will reflect a PKT_CTL_1
 *    pulse.
 */
#define BTU2_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_rx_acc_code_two_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_rx_acc_code_two_addr_SHIFT)) & BTU2_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_rx_acc_code_two_addr_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RX_MODE_TYPE_ADDR - RIF Register */
/*! @{ */

#define BTU2_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_rx_mode_type_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_rx_mode_type_addr_SHIFT (0U)
/*! rx_mode_type_addr - Radio Register Address for Rx Mode Type, The BRF register of the expected Rx BDR/EDR mode type. */
#define BTU2_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_rx_mode_type_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_rx_mode_type_addr_SHIFT)) & BTU2_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_rx_mode_type_addr_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR - RIF Register */
/*! @{ */

#define BTU2_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_rx_pkt_pld_len_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_rx_pkt_pld_len_addr_SHIFT (0U)
/*! rx_pkt_pld_len_addr - Radio Register Address for Rx Packet Payload Length, The LSB BRF register
 *    of the expected Rx Packet Payload Length. The immediate next BRF registers is also allocated
 *    for MSB length portion., - Units: micro-seconds.
 */
#define BTU2_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_rx_pkt_pld_len_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_rx_pkt_pld_len_addr_SHIFT)) & BTU2_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_rx_pkt_pld_len_addr_MASK)
/*! @} */

/*! @name BTU_RIF_RX_SYNC_PULSE_TIMER - RIF BRF Rx Sync Pulse Timer */
/*! @{ */

#define BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_hdr_pulse_timeout_MASK (0x1FU)
#define BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_hdr_pulse_timeout_SHIFT (0U)
/*! rx_hdr_pulse_timeout - Rx Header Pulse Timeout, After correlation hit; timeout counter for the
 *    header sync pulse from the BRF. The BRF header start pulse is received when the packet header
 *    is sent on rx_data. If the header start pulse is not detected; then the packet would be
 *    aborted. This timeout specifies how long the BTU will wait before an abort., - Resolution: 1 us.
 */
#define BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_hdr_pulse_timeout(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_hdr_pulse_timeout_SHIFT)) & BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_hdr_pulse_timeout_MASK)

#define BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_sync_pulse_timeout_MASK (0x1F00U)
#define BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_sync_pulse_timeout_SHIFT (8U)
/*! rx_sync_pulse_timeout - Rx Sync Pulse Timeout, After header start pulse; timeout counter for the
 *    payload sync pulse from the BRF. The BRF payload sync pulse is received when the packet
 *    payload is sent on rx_data. If the payload sync pulse is not detected; then the packet would be
 *    aborted. This timeout specifies how long the BTU will wait before an abort., - Resolution: 1 us.
 */
#define BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_sync_pulse_timeout(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_sync_pulse_timeout_SHIFT)) & BTU2_BTU_RIF_RX_SYNC_PULSE_TIMER_rx_sync_pulse_timeout_MASK)
/*! @} */

/*! @name BTU_RIF_RX_BTC_SAMP_PHASE_ADJ - RIF Rx Sample Phase Adjustment */
/*! @{ */

#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_pos_adj_MASK (0x3U)
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_pos_adj_SHIFT (0U)
/*! hdr_start_pos_adj - Positive Phase Adjustment after Header starts Pulse, Positive phase
 *    adjustment after header starts pulse. The sampling point is delayed by the shift amount., -
 *    Resolution: 0.25 us (Gen3); 62.5 ns (Gen4).
 */
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_pos_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_pos_adj_SHIFT)) & BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_pos_adj_MASK)

#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_neg_adj_MASK (0xCU)
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_neg_adj_SHIFT (2U)
/*! hdr_start_neg_adj - Negative Phase Adjustment after Header starts Pulse, Negative phase
 *    adjustment after header starts pulse. The sampling point is advanced by the shift amount., -
 *    Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_neg_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_neg_adj_SHIFT)) & BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_hdr_start_neg_adj_MASK)

#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_pos_adj_MASK (0x300U)
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_pos_adj_SHIFT (8U)
/*! sync_start_pos_adj - Positive Phase Adjustment after Payload Sync starts Pulse, Positive phase
 *    adjustment after payload sync starts pulse. The sampling point is delayed by the shift amount.,
 *    - Resolution: 0.25 us (Gen3); 62.5 ns (Gen4).
 */
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_pos_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_pos_adj_SHIFT)) & BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_pos_adj_MASK)

