zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_neg_adj_MASK (0xC00U)
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_neg_adj_SHIFT (10U)
/*! sync_start_neg_adj - Negative Phase Adjustment after Header Starts Pulse, Negative phase
 *    adjustment after payload sync starts pulse. The sampling point is advanced by the shift amount., -
 *    Resolution: 0.25 us (Gen3); 62.5 ns (Gen4).
 */
#define BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_neg_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_neg_adj_SHIFT)) & BTU2_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_sync_start_neg_adj_MASK)
/*! @} */

/*! @name BTU_RIF_RX_BLE_SAMP_PHASE_ADJ - RIF Rx Sample Phase Adjustment */
/*! @{ */

#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_pos_adj_MASK (0x3U)
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_pos_adj_SHIFT (0U)
/*! pdu_start_pos_adj - Positive Phase Adjustment after PDU Data starts Pulse, Positive phase
 *    adjustment after PDU data starts pulse. The sampling point is delayed by the shift amount., -
 *    Resolution: 0.25 us (Gen3); 62.5 ns (Gen4).
 */
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_pos_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_pos_adj_SHIFT)) & BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_pos_adj_MASK)

#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_neg_adj_MASK (0xCU)
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_neg_adj_SHIFT (2U)
/*! pdu_start_neg_adj - Negative Phase Adjustment after PDU Data starts Pulse, Negative phase
 *    adjustment after PDU data starts pulse. The sampling point is advanced by the shift amount., -
 *    Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_neg_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_neg_adj_SHIFT)) & BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_pdu_start_neg_adj_MASK)

#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_pos_adj_MASK (0x300U)
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_pos_adj_SHIFT (8U)
/*! dfe_1m_phase_pos_adj - Positive Phase Adjustment for DFE I/Q Samples After CRC, Positive Phase
 *    Adjustment for 1 Mbps DFE I/Q samples after CRC. The sampling point is delayed by the shift
 *    amount., - Resolution: 62.5 ns (Gen4).
 */
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_pos_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_pos_adj_SHIFT)) & BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_pos_adj_MASK)

#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_neg_adj_MASK (0xC00U)
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_neg_adj_SHIFT (10U)
/*! dfe_1m_phase_neg_adj - Negative Phase Adjustment for DFE I/Q Samples After CRC, Positive Phase
 *    Adjustment for 1 Mbps DFE I/Q samples after CRC. The sampling point is advanced by the shift
 *    amount., - Resolution: 62.5 ns (Gen4).
 */
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_neg_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_neg_adj_SHIFT)) & BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_1m_phase_neg_adj_MASK)

#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_pos_adj_MASK (0x3000U)
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_pos_adj_SHIFT (12U)
/*! dfe_2m_phase_pos_adj - Positive Phase Adjustment for DFE I/Q Samples After CRC, Positive Phase
 *    Adjustment for 2 Mbps DFE I/Q samples after CRC. The sampling point is delayed by the shift
 *    amount., - Resolution: 62.5 ns (Gen4).
 */
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_pos_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_pos_adj_SHIFT)) & BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_pos_adj_MASK)

#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_neg_adj_MASK (0xC000U)
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_neg_adj_SHIFT (14U)
/*! dfe_2m_phase_neg_adj - Negative Phase Adjustment for DFE I/Q Samples After CRC, Positive Phase
 *    Adjustment for 2 Mbps DFE I/Q samples after CRC. The sampling point is advanced by the shift
 *    amount., - Resolution: 62.5 ns (Gen4).
 */
#define BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_neg_adj(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_neg_adj_SHIFT)) & BTU2_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_dfe_2m_phase_neg_adj_MASK)
/*! @} */

/*! @name BTU_RIF_RX_TONE_CANCEL_CTRL - Rx Tone Cancellation Control */
/*! @{ */

#define BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_rx_dbus_pull_in_time_MASK (0x3FU)
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_rx_dbus_pull_in_time_SHIFT (0U)
/*! rx_dbus_pull_in_time - Rx dBUS events pull-in time, This adjusts the pull-in time of the dBUS
 *    events including SOC_BT_BRF_PU; A3; A1; A2 and P pulse before Rx packet. This setting applies to
 *    both BTC and BLE packet. Resolution: 0.25us
 */
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_rx_dbus_pull_in_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_rx_dbus_pull_in_time_SHIFT)) & BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_rx_dbus_pull_in_time_MASK)

#define BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_ble_pull_in_en_MASK (0x200U)
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_ble_pull_in_en_SHIFT (9U)
/*! ble_pull_in_en - BLE dBUS events pull-in enable, Enable BLE Rx packet dBUS events pull-in when
 *    current BLE packet's frequency matches one of the 4 TONE_CANCEL_CHNL values., 0x0: disable,
 *    0x1: enable
 */
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_ble_pull_in_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_ble_pull_in_en_SHIFT)) & BTU2_BTU_RIF_RX_TONE_CANCEL_CTRL_ble_pull_in_en_MASK)
/*! @} */

/*! @name BTU_RIF_RX_TONE_CANCEL_CHNL10 - Rx Tone Cancellation Channel */
/*! @{ */

#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl0_MASK (0x7FU)
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl0_SHIFT (0U)
/*! tone_cancel_chnl0 - Rx Tone Cancellation Channel 0, If Rx packet's channel index value sent to
 *    BRF on A2 event matches this value; the Rx packet dBUS event will be pulled-in; upon enabled.
 */
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl0(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl0_SHIFT)) & BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl0_MASK)

#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl1_MASK (0x7F00U)
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl1_SHIFT (8U)
/*! tone_cancel_chnl1 - Rx Tone Cancellation Channel 1, If Rx packet's channel index value sent to
 *    BRF on A2 event matches this value; the Rx packet dBUS event will be pulled-in; upon enabled.
 */
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl1_SHIFT)) & BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL10_tone_cancel_chnl1_MASK)
/*! @} */

/*! @name BTU_RIF_RX_TONE_CANCEL_CHNL32 - Rx Tone Cancellation Channel */
/*! @{ */

