zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl2_MASK (0x7FU)
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl2_SHIFT (0U)
/*! tone_cancel_chnl2 - Rx Tone Cancellation Channel 2, If Rx packet's channel index value sent to
 *    BRF on A2 event matches this value; the Rx packet dBUS event will be pulled-in; upon enabled.
 */
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl2(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl2_SHIFT)) & BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl2_MASK)

#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl3_MASK (0x7F00U)
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl3_SHIFT (8U)
/*! tone_cancel_chnl3 - Rx Tone Cancellation Channel 3, If Rx packet's channel index value sent to
 *    BRF on A2 event matches this value; the Rx packet dBUS event will be pulled-in; upon enabled.
 */
#define BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl3(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl3_SHIFT)) & BTU2_BTU_RIF_RX_TONE_CANCEL_CHNL32_tone_cancel_chnl3_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CTL - BLE RIF Control */
/*! @{ */

#define BTU2_BTU_RIF_BLE_CTL_ble_brf_pu_MASK     (0x2U)
#define BTU2_BTU_RIF_BLE_CTL_ble_brf_pu_SHIFT    (1U)
/*! ble_brf_pu - BLE BRF Power up, This bit used by the BLE software to control the power up bit for the BRF., 0x0: disable, 0x1: enable */
#define BTU2_BTU_RIF_BLE_CTL_ble_brf_pu(x)       (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CTL_ble_brf_pu_SHIFT)) & BTU2_BTU_RIF_BLE_CTL_ble_brf_pu_MASK)

#define BTU2_BTU_RIF_BLE_CTL_ble_pll_req_MASK    (0x4U)
#define BTU2_BTU_RIF_BLE_CTL_ble_pll_req_SHIFT   (2U)
/*! ble_pll_req - BLE PLL Clock Request, This bit is used by the BLE software to control the PLL clock enable., 0x0: disable, 0x1: enable */
#define BTU2_BTU_RIF_BLE_CTL_ble_pll_req(x)      (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CTL_ble_pll_req_SHIFT)) & BTU2_BTU_RIF_BLE_CTL_ble_pll_req_MASK)

#define BTU2_BTU_RIF_BLE_CTL_data_loopback_en_MASK (0x8U)
#define BTU2_BTU_RIF_BLE_CTL_data_loopback_en_SHIFT (3U)
/*! data_loopback_en - BLE Loopback Data Enable, Setting this bit changes the source of the BLE Rx
 *    data from the Tx block instead of from the BRF., 0x0: Rx data is from BRF, 0x1: Rx data is from
 *    Tx block
 */
#define BTU2_BTU_RIF_BLE_CTL_data_loopback_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CTL_data_loopback_en_SHIFT)) & BTU2_BTU_RIF_BLE_CTL_data_loopback_en_MASK)

#define BTU2_BTU_RIF_BLE_CTL_rx_iq_sample_phase_MASK (0x30U)
#define BTU2_BTU_RIF_BLE_CTL_rx_iq_sample_phase_SHIFT (4U)
/*! rx_iq_sample_phase - BLE Rx IQ Sampling Rate Phase, To use in conjunction with
 *    rx_iq_sample_rate[1:0] in 'BLE_REG_DFE_PKT_EXTENSION_CNTRL'; define IQ sample reception phase in Rx extension
 *    field., When rx_iq_sample_rate[1:0] == 0; receiving IQ samples every 4 usec; on the phase
 *    rx_iq_sample_phase[1:0] herein specified (i.e. 0~3)., When rx_iq_sample_rate[1:0] == 1; receiving
 *    IQ samples every 2 usec; on the phase rx_iq_sample_phase[0] herein specified (i.e. 0: on even
 *    phase; 1: on odd phase)., When rx_iq_sample_rate[1:0] == 0; receiving IQ samples every 1 usec
 *    on every phase; rx_iq_sample_phase[1:0] is ignored.
 */
#define BTU2_BTU_RIF_BLE_CTL_rx_iq_sample_phase(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CTL_rx_iq_sample_phase_SHIFT)) & BTU2_BTU_RIF_BLE_CTL_rx_iq_sample_phase_MASK)

#define BTU2_BTU_RIF_BLE_CTL_ble_tx_pwr_adj_en_MASK (0x40U)
#define BTU2_BTU_RIF_BLE_CTL_ble_tx_pwr_adj_en_SHIFT (6U)
/*! ble_tx_pwr_adj_en - BLE TX power adjust enable, Global enable for BLE Tx power adjustment scheme
 *    - outputting Tx_power_level to BCA at bt_req and overwriting with Bfdbk_Tx_power if
 *    Bfdbk_Tx_power_ind., 0x0: disable, 0x1: enable
 */
#define BTU2_BTU_RIF_BLE_CTL_ble_tx_pwr_adj_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CTL_ble_tx_pwr_adj_en_SHIFT)) & BTU2_BTU_RIF_BLE_CTL_ble_tx_pwr_adj_en_MASK)

#define BTU2_BTU_RIF_BLE_CTL_ble_ignore_bca_tx_pwr_MASK (0x80U)
#define BTU2_BTU_RIF_BLE_CTL_ble_ignore_bca_tx_pwr_SHIFT (7U)
/*! ble_ignore_bca_tx_pwr - BLE ignore BCA TX power, FW overide to ignore BCA's Bfdbk_Tx_power if
 *    Bfdbk_Tx_power_ind; for current BLE Tx pkt., 0x0: disable, 0x1: enable
 */
#define BTU2_BTU_RIF_BLE_CTL_ble_ignore_bca_tx_pwr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CTL_ble_ignore_bca_tx_pwr_SHIFT)) & BTU2_BTU_RIF_BLE_CTL_ble_ignore_bca_tx_pwr_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_LENGTH_SEL - BLE Correlation Length Selection */
/*! @{ */

#define BTU2_BTU_RIF_BLE_COR_LENGTH_SEL_ble_cor_indicator_MASK (0xCU)
#define BTU2_BTU_RIF_BLE_COR_LENGTH_SEL_ble_cor_indicator_SHIFT (2U)
/*! ble_cor_indicator - BLE Correlator Indicator, BLE correlator indicator to enable which
 *    correlator is used., 0x0: no correlator enabled, 0x1: correlator one enabled, 0x2: correlator two
 *    enabled, 0x3: both correlators enabled
 */
#define BTU2_BTU_RIF_BLE_COR_LENGTH_SEL_ble_cor_indicator(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_COR_LENGTH_SEL_ble_cor_indicator_SHIFT)) & BTU2_BTU_RIF_BLE_COR_LENGTH_SEL_ble_cor_indicator_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_ACCESSADDR_0 - BLE AccessCode */
/*! @{ */

#define BTU2_BTU_RIF_BLE_COR_ACCESSADDR_0_ble_access_code_0_16_MASK (0xFFFFU)
#define BTU2_BTU_RIF_BLE_COR_ACCESSADDR_0_ble_access_code_0_16_SHIFT (0U)
/*! ble_access_code_0_16 - BLE Access Code, BLE Access Code to be used in correlator for the current Rx packet (lower 16-bit). */
#define BTU2_BTU_RIF_BLE_COR_ACCESSADDR_0_ble_access_code_0_16(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_COR_ACCESSADDR_0_ble_access_code_0_16_SHIFT)) & BTU2_BTU_RIF_BLE_COR_ACCESSADDR_0_ble_access_code_0_16_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_ACCESSADDR_1 - BLE AccessCode */
/*! @{ */

#define BTU2_BTU_RIF_BLE_COR_ACCESSADDR_1_ble_access_code_17_32_MASK (0xFFFFU)
#define BTU2_BTU_RIF_BLE_COR_ACCESSADDR_1_ble_access_code_17_32_SHIFT (0U)
/*! ble_access_code_17_32 - BLE Access Code, BLE Access Code to be used in correlator for the current Rx packet(upper 16-bit). */
#define BTU2_BTU_RIF_BLE_COR_ACCESSADDR_1_ble_access_code_17_32(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_COR_ACCESSADDR_1_ble_access_code_17_32_SHIFT)) & BTU2_BTU_RIF_BLE_COR_ACCESSADDR_1_ble_access_code_17_32_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_WINDOW_0 - BLE Correlation Window Size */
/*! @{ */

#define BTU2_BTU_RIF_BLE_COR_WINDOW_0_ble_cor_window_0_MASK (0xFFFFU)
#define BTU2_BTU_RIF_BLE_COR_WINDOW_0_ble_cor_window_0_SHIFT (0U)
/*! ble_cor_window_0 - BLE Correlation Window Size, BLE correlation window size for the current Rx
 *    packet (lower 16-bit)., Correlation window in 1/4 usec. Hardware will automatically abort Rx
 *    operation up expiration of this window time. Maximum window size: 2^26/4 = 16777216 usec.
 */
#define BTU2_BTU_RIF_BLE_COR_WINDOW_0_ble_cor_window_0(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_COR_WINDOW_0_ble_cor_window_0_SHIFT)) & BTU2_BTU_RIF_BLE_COR_WINDOW_0_ble_cor_window_0_MASK)
/*! @} */

