zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*! @name BTU_RIF_BLE_COR_WINDOW_1 - BLE Correlation Window Size */
/*! @{ */

#define BTU2_BTU_RIF_BLE_COR_WINDOW_1_ble_cor_window_1_MASK (0x3FFU)
#define BTU2_BTU_RIF_BLE_COR_WINDOW_1_ble_cor_window_1_SHIFT (0U)
/*! ble_cor_window_1 - BLE Correlation Window Size, BLE correlation window size for the current Rx
 *    packet (Upper 10-bit)., Correlation window in 1/4 usec. Hardware will automatically abort Rx
 *    operation up expiration of this window time. Maximum window size: 2^26/4 = 16777216 usec.
 */
#define BTU2_BTU_RIF_BLE_COR_WINDOW_1_ble_cor_window_1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_COR_WINDOW_1_ble_cor_window_1_SHIFT)) & BTU2_BTU_RIF_BLE_COR_WINDOW_1_ble_cor_window_1_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CLK_EN_DELAY - Tx/Rx Clock Enable Signal Delay */
/*! @{ */

#define BTU2_BTU_RIF_BLE_CLK_EN_DELAY_tx_clk_en_delay_qus_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_CLK_EN_DELAY_tx_clk_en_delay_qus_SHIFT (0U)
/*! tx_clk_en_delay_qus - Tx_clk_en Delay Offset, This is the delay offset for the tx_clk_en signal from the Tx S pulse., - Resolution: 1/4 usec. */
#define BTU2_BTU_RIF_BLE_CLK_EN_DELAY_tx_clk_en_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_EN_DELAY_tx_clk_en_delay_qus_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_EN_DELAY_tx_clk_en_delay_qus_MASK)

#define BTU2_BTU_RIF_BLE_CLK_EN_DELAY_rx_clk_en_delay_qus_MASK (0xFF00U)
#define BTU2_BTU_RIF_BLE_CLK_EN_DELAY_rx_clk_en_delay_qus_SHIFT (8U)
/*! rx_clk_en_delay_qus - Rx_clk_en Delay Offset, This is the delay offset for the rx_clk_en signal from the Rx P pulse., - Resolution: 1/4 usec. */
#define BTU2_BTU_RIF_BLE_CLK_EN_DELAY_rx_clk_en_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_EN_DELAY_rx_clk_en_delay_qus_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_EN_DELAY_rx_clk_en_delay_qus_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_GO_DELAY - RIF Go Signal Delay */
/*! @{ */

#define BTU2_BTU_RIF_BLE_GO_DELAY_rif_tx_go_delay_qus_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_GO_DELAY_rif_tx_go_delay_qus_SHIFT (0U)
/*! rif_tx_go_delay_qus - RIF_TX_GO Delay Offset, This is the delay offset for the rif_tx_go signal from the Tx S pulse., - Res: 1/4 usec. */
#define BTU2_BTU_RIF_BLE_GO_DELAY_rif_tx_go_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_GO_DELAY_rif_tx_go_delay_qus_SHIFT)) & BTU2_BTU_RIF_BLE_GO_DELAY_rif_tx_go_delay_qus_MASK)

#define BTU2_BTU_RIF_BLE_GO_DELAY_rif_rx_go_delay_qus_MASK (0xFF00U)
#define BTU2_BTU_RIF_BLE_GO_DELAY_rif_rx_go_delay_qus_SHIFT (8U)
/*! rif_rx_go_delay_qus - RIF_RX_GO Delay Offset, This is the delay offset for the rif_rx_go signal from the Rx P pulse., - Res: 1/4 usec. */
#define BTU2_BTU_RIF_BLE_GO_DELAY_rif_rx_go_delay_qus(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_GO_DELAY_rif_rx_go_delay_qus_SHIFT)) & BTU2_BTU_RIF_BLE_GO_DELAY_rif_rx_go_delay_qus_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA - Tx Power Control DBUS Write Data */
/*! @{ */

#define BTU2_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_rif_dbus_tx_pwrctl_wdata_MASK (0xFFFFU)
#define BTU2_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_rif_dbus_tx_pwrctl_wdata_SHIFT (0U)
/*! rif_dbus_tx_pwrctl_wdata - Tx Power Control DBUS Write Data, Tx A1 pulse., - Bits[9:8]: Tx data
 *    rate, - Bits[7:0]: Tx power table index, 0x0: reserved, 0x1: BDR 1 Mbps / BLE 1 Mbps / ANT 1
 *    Mbps, 0x2: EDR 2 Mbps / BLE 2 Mbps, 0x3: EDR 3 Mbps
 */
#define BTU2_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_rif_dbus_tx_pwrctl_wdata(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_rif_dbus_tx_pwrctl_wdata_SHIFT)) & BTU2_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_rif_dbus_tx_pwrctl_wdata_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_TX_FSYN_WDATA - Tx Fsyn DBUS Write Data */
/*! @{ */

#define BTU2_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_rif_dbus_tx_fsyn_wdata_MASK (0xFFFFU)
#define BTU2_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_rif_dbus_tx_fsyn_wdata_SHIFT (0U)
/*! rif_dbus_tx_fsyn_wdata - Tx Fsyn DBUS Write Data, Tx A2 pulse., - Bits[15:13]: Bluetooth mode -
 *    BTC; BLE; NIKE; ANT or LLR, - Bit[12]: Rx notch filter enable, - Bit[11]: reserved, - Bit[10]:
 *    power up BRF BG/CPREG, - Bits[9:8]: Bluetooth state - Tx; Rx, - Bit[7]: large correlation
 *    window indicator, - Bits[6:0]: Bluetooth channel from 0 to 78
 */
#define BTU2_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_rif_dbus_tx_fsyn_wdata(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_rif_dbus_tx_fsyn_wdata_SHIFT)) & BTU2_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_rif_dbus_tx_fsyn_wdata_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA - Rx Power Control DBUS Write Data */
/*! @{ */

#define BTU2_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_rif_dbus_rx_pwrctl_wdata_MASK (0xFFFFU)
#define BTU2_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_rif_dbus_rx_pwrctl_wdata_SHIFT (0U)
/*! rif_dbus_rx_pwrctl_wdata - Rx Power Control DBUS Write Data, Rx A1 pulse., - Bits[15:14]:
 *    reserved, - Bit[13]: BLE MI estimation enable, - Bit[11]: Rx link BDR/EDR packet type, - Bit[10]: Rx
 *    channel estimation using noise floor, - Bits[9:8]: indicate which syncword correlator to use,
 *    - Bits[7:4]: Rx link index from 0 to 9, - Bits[1:0]: Rx power mode (when low power scan mode
 *    is normal mode; selects from either normal or performance mode), ,Enum, - Bit[12]: BLE Rx data
 *    rate, 0x0: 1 Mbps (also for BTC; ANT), 0x1: 2 Mbps, ,Enum, - Bits[2]: BLE channel assessment
 *    mode, 0x0: Single channel, 0x1: V_1, Multiple channels (ch; ch+1; ch+2 ... ch+9)
 */
#define BTU2_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_rif_dbus_rx_pwrctl_wdata(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_rif_dbus_rx_pwrctl_wdata_SHIFT)) & BTU2_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_rif_dbus_rx_pwrctl_wdata_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_RX_FSYN_WDATA - Rx Fsyn DBUS Write Data */
/*! @{ */

#define BTU2_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_rif_dbus_rx_fsyn_wdata_MASK (0xFFFFU)
#define BTU2_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_rif_dbus_rx_fsyn_wdata_SHIFT (0U)
/*! rif_dbus_rx_fsyn_wdata - Rx Fsyn DBUS Write Data, Rx A2 pulse., - Bits[15:13]: Bluetooth mode -
 *    BTC; BLE; NIKE; ANT or LLR, - Bit[12]: Rx notch filter enable, - Bit[11]: reserved, - Bit[10]:
 *    power up BRF BG/CPREG, - Bits[9:8]: Bluetooth state - Tx; Rx, - Bit[7]: large correlation
 *    window indicator, - Bit[6:0]: Bluetooth channel from 0 to 78
 */
#define BTU2_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_rif_dbus_rx_fsyn_wdata(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_rif_dbus_rx_fsyn_wdata_SHIFT)) & BTU2_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_rif_dbus_rx_fsyn_wdata_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_RX_SYNC_DELAY - BLE Rx Sync Delay */
/*! @{ */

#define BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_syncpulse_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_syncpulse_delay_SHIFT (0U)
/*! ble_rx_syncpulse_delay - The BLE packet PDU sync pulse max delay from correlation hit pulse.
 *    Watchdog timer value for sync pulse from BRF at the start of PDU. Hardware will automatically
 *    abort Rx operation upon expiration of the watchdog timer. Res: 1 usec.
 */
#define BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_syncpulse_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_syncpulse_delay_SHIFT)) & BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_syncpulse_delay_MASK)

#define BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_datavld_delay_MASK (0xFF00U)
#define BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_datavld_delay_SHIFT (8U)
/*! ble_rx_datavld_delay - In Rx bursting mode; the BLE packet PDU bursting data valid max delay
 *    from last end of data valid or sync pulse. Watchdog timer value for sync pulse from BRF at the
 *    start of PDU. Hardware will automatically abort Rx operation upon expiration of the watchdog
 *    timer. Res: 1 usec.
 */
#define BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_datavld_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_datavld_delay_SHIFT)) & BTU2_BTU_RIF_BLE_RX_SYNC_DELAY_ble_rx_datavld_delay_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_PKT_STATUS - RIF dBus Rx Packet Status */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_ble_tx_pwr_adjd_MASK (0x1U)
#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_ble_tx_pwr_adjd_SHIFT (0U)
/*! ble_tx_pwr_adjd - BLE Tx power adjusted status, This bit indicates that BLE TX power was
 *    adjusted by BCA feedback. This bit is cleared on read. It is valid shortly after BCA grant is
 *    received; for each BLE TX packet.
 */
#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_ble_tx_pwr_adjd(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_ble_tx_pwr_adjd_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_ble_tx_pwr_adjd_MASK)

#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_rf_bt_test_mode_en_MASK (0x8U)
#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_rf_bt_test_mode_en_SHIFT (3U)
/*! rf_bt_test_mode_en - Enable BRF Bluetooth Test Mode */
#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_rf_bt_test_mode_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_rf_bt_test_mode_en_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_rf_bt_test_mode_en_MASK)

#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_bfdbk_tx_power_4m_ble_rdbk_MASK (0xFC00U)
#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_bfdbk_tx_power_4m_ble_rdbk_SHIFT (10U)
/*! bfdbk_tx_power_4m_ble_rdbk - BCA Feedback power for BLE packet, Feedback power value received
 *    from BCA for BLE TX packet. This value is overwritten when new BLE power level override is
 *    feedback from BCA.
 */
#define BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_bfdbk_tx_power_4m_ble_rdbk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_bfdbk_tx_power_4m_ble_rdbk_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_PKT_STATUS_bfdbk_tx_power_4m_ble_rdbk_MASK)
/*! @} */

