zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*! @name BTU_RIF_DBUS_RX_MODETYPE - RIF dBus Rx Mode Type */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_RX_MODETYPE_rf_rx_mode_type_resrv_MASK (0xFCU)
#define BTU2_BTU_RIF_DBUS_RX_MODETYPE_rf_rx_mode_type_resrv_SHIFT (2U)
/*! rf_rx_mode_type_resrv - reserved register */
#define BTU2_BTU_RIF_DBUS_RX_MODETYPE_rf_rx_mode_type_resrv(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_RX_MODETYPE_rf_rx_mode_type_resrv_SHIFT)) & BTU2_BTU_RIF_DBUS_RX_MODETYPE_rf_rx_mode_type_resrv_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RX_CTE_LEN_ADDR - RIF Register */
/*! @{ */

#define BTU2_BTU_RIF_BRF_RX_CTE_LEN_ADDR_rx_cte_len_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_RX_CTE_LEN_ADDR_rx_cte_len_addr_SHIFT (0U)
/*! rx_cte_len_addr - Radio Register Address for Rx CTE Length, The BRF register of the expected Rx CTE length., - Units: 8 micro-seconds. */
#define BTU2_BTU_RIF_BRF_RX_CTE_LEN_ADDR_rx_cte_len_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_RX_CTE_LEN_ADDR_rx_cte_len_addr_SHIFT)) & BTU2_BTU_RIF_BRF_RX_CTE_LEN_ADDR_rx_cte_len_addr_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_BLE_START_TIME_CODED - RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled. */
/*! @{ */

#define BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_tx_start_time_MASK (0xFFU)
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_tx_start_time_SHIFT (0U)
/*! ble_tx_start_time - Delay when bt_grant_n is sampled and rif_tx_req will start after
 *    start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE., - Resolution: 1/4 us.
 */
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_tx_start_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_tx_start_time_SHIFT)) & BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_tx_start_time_MASK)

#define BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_rx_start_time_MASK (0xFF00U)
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_rx_start_time_SHIFT (8U)
/*! ble_rx_start_time - Delay when bt_grant_n is sampled and rif_rx_req will start after
 *    start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued., - Resolution : 1/4 us.
 */
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_rx_start_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_rx_start_time_SHIFT)) & BTU2_BTU_RIF_ARB_BLE_START_TIME_CODED_ble_rx_start_time_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_BLE_START_TIME_1M - RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled. */
/*! @{ */

#define BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_tx_start_time_MASK (0xFFU)
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_tx_start_time_SHIFT (0U)
/*! ble_tx_start_time - Delay when bt_grant_n is sampled and rif_tx_req will start after
 *    start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE., - Resolution: 1/4 us.
 */
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_tx_start_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_tx_start_time_SHIFT)) & BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_tx_start_time_MASK)

#define BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_rx_start_time_MASK (0xFF00U)
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_rx_start_time_SHIFT (8U)
/*! ble_rx_start_time - Delay when bt_grant_n is sampled and rif_rx_req will start after
 *    start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued., - Resolution : 1/4 us.
 */
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_rx_start_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_rx_start_time_SHIFT)) & BTU2_BTU_RIF_ARB_BLE_START_TIME_1M_ble_rx_start_time_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_BLE_START_TIME_2M - RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled. */
/*! @{ */

#define BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_tx_start_time_MASK (0xFFU)
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_tx_start_time_SHIFT (0U)
/*! ble_tx_start_time - Delay when bt_grant_n is sampled and rif_tx_req will start after
 *    start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE., - Resolution: 1/4 us.
 */
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_tx_start_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_tx_start_time_SHIFT)) & BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_tx_start_time_MASK)

#define BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_rx_start_time_MASK (0xFF00U)
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_rx_start_time_SHIFT (8U)
/*! ble_rx_start_time - Delay when bt_grant_n is sampled and rif_rx_req will start after
 *    start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued., - Resolution : 1/4 us.
 */
#define BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_rx_start_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_rx_start_time_SHIFT)) & BTU2_BTU_RIF_ARB_BLE_START_TIME_2M_ble_rx_start_time_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_CTL - RIF ARB Control */
/*! @{ */

#define BTU2_BTU_RIF_ARB_CTL_ble_sw_abort_MASK   (0x2U)
#define BTU2_BTU_RIF_ARB_CTL_ble_sw_abort_SHIFT  (1U)
/*! ble_sw_abort - If set; current BLE traffic will be aborted and ble_sw_abort_intr will be
 *    issued., This bit cleared by hardware; after ble_sw_abort_intr is issued., If there is no ongoing BLE
 *    traffic; then there is no abort happening. But ble_sw_abort_intr will be issued anyway. It is
 *    software requirement to issue ble_sw_abort_intr weather there was ongoing BLE traffic got
 *    aborted or not.
 */
#define BTU2_BTU_RIF_ARB_CTL_ble_sw_abort(x)     (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_CTL_ble_sw_abort_SHIFT)) & BTU2_BTU_RIF_ARB_CTL_ble_sw_abort_MASK)

#define BTU2_BTU_RIF_ARB_CTL_rst_rif_arb_fsm_MASK (0x8U)
#define BTU2_BTU_RIF_ARB_CTL_rst_rif_arb_fsm_SHIFT (3U)
/*! rst_rif_arb_fsm - RIF-ARB Reset, If set; RIF-ARB fsm will reset and transition to idle state.
 *    Firmware first writes 1 and then writes 0 to this bit.
 */
#define BTU2_BTU_RIF_ARB_CTL_rst_rif_arb_fsm(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_CTL_rst_rif_arb_fsm_SHIFT)) & BTU2_BTU_RIF_ARB_CTL_rst_rif_arb_fsm_MASK)

#define BTU2_BTU_RIF_ARB_CTL_ble_sync_frame_en_MASK (0x200U)
#define BTU2_BTU_RIF_ARB_CTL_ble_sync_frame_en_SHIFT (9U)
/*! ble_sync_frame_en - Enable ble_sync_frame in arbitration decision, Enable considering
 *    ble_sync_frame in arbitration decision, 0x0: disable, 0x1: enable
 */
#define BTU2_BTU_RIF_ARB_CTL_ble_sync_frame_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_CTL_ble_sync_frame_en_SHIFT)) & BTU2_BTU_RIF_ARB_CTL_ble_sync_frame_en_MASK)

#define BTU2_BTU_RIF_ARB_CTL_rif_collide_MASK    (0x400U)
#define BTU2_BTU_RIF_ARB_CTL_rif_collide_SHIFT   (10U)
/*! rif_collide - KW47 Deadlock condition detection; with interrupt generation on ble_cutoff, This
 *    bit is set if there is a rising edge on rif_tx or rx during an on-going transaction. This bit
 *    gets cleared with a WtiteOne
 */
#define BTU2_BTU_RIF_ARB_CTL_rif_collide(x)      (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ARB_CTL_rif_collide_SHIFT)) & BTU2_BTU_RIF_ARB_CTL_rif_collide_MASK)
/*! @} */

/*! @name BTU_RIF_CCA_GRANT_OFFSET_TIME - BTU CCA GRANT OFFSET TIME, BTU CCA Grant Offset Time */
/*! @{ */

#define BTU2_BTU_RIF_CCA_GRANT_OFFSET_TIME_ble_cca_grant_offset_time_MASK (0xFF00U)
#define BTU2_BTU_RIF_CCA_GRANT_OFFSET_TIME_ble_cca_grant_offset_time_SHIFT (8U)
/*! ble_cca_grant_offset_time - BLE CCA Grant Offset time, Offset to the delay when bt_grant_n is
 *    sampled and rif_tx_start will start after rifTx (Tx request from BLE to RIF-ARB for radio
 *    access) is issued from BLE. This offset is only used in TX packets; and when ble_tx_cca_en is also
 *    set to 1., - Resolution: 0.25us
 */
#define BTU2_BTU_RIF_CCA_GRANT_OFFSET_TIME_ble_cca_grant_offset_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CCA_GRANT_OFFSET_TIME_ble_cca_grant_offset_time_SHIFT)) & BTU2_BTU_RIF_CCA_GRANT_OFFSET_TIME_ble_cca_grant_offset_time_MASK)
/*! @} */

/*! @name BTU_RIF_CCA_TX_FESW_OFFSET_TIME - BTU CCA TX FESW OFFSET TIME, BTU CCA TX FESW Offset Time */
/*! @{ */

