zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_CCA_TX_FESW_OFFSET_TIME_ble_cca_tx_fesw_offset_time_MASK (0xFF00U)
#define BTU2_BTU_RIF_CCA_TX_FESW_OFFSET_TIME_ble_cca_tx_fesw_offset_time_SHIFT (8U)
/*! ble_cca_tx_fesw_offset_time - BLE CCA TX FESW Offset time, Offset to the delay assertion of
 *    bttx_fesw in CCA mode to curb during CCA (RX) operation is ongoing. This offset is added on to
 *    tx_fesw_on_delay. This offset is only used in BLE TX packets; and when ble_tx_cca_en is also set
 *    to 1., - Resolution: 1us
 */
#define BTU2_BTU_RIF_CCA_TX_FESW_OFFSET_TIME_ble_cca_tx_fesw_offset_time(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CCA_TX_FESW_OFFSET_TIME_ble_cca_tx_fesw_offset_time_SHIFT)) & BTU2_BTU_RIF_CCA_TX_FESW_OFFSET_TIME_ble_cca_tx_fesw_offset_time_MASK)
/*! @} */

/*! @name BTU_RIF_TESTBUS_SEL_0 - RIF Testbus Select 0 */
/*! @{ */

#define BTU2_BTU_RIF_TESTBUS_SEL_0_btu_testbus_sel_0_MASK (0xFFFFU)
#define BTU2_BTU_RIF_TESTBUS_SEL_0_btu_testbus_sel_0_SHIFT (0U)
/*! btu_testbus_sel_0 - RIF Testbus Select; Lower Bits, Lower 15 bits of btu_testbus_sel; if,
 *    (btu_testbus_sel[i*2];btu_testbus_sel[i*2+1]) set to:, 0x0: get btc_testbus_out[i], 0x1: get
 *    ble_testbus_out[i], 0x2: get ble_debug_sw_msg_out(URAT), 0x3: get ble_test_sw_out[i]
 */
#define BTU2_BTU_RIF_TESTBUS_SEL_0_btu_testbus_sel_0(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TESTBUS_SEL_0_btu_testbus_sel_0_SHIFT)) & BTU2_BTU_RIF_TESTBUS_SEL_0_btu_testbus_sel_0_MASK)
/*! @} */

/*! @name BTU_RIF_TESTBUS_SEL_1 - RIF Testbus Select 1 */
/*! @{ */

#define BTU2_BTU_RIF_TESTBUS_SEL_1_btu_testbus_sel_1_MASK (0xFFFFU)
#define BTU2_BTU_RIF_TESTBUS_SEL_1_btu_testbus_sel_1_SHIFT (0U)
/*! btu_testbus_sel_1 - RIF Testbus Select; Upper Bits, Upper 15 bits of btu_testbus_sel; if,
 *    (btu_testbus_sel[i*2];btu_testbus_sel[i*2+1]) set to:, 0x0: get btc_testbus_out[i], 0x1: get
 *    ble_testbus_out[i], 0x2: get ble_debug_sw_msg_out(URAT), 0x3: get ble_test_sw_out[i]
 */
#define BTU2_BTU_RIF_TESTBUS_SEL_1_btu_testbus_sel_1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TESTBUS_SEL_1_btu_testbus_sel_1_SHIFT)) & BTU2_BTU_RIF_TESTBUS_SEL_1_btu_testbus_sel_1_MASK)
/*! @} */

/*! @name BTU_RIF_TESTBUS_OE - BTU Testbus Output Enable */
/*! @{ */

#define BTU2_BTU_RIF_TESTBUS_OE_btu_testbus_oe__MASK (0xFFFFU)
#define BTU2_BTU_RIF_TESTBUS_OE_btu_testbus_oe__SHIFT (0U)
/*! btu_testbus_oe_ - Debug testbus output enable, Active low BTU testbus output enables. */
#define BTU2_BTU_RIF_TESTBUS_OE_btu_testbus_oe_(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TESTBUS_OE_btu_testbus_oe__SHIFT)) & BTU2_BTU_RIF_TESTBUS_OE_btu_testbus_oe__MASK)
/*! @} */

/*! @name BTU_RIF_REG_DEBUG_SW_OUTDATA - BLE Debug Output Data */
/*! @{ */

#define BTU2_BTU_RIF_REG_DEBUG_SW_OUTDATA_testbus_sw_out_MASK (0xFFFFU)
#define BTU2_BTU_RIF_REG_DEBUG_SW_OUTDATA_testbus_sw_out_SHIFT (0U)
/*! testbus_sw_out - BLE debug software control testbus ouput, Only when
 *    btu_testbus_overrdie_by_ble_sw = 1; this software testbus is the BLE testbus output.
 */
#define BTU2_BTU_RIF_REG_DEBUG_SW_OUTDATA_testbus_sw_out(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_REG_DEBUG_SW_OUTDATA_testbus_sw_out_SHIFT)) & BTU2_BTU_RIF_REG_DEBUG_SW_OUTDATA_testbus_sw_out_MASK)
/*! @} */

/*! @name BTU_RIF_REG_DEBUG_INDATA - BLE Debug Input Data */
/*! @{ */

#define BTU2_BTU_RIF_REG_DEBUG_INDATA_testbus_in_MASK (0xFFFFU)
#define BTU2_BTU_RIF_REG_DEBUG_INDATA_testbus_in_SHIFT (0U)
/*! testbus_in - BLE debug testbus input */
#define BTU2_BTU_RIF_REG_DEBUG_INDATA_testbus_in(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_REG_DEBUG_INDATA_testbus_in_SHIFT)) & BTU2_BTU_RIF_REG_DEBUG_INDATA_testbus_in_MASK)
/*! @} */

/*! @name BTU_RIF_REG_DEBUG_SW_MSG - BLE Debug Software Message */
/*! @{ */

#define BTU2_BTU_RIF_REG_DEBUG_SW_MSG_debug_sw_msg_MASK (0xFFFFU)
#define BTU2_BTU_RIF_REG_DEBUG_SW_MSG_debug_sw_msg_SHIFT (0U)
/*! debug_sw_msg - Debug message, Software message is written into this register and transfered into FIFO. */
#define BTU2_BTU_RIF_REG_DEBUG_SW_MSG_debug_sw_msg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_REG_DEBUG_SW_MSG_debug_sw_msg_SHIFT)) & BTU2_BTU_RIF_REG_DEBUG_SW_MSG_debug_sw_msg_MASK)
/*! @} */

/*! @name BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT - BLE Debug Software Message FIFO Count */
/*! @{ */

#define BTU2_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_ble_reg_debug_sw_msg_fifo_cnt_MASK (0xFFU)
#define BTU2_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_ble_reg_debug_sw_msg_fifo_cnt_SHIFT (0U)
/*! ble_reg_debug_sw_msg_fifo_cnt - Debug message FIFO count */
#define BTU2_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_ble_reg_debug_sw_msg_fifo_cnt(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_ble_reg_debug_sw_msg_fifo_cnt_SHIFT)) & BTU2_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_ble_reg_debug_sw_msg_fifo_cnt_MASK)
/*! @} */

/*! @name BTU_RIF_TESTBUS_CONTROL - RIF Testbus Control */
/*! @{ */

#define BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_control_MASK (0xFU)
#define BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_control_SHIFT (0U)
/*! btu_rif_testbus_control - Testbus bank rotation */
#define BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_control(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_control_SHIFT)) & BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_control_MASK)

#define BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_en_MASK (0x8000U)
#define BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_en_SHIFT (15U)
/*! btu_rif_testbus_en - Enable debug mode to use BTU testbus */
#define BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_en_SHIFT)) & BTU2_BTU_RIF_TESTBUS_CONTROL_btu_rif_testbus_en_MASK)
/*! @} */

/*! @name BTU_RIF_BT_CLK_GATING - RIF Bluetooth Clock Gating */
/*! @{ */

#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_clk_en_MASK (0x2U)
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_clk_en_SHIFT (1U)
/*! bt_reg_aes_clk_en - AES Clock Enable, If set; Force bt_aes_clk to turn on., Otherwise; bt_aes_clk_en controls bt_aes_clk gating. */
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_clk_en_SHIFT)) & BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_clk_en_MASK)

#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_4m_clk_en_MASK (0x4U)
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_4m_clk_en_SHIFT (2U)
/*! bt_reg_rif_rx_4m_clk_en - RIF Rx 4M Clock Enable, 0x0: rif_rx_4m_clk_en controls clock gating, 0x1: forces rif_rx_4m_clk to turn on */
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_4m_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_4m_clk_en_SHIFT)) & BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_4m_clk_en_MASK)

#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_16m_clk_en_MASK (0x8U)
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_16m_clk_en_SHIFT (3U)
/*! bt_reg_rif_rx_16m_clk_en - RIF Rx 16M Clock Enable, 0x0: rif_rx_16m_clk_en controls clock gating
 *    for rif_rx_16m_clk, 0x1: forces rif_rx_16m_clk to turn on
 */
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_16m_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_16m_clk_en_SHIFT)) & BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_rif_rx_16m_clk_en_MASK)

#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_force_ebram_sysclk_en_MASK (0x40U)
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_force_ebram_sysclk_en_SHIFT (6U)
/*! bt_reg_force_ebram_sysclk_en - Force EBRAM ebSysClk enable, When set; ebSysClk to EBRAM is always ON; it is not gated. */
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_force_ebram_sysclk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_force_ebram_sysclk_en_SHIFT)) & BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_force_ebram_sysclk_en_MASK)

#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_sys_clk_en_MASK (0x80U)
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_sys_clk_en_SHIFT (7U)
/*! bt_reg_aes_sys_clk_en - Force aes sys clk enable, When set; sys clk to hw aes arbiter is always ON; it is not gated. */
#define BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_sys_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_sys_clk_en_SHIFT)) & BTU2_BTU_RIF_BT_CLK_GATING_bt_reg_aes_sys_clk_en_MASK)
/*! @} */

