zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*! @name BTU_RIF_CLK_SMPLD - RIF Clock Sampled, Mux select for Sampled generation logic. */
/*! @{ */

#define BTU2_BTU_RIF_CLK_SMPLD_btu_4m_smpld_mux_MASK (0x1U)
#define BTU2_BTU_RIF_CLK_SMPLD_btu_4m_smpld_mux_SHIFT (0U)
/*! btu_4m_smpld_mux - 4M Sampled MUX, Mux select to select the sync method., First method does not
 *    require the clocks to be in phase., Second wethod requires cloks to be in phase
 *    (synchronization between 4 MHz clock and ebSysClkIn)., If this bit is set to 1; it uses first method., This
 *    signal is used for both BTC and BLE.
 */
#define BTU2_BTU_RIF_CLK_SMPLD_btu_4m_smpld_mux(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CLK_SMPLD_btu_4m_smpld_mux_SHIFT)) & BTU2_BTU_RIF_CLK_SMPLD_btu_4m_smpld_mux_MASK)

#define BTU2_BTU_RIF_CLK_SMPLD_rif_rx_4m_smpld_mux_MASK (0x2U)
#define BTU2_BTU_RIF_CLK_SMPLD_rif_rx_4m_smpld_mux_SHIFT (1U)
/*! rif_rx_4m_smpld_mux - RIF Rx 4M Sampled MUX, Mux select to select sync methods., First method
 *    does not require clocks to be in phase., Second method requires clocks to be in phase (Used in
 *    synchronization between 16 MHz and 4 MHz clock. Used for sampling Gen4 data.), If set to 1;
 *    select first method.
 */
#define BTU2_BTU_RIF_CLK_SMPLD_rif_rx_4m_smpld_mux(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CLK_SMPLD_rif_rx_4m_smpld_mux_SHIFT)) & BTU2_BTU_RIF_CLK_SMPLD_rif_rx_4m_smpld_mux_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CLK_GATING - RIF BLE Clock Gating, Clock Enable register for BLE Clocks. */
/*! @{ */

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_sleep_clk_en_MASK (0x1U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_sleep_clk_en_SHIFT (0U)
/*! bt_reg_ble_sleep_clk_en - BLE Sleep Clock Enable, If set; forces ble_sleep_clk to turn on. */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_sleep_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_sleep_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_sleep_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_force_clk_en_MASK (0x2U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_force_clk_en_SHIFT (1U)
/*! bt_reg_ble_force_clk_en - BLE Force Clock Enable, If set; forces all BLE internal clocks to turn on. */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_force_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_force_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_force_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_slv_hclk_en_MASK (0x4U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_slv_hclk_en_SHIFT (2U)
/*! bt_reg_ble_slv_hclk_en - BLE Slave HCLK Enable, 0x0: ble_slv_hclk_en controls clock gating dynamically, 0x1: forces ble_sys_td_clk_en to turn on */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_slv_hclk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_slv_hclk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_slv_hclk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_mst_hclk_en_MASK (0x8U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_mst_hclk_en_SHIFT (3U)
/*! bt_reg_ble_mst_hclk_en - BLE Master HCLK Enable, 0x0: ble_mst_hclk_en controls clock gating, 0x1: forces ble_mst_hclk to 1 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_mst_hclk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_mst_hclk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_mst_hclk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_ric_sys_clk_en_MASK (0x10U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_ric_sys_clk_en_SHIFT (4U)
/*! bt_reg_ble_ric_sys_clk_en - BLE RIC System Clock Enable, 0x0: ble_ric_sys_clk_en controls
 *    dynamic clock gating, 0x1: force ble_ric_sys_clk to turn on
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_ric_sys_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_ric_sys_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_ric_sys_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tx_clk_en_MASK (0x20U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tx_clk_en_SHIFT (5U)
/*! bt_reg_ble_tx_clk_en - BLE Tx Clock Enable, 0x0: ble_tx_clk_en controls clock gating for
 *    ble_tx_clk, 0x1: forces ble_tx_clk; also forces ble_td_sys_clk_en to be set
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tx_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tx_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tx_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rx_clk_en_MASK (0x40U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rx_clk_en_SHIFT (6U)
/*! bt_reg_ble_rx_clk_en - BLE Rx Clock Enable, 0x0: ble_rx_clk controls clock gating dynamically,
 *    0x1: forces ble_rx_clk clocks to turn on; also forces ble_rd_sys_clk to turn on
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rx_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rx_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rx_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_td_sys_clk_en_MASK (0x80U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_td_sys_clk_en_SHIFT (7U)
/*! bt_reg_ble_td_sys_clk_en - BLE TD System Clock Enable, 0x0: ble_td_sys_clk_en controls clock
 *    gating dynamically, 0x1: forces ble_td_sys_clk to turn on
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_td_sys_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_td_sys_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_td_sys_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rd_sys_clk_en_MASK (0x100U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rd_sys_clk_en_SHIFT (8U)
/*! bt_reg_ble_rd_sys_clk_en - BLE RD System Clock Enable, 0x0: ble_rd_sys_clk_en controls dynamic clock gating, 0x1: forces ble_rd_sys_clk to turn on */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rd_sys_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rd_sys_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rd_sys_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rl_sys_clk_en_MASK (0x200U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rl_sys_clk_en_SHIFT (9U)
/*! bt_reg_ble_rl_sys_clk_en - BLE RD System Clock Enable, 0x0: ble_rl_sys_clk_en controls dynamic
 *    clock gating, 0x1: forces forces ble_rl_sys_clk to turn on
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rl_sys_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rl_sys_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_rl_sys_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_wl_sys_clk_en_MASK (0x400U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_wl_sys_clk_en_SHIFT (10U)
/*! bt_reg_ble_wl_sys_clk_en - BLE Whitelist Search System Clock Enable, 0x0: ble_wl_sys_clk_en
 *    controls dynamic clock gating, 0x1: forces ble_wl_sys_clk to turn on
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_wl_sys_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_wl_sys_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_wl_sys_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_irk_sys_clk_en_MASK (0x800U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_irk_sys_clk_en_SHIFT (11U)
/*! bt_reg_ble_irk_sys_clk_en - BLE IRK resolve System Clock Enable, 0x0: ble_irk_sys_clk_en
 *    controls dynamic clock gating, 0x1: forces ble_irk_sys_clk to turn on
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_irk_sys_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_irk_sys_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_irk_sys_clk_en_MASK)

