zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrs_clk_en_MASK (0x1000U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrs_clk_en_SHIFT (12U)
/*! bt_reg_ble_tmrs_clk_en - BLE cdt and pst timers clock enable, 0x0: ble_tmr_4m_clk_en controls
 *    dynamic clock gating, 0x1: forces ble_tmr_4m_clk_en to turn on
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrs_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrs_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrs_clk_en_MASK)

#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrreg_sys_clk_en_MASK (0x2000U)
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrreg_sys_clk_en_SHIFT (13U)
/*! bt_reg_ble_tmrreg_sys_clk_en - BLE timer registers clock enable, 0x0: BTU controls dynamic
 *    sysclk gating on SWT; CDT and PST registers, 0x1: forces SWT; CDT and PST registers sysclk to turn
 *    on
 */
#define BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrreg_sys_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrreg_sys_clk_en_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_GATING_bt_reg_ble_tmrreg_sys_clk_en_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CLK_CTRL - RIF BLE Clock Control, Register for Clock Control Logic */
/*! @{ */

#define BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_zero_MASK (0x1U)
#define BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_zero_SHIFT (0U)
/*! bt_reg_force_ble_clk_req_zero - Force BLE Clock Req Zero, ble_sp_req is set to put BLE to sleep.
 *    When a write (1 or 0) to this register is detected; BLE will set ble_clk_req to 0 and go to
 *    sleep. This will gate off all BLE clocks.
 */
#define BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_zero(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_zero_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_zero_MASK)

#define BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_one_MASK (0x2U)
#define BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_one_SHIFT (1U)
/*! bt_reg_force_ble_clk_req_one - Force BLE Clock Req One, When set; ble_clk_req will always be forced to 1. */
#define BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_one(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_one_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_CTRL_bt_reg_force_ble_clk_req_one_MASK)

#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_awake_sts_MASK (0x10U)
#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_awake_sts_SHIFT (4U)
/*! ble_awake_sts - BLE Awake Status, This bit indicates if BLE is in sleep or awake. */
#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_awake_sts(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_CTRL_ble_awake_sts_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_CTRL_ble_awake_sts_MASK)

#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_clk_req_early_assert_MASK (0x100U)
#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_clk_req_early_assert_SHIFT (8U)
/*! ble_clk_req_early_assert - ble_clk_req early assertion upon any BLE AHB access, Setting this bit
 *    will enable ble_clk_req early assertion upon any BLE AHB access; which allows bt_clk_req to
 *    be asserted earlier to APU.
 */
#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_clk_req_early_assert(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_CTRL_ble_clk_req_early_assert_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_CTRL_ble_clk_req_early_assert_MASK)

#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_sys_4m_early_ungate_MASK (0x200U)
#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_sys_4m_early_ungate_SHIFT (9U)
/*! ble_sys_4m_early_ungate - ble_sys_clk and ble_4m_clk early ungated upon any BLE AHB access,
 *    Setting this bit will allow ble_sys_clk and ble_4m_clk being ungated earlier upon any BLE AHB
 *    access during BLE sleep for faster BLE register access.
 */
#define BTU2_BTU_RIF_BLE_CLK_CTRL_ble_sys_4m_early_ungate(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CLK_CTRL_ble_sys_4m_early_ungate_SHIFT)) & BTU2_BTU_RIF_BLE_CLK_CTRL_ble_sys_4m_early_ungate_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_TX_PKT_END - BLE RIF dBus Tx Packet End Control */
/*! @{ */

#define BTU2_BTU_RIF_BLE_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay_SHIFT (0U)
/*! dbus_tx_pkt_end_delay - dBus Tx Packet End Delay, Time from the end of active Tx payload to dBus
 *    command that sets the radio back to IDLE., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_BLE_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay_SHIFT)) & BTU2_BTU_RIF_BLE_DBUS_TX_PKT_END_dbus_tx_pkt_end_delay_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_RX_PKT_END - BLE RIF dBus Rx Packet End Control */
/*! @{ */

#define BTU2_BTU_RIF_BLE_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay_SHIFT (0U)
/*! dbus_rx_pkt_end_delay - dBus Rx Packet End Delay, Time from the end of active Rx payload to dBus
 *    command that sets the radio back to IDLE., - Resolution: 0.25 us.
 */
#define BTU2_BTU_RIF_BLE_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay_SHIFT)) & BTU2_BTU_RIF_BLE_DBUS_RX_PKT_END_dbus_rx_pkt_end_delay_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_TX_RAMPDOWN - BLE RIF dBus Tx Rampdown Control */
/*! @{ */

#define BTU2_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay_SHIFT (0U)
/*! dbus_tx_rampdown_delay - dBus Tx Rampdown Delay, Delay time after the end of a Tx slot for
 *    ramping down the radio over the dBus., Resolution 0.25 us.
 */
#define BTU2_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay_SHIFT)) & BTU2_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_dbus_tx_rampdown_delay_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_RSSI - BLE RIF dBus RSSI */
/*! @{ */

#define BTU2_BTU_RIF_BLE_DBUS_RSSI_dbus_rssi_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_DBUS_RSSI_dbus_rssi_delay_SHIFT (0U)
/*! dbus_rssi_delay - Delay from RSSI trigger to start of RSSI read, Delay from the end of
 *    rif_rx_req to enable dBus RSSI read back., Resolution 0.25 us.
 */
#define BTU2_BTU_RIF_BLE_DBUS_RSSI_dbus_rssi_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_DBUS_RSSI_dbus_rssi_delay_SHIFT)) & BTU2_BTU_RIF_BLE_DBUS_RSSI_dbus_rssi_delay_MASK)
/*! @} */

/*! @name BTU_RIF_ADAPTIVITY_CTRL - BT Adaptivity Control, Register for BT Adaptivity Control */
/*! @{ */

#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_dis_MASK (0x1U)
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_dis_SHIFT (0U)
/*! ble_cca_dis - BLE CCA disable bit, FW override to disable CCA for current BLE Tx pkt. - Revert
 *    to normal Tx timing; clear A1 cca_before_tx_en bit; ignore brf_bt_cca_tx_drop; and no R2 DBUS.
 *    FW should set this bit before start_rif_tx time; and clear this bit before the next TX
 *    packet's start_rif_tx time.
 */
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_dis(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_dis_SHIFT)) & BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_dis_MASK)

