zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_cca_ed_factor_MASK (0xF0U)
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_cca_ed_factor_SHIFT (4U)
/*! cca_ed_factor - Forgetfactor for CCA NF linear mean averaging, Controls how many previous NF
 *    readings in the same channel are considered for NF linear mean averaging
 */
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_cca_ed_factor(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ADAPTIVITY_CTRL_cca_ed_factor_SHIFT)) & BTU2_BTU_RIF_ADAPTIVITY_CTRL_cca_ed_factor_MASK)

#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_rst_dyn_MASK (0x100U)
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_rst_dyn_SHIFT (8U)
/*! ble_cca_ebram_rst_dyn - Reset bit for BLE CCA abort counters, Reset all BLE CCA abort counters in EBRAM. This bit is self clearing. */
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_rst_dyn(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_rst_dyn_SHIFT)) & BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_rst_dyn_MASK)

#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_stat_en_MASK (0x400U)
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_stat_en_SHIFT (10U)
/*! ble_cca_ebram_stat_en - Enable bit for BLE CCA EBRAM STATISTICS, Enable BLE CCA abort counters and NF averaging in EBRAM. */
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_stat_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_stat_en_SHIFT)) & BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_cca_ebram_stat_en_MASK)

#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_nf_en_MASK (0x1000U)
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_nf_en_SHIFT (12U)
/*! ble_tx_nf_en - BLE NF during TX enable, Reading inband power in each TX channel gives the Noise
 *    Floor in that channel. This can be used for NF measurement; replacing scheduled NF measurement
 *    slots in BLE. When this bit is set; design works in NF mode. CCA is performed and NF is read
 *    back. brf_bt_cca_tx_drop indication from BRF is ignored. This bit is meant to be used together
 *    with ble_tx_cca_en bit ble_tx_cca_en = 1; ble_tx_nf_en = x:CCA is done; NF is read back; brf
 *    abort indication aborts TX (EU regulatory mode) ble_tx_cca_en = 0; ble_tx_nf_en = 1:CCA is
 *    done; NF is read back; brf abort indication ignored (Non EU countries can use this mode)
 *    ble_tx_cca_en = 0; ble_tx_nf_en = 0:CCA is not done before TX. Old behavior (legacy)
 */
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_nf_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_nf_en_SHIFT)) & BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_nf_en_MASK)

#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_cca_en_MASK (0x2000U)
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_cca_en_SHIFT (13U)
/*! ble_tx_cca_en - BLE CCA before TX enable, Global enable for BLE CCA before Tx scheme - new CA1;
 *    CA2 to BRF; bt_pll_req; brf_pu; fesw; bca_bt_grant_n new Tx timing to BCA/BRF; CCA abort
 *    handling (to BCA); new R2 DBUS; cca abort statistic in EBRAM and NF averaged in EBRAM
 */
#define BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_cca_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_cca_en_SHIFT)) & BTU2_BTU_RIF_ADAPTIVITY_CTRL_ble_tx_cca_en_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CCA_ED_READBACK - BLE ED Mag readback value, BLE ED Mag readback value */
/*! @{ */

#define BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_mag_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_mag_SHIFT (0U)
/*! ble_cca_ed_mag - BLE CCA ED Magnitude, BLE CCA ED Magnitude readback from R2 DBUS) */
#define BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_mag(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_mag_SHIFT)) & BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_mag_MASK)

#define BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_vld_MASK (0x8000U)
#define BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_vld_SHIFT (15U)
/*! ble_cca_ed_vld - BLE CCA ED valid, BLE CCA ED valid indication. If packet is aborted before R2
 *    time; the ble_cca_ed_mag may be invalid. This bit is set to 1 when ble_cca_ed_mag is valid.
 */
#define BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_vld(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_vld_SHIFT)) & BTU2_BTU_RIF_BLE_CCA_ED_READBACK_ble_cca_ed_vld_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_CCA_TX_PWRCTL - CCA TX PWRCTL Dbus, CCA TX PWRCTL Dbus */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_delay_SHIFT (0U)
/*! dbus_cca_tx_pwr_ctrl_wr_delay - CCA TX PWRCTL Dbus Delay, Delay value to position CA1 timing. Resolution 0.25us */
#define BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_delay_MASK)

#define BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_en_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_en_SHIFT (15U)
/*! dbus_cca_tx_pwr_ctrl_wr_en - CCA TX PWRCTL Dbus Enable, Enable CA1 DBUS. CA1 is performed only
 *    when this bit is set and also BT adaptivity features is enabled for the current controller (BTC
 *    or BLE)
 */
#define BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_en_SHIFT)) & BTU2_BTU_RIF_DBUS_CCA_TX_PWRCTL_dbus_cca_tx_pwr_ctrl_wr_en_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_CCA_TX_FSYN - CCA TX FSYN Dbus, CCA TX FSYN Dbus */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_delay_SHIFT (0U)
/*! dbus_cca_tx_fsyn_wr_delay - CCA TX FSYN Dbus Delay, Delay value to position CA1 timing. Resolution 0.25us */
#define BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_delay_MASK)

#define BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_en_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_en_SHIFT (15U)
/*! dbus_cca_tx_fsyn_wr_en - CCA TX FSYN Dbus Enable, Enable CA2 DBUS. CA2 is performed only when
 *    this bit is set and also BT adaptivity features is enabled for the current controller (BTC or
 *    BLE)
 */
#define BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_en_SHIFT)) & BTU2_BTU_RIF_DBUS_CCA_TX_FSYN_dbus_cca_tx_fsyn_wr_en_MASK)
/*! @} */

