zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*! @name BTU_RIF_DBUS_CCA_ED - CCA TX R2 Dbus, CCA TX R2 Dbus */
/*! @{ */

#define BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_delay_MASK (0x7FFU)
#define BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_delay_SHIFT (0U)
/*! dbus_cca_ed_delay - CCA TX R2 Dbus Delay, Delay value to position R2 timing. The delay is
 *    counted from the end of S pulse on BTU-BRF interface.
 */
#define BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_delay_SHIFT)) & BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_delay_MASK)

#define BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_en_MASK (0x8000U)
#define BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_en_SHIFT (15U)
/*! dbus_cca_ed_en - CCA TX R2 Dbus Enable, Enable R2 DBUS. R2 is performed only when this bit is
 *    set and also BT adaptivity features is enabled for the current controller (BTC or BLE)
 */
#define BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_en_SHIFT)) & BTU2_BTU_RIF_DBUS_CCA_ED_dbus_cca_ed_en_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_CCA_ED_ADDR - BRF CCA ED Address, BRF CCA ED Address */
/*! @{ */

#define BTU2_BTU_RIF_BRF_CCA_ED_ADDR_dbus_cca_ed_addr_MASK (0x7FFU)
#define BTU2_BTU_RIF_BRF_CCA_ED_ADDR_dbus_cca_ed_addr_SHIFT (0U)
/*! dbus_cca_ed_addr - BRF CCA ED Address, BRF register address for Inband Power Readback via R2 DBUS. */
#define BTU2_BTU_RIF_BRF_CCA_ED_ADDR_dbus_cca_ed_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BRF_CCA_ED_ADDR_dbus_cca_ed_addr_SHIFT)) & BTU2_BTU_RIF_BRF_CCA_ED_ADDR_dbus_cca_ed_addr_MASK)
/*! @} */

/*! @name BTU_RIF_BTC_CCA_CA1_2_DELAY - BTC CCA CA1 CA2 Delays, BTC CCA CA1 CA2 Delays */
/*! @{ */

#define BTU2_BTU_RIF_BTC_CCA_CA1_2_DELAY_rif_ca1_2_offset_for_abort_b4_cca_us_MASK (0x3F00U)
#define BTU2_BTU_RIF_BTC_CCA_CA1_2_DELAY_rif_ca1_2_offset_for_abort_b4_cca_us_SHIFT (8U)
/*! rif_ca1_2_offset_for_abort_b4_cca_us - CA1 CA2 offset for the case of abort before CCA TX,
 *    Additional offset to delay CA1 and CA2 when CCA pkt was after a bt rif abort or FFU bca abort. The
 *    default is to delay CA1;2 in these cases by 10us to allow BRF MCU to accept these DBUS timely.
 */
#define BTU2_BTU_RIF_BTC_CCA_CA1_2_DELAY_rif_ca1_2_offset_for_abort_b4_cca_us(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BTC_CCA_CA1_2_DELAY_rif_ca1_2_offset_for_abort_b4_cca_us_SHIFT)) & BTU2_BTU_RIF_BTC_CCA_CA1_2_DELAY_rif_ca1_2_offset_for_abort_b4_cca_us_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CCA_EBRAM_ADDR - BLE CCA EBRAM Address Offset, BLE CCA EBRAM Address Offset */
/*! @{ */

#define BTU2_BTU_RIF_BLE_CCA_EBRAM_ADDR_ble_cca_ebram_addr_MASK (0x3FFFU)
#define BTU2_BTU_RIF_BLE_CCA_EBRAM_ADDR_ble_cca_ebram_addr_SHIFT (0U)
/*! ble_cca_ebram_addr - BLE CCA EBRAM Address Offset, This register is the EBRAM offset value for BLE CCA statistics location. */
#define BTU2_BTU_RIF_BLE_CCA_EBRAM_ADDR_ble_cca_ebram_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CCA_EBRAM_ADDR_ble_cca_ebram_addr_SHIFT)) & BTU2_BTU_RIF_BLE_CCA_EBRAM_ADDR_ble_cca_ebram_addr_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CCA_THRESHOLD - BLE CCA Counter thresholds, BLE CCA Counter thresholds */
/*! @{ */

#define BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_abort_pkt_cnt_thd_MASK (0xFFU)
#define BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_abort_pkt_cnt_thd_SHIFT (0U)
/*! rif_ble_cca_abort_pkt_cnt_thd - BLE CCA abort packet count threshold, 8-bit value of threshold
 *    to be used along with EBRAM abort statistics. BTU will generate ble_cca_abort_thd_cnt_met
 *    interrupt to SW when the number of CCA aborted packets in any single channel have reached or
 *    exceeded this threshold value.
 */
#define BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_abort_pkt_cnt_thd(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_abort_pkt_cnt_thd_SHIFT)) & BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_abort_pkt_cnt_thd_MASK)

#define BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_tx_pkt_cnt_thd_MASK (0xFF00U)
#define BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_tx_pkt_cnt_thd_SHIFT (8U)
/*! rif_ble_cca_tx_pkt_cnt_thd - BLE CCA TX packet count threshold, 8-bit value of threshold to be
 *    used along with EBRAM abort statistics. BTU will generate ble_cca_tx_cnt_thd_met interrupt to
 *    SW when the number of total CCA TX packets in any single channel have reached or exceeded this
 *    threshold value.
 */
#define BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_tx_pkt_cnt_thd(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_tx_pkt_cnt_thd_SHIFT)) & BTU2_BTU_RIF_BLE_CCA_THRESHOLD_rif_ble_cca_tx_pkt_cnt_thd_MASK)
/*! @} */

/*! @name BTU_RIF_CCA_BLE_THRESHOLD_MET_STS - BLE CCA threshold met status, BLE CCA threshold met status */
/*! @{ */

#define BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_abort_cnt_thd_met_ch_MASK (0x7FU)
#define BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_abort_cnt_thd_met_ch_SHIFT (0U)
/*! rif_ble_cca_abort_cnt_thd_met_ch - BLE CCA abort count threshold met channel number, BLE channel
 *    read-back value; on which the CCA abort threshold was met; causing ble_cca_abort_thd_met
 *    interrupt to CPU
 */
#define BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_abort_cnt_thd_met_ch(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_abort_cnt_thd_met_ch_SHIFT)) & BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_abort_cnt_thd_met_ch_MASK)

#define BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_tx_cnt_thd_met_ch_MASK (0x7F00U)
#define BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_tx_cnt_thd_met_ch_SHIFT (8U)
/*! rif_ble_cca_tx_cnt_thd_met_ch - BLE CCA TX count threshold met channel number, BLE channel
 *    read-back value; on which the CCA total TX packet count threshold was met; causing
 *    ble_cca_txpkt_thd_met interrupt to CPU
 */
#define BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_tx_cnt_thd_met_ch(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_tx_cnt_thd_met_ch_SHIFT)) & BTU2_BTU_RIF_CCA_BLE_THRESHOLD_MET_STS_rif_ble_cca_tx_cnt_thd_met_ch_MASK)
/*! @} */

/*! @name BTU_RIF_CCA_BLE_RX_FESW_DELAY - BLE CCA RX FESW DELAYS, BLE CCA RX FESW DELAYS */
/*! @{ */

