zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_on_delay_MASK (0xFFU)
#define BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_on_delay_SHIFT (0U)
/*! ble_btrx_fesw_during_cca_on_delay - BLE btrx_fesw ON delay for CCA TX packets, Number of
 *    microseconds from wakeUp to turning on btrx_fesw for CCA portion of BLE Tx packets
 */
#define BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_on_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_on_delay_SHIFT)) & BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_on_delay_MASK)

#define BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_off_delay_MASK (0xFF00U)
#define BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_off_delay_SHIFT (8U)
/*! ble_btrx_fesw_during_cca_off_delay - BLE btrx_fesw OFF delay for CCA TX packets, Number of
 *    microseconds from wakeUp to turning off btrx_fesw for CCA portion of BLE Tx packets
 */
#define BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_off_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_off_delay_SHIFT)) & BTU2_BTU_RIF_CCA_BLE_RX_FESW_DELAY_ble_btrx_fesw_during_cca_off_delay_MASK)
/*! @} */

/*! @name BTU_PTA_CTRL - PTA Control */
/*! @{ */

#define BTU2_BTU_PTA_CTRL_reg_bt_tx_pwr_gate_en_MASK (0x2U)
#define BTU2_BTU_PTA_CTRL_reg_bt_tx_pwr_gate_en_SHIFT (1U)
/*! reg_bt_tx_pwr_gate_en - BT tx power enable for BCA, BT tx power enable for BCA, 0x0: Bt tx power is disabled, 0x1: Bt tx power is enabled */
#define BTU2_BTU_PTA_CTRL_reg_bt_tx_pwr_gate_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_CTRL_reg_bt_tx_pwr_gate_en_SHIFT)) & BTU2_BTU_PTA_CTRL_reg_bt_tx_pwr_gate_en_MASK)

#define BTU2_BTU_PTA_CTRL_bt_reg_pta_rx_4m_clk_en_MASK (0x8U)
#define BTU2_BTU_PTA_CTRL_bt_reg_pta_rx_4m_clk_en_SHIFT (3U)
/*! bt_reg_pta_rx_4m_clk_en - PTA Clock Gate Enable Override, PTA Clock Gate Enable Override; if set
 *    to 1; clock gating for PTA clocks is disabled = ungated clocks.
 */
#define BTU2_BTU_PTA_CTRL_bt_reg_pta_rx_4m_clk_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_CTRL_bt_reg_pta_rx_4m_clk_en_SHIFT)) & BTU2_BTU_PTA_CTRL_bt_reg_pta_rx_4m_clk_en_MASK)

#define BTU2_BTU_PTA_CTRL_bt_grant_bypass_en_MASK (0x40U)
#define BTU2_BTU_PTA_CTRL_bt_grant_bypass_en_SHIFT (6U)
/*! bt_grant_bypass_en - BCA coex grant bypass enable, When bt_grant_bypass_en is set; BCA coex
 *    grant bca_bt_grant_n is controlled by bt_grant_bypass_val register., 0x0: disable bt_grant_n
 *    bypass, 0x1: enable bt_grant_n bypass
 */
#define BTU2_BTU_PTA_CTRL_bt_grant_bypass_en(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_CTRL_bt_grant_bypass_en_SHIFT)) & BTU2_BTU_PTA_CTRL_bt_grant_bypass_en_MASK)

#define BTU2_BTU_PTA_CTRL_bt_grant_bypass_val_MASK (0x80U)
#define BTU2_BTU_PTA_CTRL_bt_grant_bypass_val_SHIFT (7U)
/*! bt_grant_bypass_val - BCA coex grant bypass value, When bt_grant_bypass_en is set; BCA coex
 *    grant bca_bt_grant_n is controlled by this register., 0x0: set BCA coex grant bt_grant_n to zero,
 *    0x1: set BCA coex grant bt_grant_n to one
 */
#define BTU2_BTU_PTA_CTRL_bt_grant_bypass_val(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_CTRL_bt_grant_bypass_val_SHIFT)) & BTU2_BTU_PTA_CTRL_bt_grant_bypass_val_MASK)

#define BTU2_BTU_PTA_CTRL_clralltxcntrs_MASK     (0x100U)
#define BTU2_BTU_PTA_CTRL_clralltxcntrs_SHIFT    (8U)
/*! clralltxcntrs - Clear All Tx Counters, When set; all of the PTA diagnostic counters are reset to
 *    0:, - Tx_Req_Hi_Cnt, - Tx_Loss_Hi_Cnt, - Tx_Loss_Med_Cnt, - Tx_Req_Med_Cnt, - Tx_Req_Med_Hi;
 *    Cnt, - Tx_Loss_Med_Hi_Cnt, 0x0: do not clear counters, 0x1: clear counters
 */
#define BTU2_BTU_PTA_CTRL_clralltxcntrs(x)       (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_CTRL_clralltxcntrs_SHIFT)) & BTU2_BTU_PTA_CTRL_clralltxcntrs_MASK)

#define BTU2_BTU_PTA_CTRL_mrvlcoexexiten_MASK    (0x800U)
#define BTU2_BTU_PTA_CTRL_mrvlcoexexiten_SHIFT   (11U)
/*! mrvlcoexexiten - Marvell Coexistence Exit Enable, Enable the reset of the MRVL coexistence state
 *    machine if neither rifTx nor rifRx is active at frameTick such that BT_REQ will go low., 0x0:
 *    disable, 0x1: enable
 */
#define BTU2_BTU_PTA_CTRL_mrvlcoexexiten(x)      (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_CTRL_mrvlcoexexiten_SHIFT)) & BTU2_BTU_PTA_CTRL_mrvlcoexexiten_MASK)
/*! @} */

/*! @name BTU_PTA_REQ_DELAY_TIMER - PTA Bt_Req Delay Timer */
/*! @{ */

#define BTU2_BTU_PTA_REQ_DELAY_TIMER_pta_req_delay_MASK (0x3FFU)
#define BTU2_BTU_PTA_REQ_DELAY_TIMER_pta_req_delay_SHIFT (0U)
/*! pta_req_delay - PTA Request Delay, When BTU uses MRVL Coexistence mode; this controls the delay
 *    from pta_tx_req/pta_rx_req to the rising edge of the BT_REQ., This value should never be
 *    programmed more than 15us; otherwise unexpected behavior will occur; such as dropped packets due to
 *    BCA grant timeout., - Unit: 0.25 us.
 */
#define BTU2_BTU_PTA_REQ_DELAY_TIMER_pta_req_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_REQ_DELAY_TIMER_pta_req_delay_SHIFT)) & BTU2_BTU_PTA_REQ_DELAY_TIMER_pta_req_delay_MASK)
/*! @} */

/*! @name BTU_PTA_BLE_RIF_ARB_COEX_PRI - BLE PTA Priority for BTC/BLE arbitration, BLE coex priority for BTC/BLE arbitration. */
/*! @{ */

#define BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_tx_pri_MASK (0x3U)
#define BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_tx_pri_SHIFT (0U)
/*! ble_tx_pri - BLE Coex Priority, The BLE Tx packet high/medium priority that is used to make RIF_ARB arbitration request. */
#define BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_tx_pri(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_tx_pri_SHIFT)) & BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_tx_pri_MASK)

#define BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_rx_pri_MASK (0x300U)
#define BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_rx_pri_SHIFT (8U)
/*! ble_rx_pri - BLE Coex Priority, The BLE Rx packet high/medium priority that is used to make RIF_ARB arbitration request. */
#define BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_rx_pri(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_rx_pri_SHIFT)) & BTU2_BTU_PTA_BLE_RIF_ARB_COEX_PRI_ble_rx_pri_MASK)
/*! @} */

/*! @name BTU_PTA_BLE_BCA_COEX_PRI - BLE PTA Priority for BCA arbitration, BLE coex priority for BCA arbitration. */
/*! @{ */

