zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_tx_pri_MASK (0x3U)
#define BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_tx_pri_SHIFT (0U)
/*! ble_tx_pri - BLE Coex Priority, The BLE Tx packet high/medium priority that is used to make BCA request. */
#define BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_tx_pri(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_tx_pri_SHIFT)) & BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_tx_pri_MASK)

#define BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_rx_pri_MASK (0x300U)
#define BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_rx_pri_SHIFT (8U)
/*! ble_rx_pri - BLE Coex Priority, The BLE Rx packet high/medium priority that is used to make BCA request. */
#define BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_rx_pri(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_rx_pri_SHIFT)) & BTU2_BTU_PTA_BLE_BCA_COEX_PRI_ble_rx_pri_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_INACTIVITY_REFCLK_0 - Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_0_mwsinactmsg_refclk_MASK (0xFFFFU)
#define BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_0_mwsinactmsg_refclk_SHIFT (0U)
/*! mwsinactmsg_refclk - Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt,
 *    Contains the lower 16-bit of the reference clock[27:2] when the MWS_Inact_Msg_Real_Int interrupt
 *    pulse is detected.
 */
#define BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_0_mwsinactmsg_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_0_mwsinactmsg_refclk_SHIFT)) & BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_0_mwsinactmsg_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_INACTIVITY_REFCLK_1 - Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_1_mwsinactmsg_refclk_MASK (0x3FFU)
#define BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_1_mwsinactmsg_refclk_SHIFT (0U)
/*! mwsinactmsg_refclk - Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt,
 *    Contains the upper 10-bit of the reference clock[27:2] when the MWS_Inact_Msg_Real_Int interrupt
 *    pulse is detected.
 */
#define BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_1_mwsinactmsg_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_1_mwsinactmsg_refclk_SHIFT)) & BTU2_BTU_PTA_MWS_INACTIVITY_REFCLK_1_mwsinactmsg_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_INACTIVITY_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_mwsinactmsg_pdbitcnt_MASK (0x1FFFU)
#define BTU2_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_mwsinactmsg_pdbitcnt_SHIFT (0U)
/*! mwsinactmsg_pdbitcnt - Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int
 *    Interrupt, Contains the reference pdBitCounter[12:0] when the MWS_Inact_Msg_Real_Int interrupt
 *    pulse is detected.
 */
#define BTU2_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_mwsinactmsg_pdbitcnt(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_mwsinactmsg_pdbitcnt_SHIFT)) & BTU2_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_mwsinactmsg_pdbitcnt_MASK)
/*! @} */

/*! @name BTU_PTA_INBAND_FREQ_SET_1 - PTA Inband Frequency Set 0, BT_FREQ is set when (BT_In_Band_Hi >= freqNr >= BT_In_Band_Lo) in MRVL Coexistence mode and BT_In_Band1_Freq_En is enabled. 2 sets of band gaps; final BT_FREQ is OR version of 2 sets. */
/*! @{ */

#define BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_lo_MASK (0xFFU)
#define BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_lo_SHIFT (0U)
/*! bt_in_band_lo - Bluetooth In Band Low, In MRVL Coexistence mode; this is the low bound of the frequency channel for BT_FREQ. */
#define BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_lo(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_lo_SHIFT)) & BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_lo_MASK)

#define BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_hi_MASK (0xFF00U)
#define BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_hi_SHIFT (8U)
/*! bt_in_band_hi - Bluetooth In Band High, In MRVL Coexistence mode; this is the high bound of the frequency channel for BT_FREQ. */
#define BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_hi(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_hi_SHIFT)) & BTU2_BTU_PTA_INBAND_FREQ_SET_1_bt_in_band_hi_MASK)
/*! @} */

/*! @name BTU_PTA_MODE_SELECT - PTA Mode Select */
/*! @{ */

#define BTU2_BTU_PTA_MODE_SELECT_bt_coex_mode_MASK (0x7U)
#define BTU2_BTU_PTA_MODE_SELECT_bt_coex_mode_SHIFT (0U)
/*! bt_coex_mode - Bluetooth Coexistence Mode Select, 0x0: disable, 0x1: CSR mode, 0x2: MRVL mode, 0x3: SUSHI mode */
#define BTU2_BTU_PTA_MODE_SELECT_bt_coex_mode(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_bt_coex_mode_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_bt_coex_mode_MASK)

#define BTU2_BTU_PTA_MODE_SELECT_bt_mws_coex_en_MASK (0x8U)
#define BTU2_BTU_PTA_MODE_SELECT_bt_mws_coex_en_SHIFT (3U)
/*! bt_mws_coex_en - Bluetooth and MWS Coexistence Mode Enable */
#define BTU2_BTU_PTA_MODE_SELECT_bt_mws_coex_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_bt_mws_coex_en_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_bt_mws_coex_en_MASK)

#define BTU2_BTU_PTA_MODE_SELECT_bt_ovlp_mode_MASK (0x10U)
#define BTU2_BTU_PTA_MODE_SELECT_bt_ovlp_mode_SHIFT (4U)
/*! bt_ovlp_mode - Bluetooth Overlap Mode, Select bt_overlap assertion mode, 0x0: non-filtered; old design, 0x1: filtered mode */
#define BTU2_BTU_PTA_MODE_SELECT_bt_ovlp_mode(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_bt_ovlp_mode_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_bt_ovlp_mode_MASK)

#define BTU2_BTU_PTA_MODE_SELECT_ovlp_supress_en_MASK (0x20U)
#define BTU2_BTU_PTA_MODE_SELECT_ovlp_supress_en_SHIFT (5U)
/*! ovlp_supress_en - Overlap Suppression Enable, Suppress BT_Overlap/BT_Scan_Overlap assertion if
 *    Tx power is less than the programmed threshold., 0x0: disable, 0x1: enable,
 *    BT_Overlap/BT_Scan_Overlap assertion to BCA will be suppressed if Tx_Power_Index, Value is less than the
 *    programmed BTU_PTA_TX_POWER_THRESHOLD for BR/EDR packet, type or is less than BTU_PTA_BLE_TX_PWR_THRHD
 *    for BLE packet.
 */
#define BTU2_BTU_PTA_MODE_SELECT_ovlp_supress_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_ovlp_supress_en_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_ovlp_supress_en_MASK)

#define BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_mode_MASK (0x40U)
#define BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_mode_SHIFT (6U)
/*! bt_scan_ovlp_mode - Bluetooth Scan Overlap Mode, Select bt_scan_overlap assertion mode, 0x0: non-filtered; old design, 0x1: filtered mode */
#define BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_mode(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_mode_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_mode_MASK)

