zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_rx_en_MASK (0x80U)
#define BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_rx_en_SHIFT (7U)
/*! bt_scan_ovlp_rx_en - Scan Overlap for Bluetooth Rx, Enables bt_scan_overlap assertion for Bluetooth Rx., 0x0: disable, 0x1: enable */
#define BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_rx_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_rx_en_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_bt_scan_ovlp_rx_en_MASK)

#define BTU2_BTU_PTA_MODE_SELECT_bt_3dg_coex_en_MASK (0x100U)
#define BTU2_BTU_PTA_MODE_SELECT_bt_3dg_coex_en_SHIFT (8U)
/*! bt_3dg_coex_en - Bluetooth and 3D-Glass Coexistence Mode Enable */
#define BTU2_BTU_PTA_MODE_SELECT_bt_3dg_coex_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_bt_3dg_coex_en_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_bt_3dg_coex_en_MASK)

#define BTU2_BTU_PTA_MODE_SELECT_bt_in_band1_freq_en_MASK (0x200U)
#define BTU2_BTU_PTA_MODE_SELECT_bt_in_band1_freq_en_SHIFT (9U)
/*! bt_in_band1_freq_en - BTU_PTA_INBAND_FREQ_SET_1 Band Gap Use Enable */
#define BTU2_BTU_PTA_MODE_SELECT_bt_in_band1_freq_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_bt_in_band1_freq_en_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_bt_in_band1_freq_en_MASK)

#define BTU2_BTU_PTA_MODE_SELECT_bt_tx_on_mode_MASK (0xC000U)
#define BTU2_BTU_PTA_MODE_SELECT_bt_tx_on_mode_SHIFT (14U)
/*! bt_tx_on_mode - BT_TX_ON mode selection, Selects the mode of operation for asserting the
 *    BT_TX_ON signal., - Bit[15]: Direct Mode: BT_TX_ON signal assertion is independent of MWS Rx and MWS
 *    scan operations, - Bit[14]: Filtered Mode: BT_TX_ON signal is asserted in real time by
 *    hardware by taking into account of MWS Rx overlap and MWS scan overlap conditions
 */
#define BTU2_BTU_PTA_MODE_SELECT_bt_tx_on_mode(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MODE_SELECT_bt_tx_on_mode_SHIFT)) & BTU2_BTU_PTA_MODE_SELECT_bt_tx_on_mode_MASK)
/*! @} */

/*! @name BTU_PTA_INBAND_FREQ_SET_0 - PTA Inband Frequency Set 1, BT_FREQ is set when (BT_In_Band_Hi >= freqNr >= BT_In_Band_Lo) in MRVL Coexistence mode. 2 sets of band gaps; final BT_FREQ is OR version of 2 sets. */
/*! @{ */

#define BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_lo_MASK (0xFFU)
#define BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_lo_SHIFT (0U)
/*! bt_in_band_lo - Bluetooth In Band Low, In MRVL Coexistence mode; this is the low bound of the frequency channel for BT_FREQ. */
#define BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_lo(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_lo_SHIFT)) & BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_lo_MASK)

#define BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_hi_MASK (0xFF00U)
#define BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_hi_SHIFT (8U)
/*! bt_in_band_hi - Bluetooth In Band High, In MRVL Coexistence mode; this is the high bound of the frequency channel for BT_FREQ. */
#define BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_hi(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_hi_SHIFT)) & BTU2_BTU_PTA_INBAND_FREQ_SET_0_bt_in_band_hi_MASK)
/*! @} */

/*! @name BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0 - Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_harqpatternsel_refclk_MASK (0xFFFFU)
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_harqpatternsel_refclk_SHIFT (0U)
/*! harqpatternsel_refclk - Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int
 *    Interrupt, Contains the lower 16-bit of the referenceClock[27:2] when the HARQ_Pattern_Sel_Real_Int
 *    interrupt pulse is detected.
 */
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_harqpatternsel_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_harqpatternsel_refclk_SHIFT)) & BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_harqpatternsel_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1 - Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_harqpatternsel_refclk_MASK (0x3FFU)
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_harqpatternsel_refclk_SHIFT (0U)
/*! harqpatternsel_refclk - Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int
 *    Interrupt, Contains the upper 10-bit of the referenceClock[27:2] when the HARQ_Pattern_Sel_Real_Int
 *    interrupt pulse is detected.
 */
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_harqpatternsel_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_harqpatternsel_refclk_SHIFT)) & BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_harqpatternsel_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_harqpatternsel_pdbitcnt_MASK (0x1FFFU)
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_harqpatternsel_pdbitcnt_SHIFT (0U)
/*! harqpatternsel_pdbitcnt - Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int
 *    Interrupt, Contains the reference pdBitCounter[12:0] when the HARQ_Pattern_Sel_Real_Int
 *    interrupt pulse is detected.
 */
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_harqpatternsel_pdbitcnt(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_harqpatternsel_pdbitcnt_SHIFT)) & BTU2_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_harqpatternsel_pdbitcnt_MASK)
/*! @} */

/*! @name BTU_PTA_HARQ_PATTERN_SEL_VAL - MWS Coex Signal HARQ_PATTERN_SEL Value */
/*! @{ */

#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_harqpatternselreg_MASK (0xFU)
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_harqpatternselreg_SHIFT (0U)
/*! harqpatternselreg - MWS Coex Signal HARQ_PATTERN_SEL Value, Contains the new HARQ_PATTERN_SEL
 *    value being received. When new HARQ_PATTERN_SEL is detected; the HARQ_Pattern_Sel_Real_Int
 *    real-time interrupt will be generated and new value of HARQ_PATTERN_SEL will be saved in here.
 */
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_harqpatternselreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_harqpatternselreg_SHIFT)) & BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_harqpatternselreg_MASK)

#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_mwsinactmsgreg_MASK (0x1F00U)
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_mwsinactmsgreg_SHIFT (8U)
/*! mwsinactmsgreg - MWS Coex Signal MWS_INACT_MSG Value, Contains the new MWS_INACT_MSG value being
 *    received. When new MWS_INACT_MSG is detected; the MWS_Inact_Msg_Real_Int real-time interrupt
 *    will be generated and new value of MWS_INACT_MSG will be saved here.
 */
#define BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_mwsinactmsgreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_mwsinactmsgreg_SHIFT)) & BTU2_BTU_PTA_HARQ_PATTERN_SEL_VAL_mwsinactmsgreg_MASK)
/*! @} */

/*! @name BTU_PTA_INFO_DELAY_TIMER - PTA Info Delay Timer */
/*! @{ */

