zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_PTA_INFO_DELAY_TIMER_pta_info_delay_MASK (0x7U)
#define BTU2_BTU_PTA_INFO_DELAY_TIMER_pta_info_delay_SHIFT (0U)
/*! pta_info_delay - Bluetooth Sniff Interval, When BT_Coex_Mode is set to MRVL mode; this is the
 *    time transition time for each of the PTA info bits (i.e.; priority bits) that are serially
 *    encoded on BT_STATE line., A value of 0 is invalid; and will lead to unknown results., - Unit: 0.25
 *    us
 */
#define BTU2_BTU_PTA_INFO_DELAY_TIMER_pta_info_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_INFO_DELAY_TIMER_pta_info_delay_SHIFT)) & BTU2_BTU_PTA_INFO_DELAY_TIMER_pta_info_delay_MASK)
/*! @} */

/*! @name BTU_PTA_BLE_SYNC_CTRL - PTA BLE Sync Control */
/*! @{ */

#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_priority_MASK (0x3U)
#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_priority_SHIFT (0U)
/*! ble_sync_priority - BLE Sync Priority, Sets Priority (sync_priority) for sync frame. The
 *    bt_state encodes if the current request is a sync frame or a regular frame. Each frame also has a
 *    2-bit priority. BLE firmware sync_priority value if BLE controls the radio.
 */
#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_priority(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_priority_SHIFT)) & BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_priority_MASK)

#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_dir_MASK (0x4U)
#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_dir_SHIFT (2U)
/*! ble_sync_dir - BLE Sync Direction, Controls the direction of the sync frame (sync_dir). BLE
 *    firmware sync_dir value if BLE controls the radio., 0x0: Rx first, 0x1: Tx first
 */
#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_dir(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_dir_SHIFT)) & BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_dir_MASK)

#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_fw_val_MASK (0x8U)
#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_fw_val_SHIFT (3U)
/*! ble_sync_frame_fw_val - BLE Sync Frame Firmware Value, BLE firmware sync_frame value if BLE controls the radio. */
#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_fw_val(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_fw_val_SHIFT)) & BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_fw_val_MASK)

#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_extend_MASK (0x10U)
#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_extend_SHIFT (4U)
/*! ble_sync_frame_extend - BLE Sync Frame Extend, BLE firmware sync_frame value will be extended
 *    (kept asserted) if BLE keeps controlling the radio. However; sync_frame value will be reset if
 *    BLE ongoing event got cutoff or abort., 0x0: sync_frame value will be de-asserted at falling
 *    edge of bt_req, 0x1: sync_frame value will be extended
 */
#define BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_extend(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_extend_SHIFT)) & BTU2_BTU_PTA_BLE_SYNC_CTRL_ble_sync_frame_extend_MASK)
/*! @} */

/*! @name BTU_PTA_PRI_INC_EBRAM_ADDR - EBRAM Base Address: PTA Priority Escalation */
/*! @{ */

#define BTU2_BTU_PTA_PRI_INC_EBRAM_ADDR_ebram_addr_MASK (0x3FFFU)
#define BTU2_BTU_PTA_PRI_INC_EBRAM_ADDR_ebram_addr_SHIFT (0U)
/*! ebram_addr - EBRAM Address */
#define BTU2_BTU_PTA_PRI_INC_EBRAM_ADDR_ebram_addr(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_PRI_INC_EBRAM_ADDR_ebram_addr_SHIFT)) & BTU2_BTU_PTA_PRI_INC_EBRAM_ADDR_ebram_addr_MASK)
/*! @} */

/*! @name BTU_PTA_SYNC_CTRL - PTA Voice/WLAN Sync Control */
/*! @{ */

#define BTU2_BTU_PTA_SYNC_CTRL_sync_mode_en_MASK (0x8U)
#define BTU2_BTU_PTA_SYNC_CTRL_sync_mode_en_SHIFT (3U)
/*! sync_mode_en - Sync Mode Enable, Enable MRVL Coexistence syncModel mode. The BT_STATE encodes if
 *    the current request is a sync frame or a regular frame. Each frame also has a 2-bit sync
 *    frame priority and a sync frame direction bit., If MRVL Coexistence syncModel mode is on; 4 more
 *    sync frame coexistence info are encoded sequentially on BT_STATE before other coexistence
 *    info:, 1. Sync Frame (sync_frame), 2. Sync Priority[0] (sync_priority[0]), 3. Sync Priority[1]
 *    (sync_priority[1]), 4. Sync Direction (sync_dir)
 */
#define BTU2_BTU_PTA_SYNC_CTRL_sync_mode_en(x)   (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_SYNC_CTRL_sync_mode_en_SHIFT)) & BTU2_BTU_PTA_SYNC_CTRL_sync_mode_en_MASK)
/*! @} */

/*! @name BTU_PTA_BLE_TX_PWR_THRHD - BLE Tx Power Threshold to Suppress Tx Overlap Assertion */
/*! @{ */

#define BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble1m_tx_pwr_thrshld_MASK (0xFFU)
#define BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble1m_tx_pwr_thrshld_SHIFT (0U)
/*! ble1m_tx_pwr_thrshld - BLE Tx power threshold for 1 Mbps packet to suppress BT_Overlap/BT_Scan_Overlap assertion */
#define BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble1m_tx_pwr_thrshld(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble1m_tx_pwr_thrshld_SHIFT)) & BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble1m_tx_pwr_thrshld_MASK)

#define BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble2m_tx_pwr_thrshld_MASK (0xFF00U)
#define BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble2m_tx_pwr_thrshld_SHIFT (8U)
/*! ble2m_tx_pwr_thrshld - BLE Tx power threshold for 2 Mbps packet to suppress BT_Overlap/BT_Scan_Overlap assertion */
#define BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble2m_tx_pwr_thrshld(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble2m_tx_pwr_thrshld_SHIFT)) & BTU2_BTU_PTA_BLE_TX_PWR_THRHD_ble2m_tx_pwr_thrshld_MASK)
/*! @} */

/*! @name BTU_PTA_STATE_DELAY_TIMER - PTA Bt_State Delay Timer */
/*! @{ */

#define BTU2_BTU_PTA_STATE_DELAY_TIMER_pta_state_delay_MASK (0x3FFU)
#define BTU2_BTU_PTA_STATE_DELAY_TIMER_pta_state_delay_SHIFT (0U)
/*! pta_state_delay - PTA State Delay, When BT_Coex_Mode is in MRVL mode; this controls the delay
 *    for the BT_STATE transition for the second transaction., This value should never be programmed
 *    less than 15us; otherwise unexpected behavior will occur; such as dropped packets., - Unit:
 *    0.25 us.
 */
#define BTU2_BTU_PTA_STATE_DELAY_TIMER_pta_state_delay(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_STATE_DELAY_TIMER_pta_state_delay_SHIFT)) & BTU2_BTU_PTA_STATE_DELAY_TIMER_pta_state_delay_MASK)
/*! @} */

/*! @name BTU_PTA_SLNA_CTRL - PTA SLNA Control */
/*! @{ */

