zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_PTA_SLNA_CTRL_ble_use_slna_MASK (0x1U)
#define BTU2_BTU_PTA_SLNA_CTRL_ble_use_slna_SHIFT (0U)
/*! ble_use_slna - BLE uses SLNA based on RSSI info, Among all Bluetooth link RSSI average
 *    information; software decides which path BLE traffic will use for Rx; for example; SLNA or path 3 of
 *    Bluetooth only., 0x0: use path 3 for Bluetooth only based on BLE RSSI average, 0x1: enable SLNA
 *    path based on BLE RSSI average
 */
#define BTU2_BTU_PTA_SLNA_CTRL_ble_use_slna(x)   (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_SLNA_CTRL_ble_use_slna_SHIFT)) & BTU2_BTU_PTA_SLNA_CTRL_ble_use_slna_MASK)

#define BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_sel_MASK (0x2U)
#define BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_sel_SHIFT (1U)
/*! ble_slna_cp_en_bp_sel - BLE side enable SLNA bias/charge pump bypass for software control, By
 *    default; slna_cp_en is dynamically control by rifRx because it requires 120us in advance.
 *    However; software can bypass it to control this enable by ble_slna_cp_en_bp_val with this selection
 *    bit is set., 0x0: use hardware dynamically controlled SLNA_cp_en, 0x1: software bypass to
 *    control the SLNA_cp_en
 */
#define BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_sel(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_sel_SHIFT)) & BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_sel_MASK)

#define BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_val_MASK (0x4U)
#define BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_val_SHIFT (2U)
/*! ble_slna_cp_en_bp_val - SLNA_cp Enable, When ble_slna_cp_en_by_sel is set; this value controls
 *    if SLNA_cp is enabled., When ble_slna_cp_en_by_sel is set; software controls SLNA_cp_en to
 *    enable or disable by this bit., 0x0: eisable SLNA cp, 0x1: enable SLNA cp
 */
#define BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_val(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_val_SHIFT)) & BTU2_BTU_PTA_SLNA_CTRL_ble_slna_cp_en_bp_val_MASK)
/*! @} */

/*! @name BTU_PTA_TX_POWER_THRESHOLD - Tx Power Threshold to Suppress Tx Overlap Assertion */
/*! @{ */

#define BTU2_BTU_PTA_TX_POWER_THRESHOLD_bdr_tx_pwr_thrshld_MASK (0xFFU)
#define BTU2_BTU_PTA_TX_POWER_THRESHOLD_bdr_tx_pwr_thrshld_SHIFT (0U)
/*! bdr_tx_pwr_thrshld - Tx power threshold for BDR packet to suppress bt_overlap/bt_scan_overlap assertion */
#define BTU2_BTU_PTA_TX_POWER_THRESHOLD_bdr_tx_pwr_thrshld(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_TX_POWER_THRESHOLD_bdr_tx_pwr_thrshld_SHIFT)) & BTU2_BTU_PTA_TX_POWER_THRESHOLD_bdr_tx_pwr_thrshld_MASK)

#define BTU2_BTU_PTA_TX_POWER_THRESHOLD_edr_tx_pwr_thrshld_MASK (0xFF00U)
#define BTU2_BTU_PTA_TX_POWER_THRESHOLD_edr_tx_pwr_thrshld_SHIFT (8U)
/*! edr_tx_pwr_thrshld - Tx power threshold for EDR packet to suppress bt_overlap/bt_scan_overlap assertion */
#define BTU2_BTU_PTA_TX_POWER_THRESHOLD_edr_tx_pwr_thrshld(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_TX_POWER_THRESHOLD_edr_tx_pwr_thrshld_SHIFT)) & BTU2_BTU_PTA_TX_POWER_THRESHOLD_edr_tx_pwr_thrshld_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_TX_OVERLAP_RANGE - MWS Frequency Overlap Range for Bluetooth Tx Slot */
/*! @{ */

#define BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_tx_mws_overlap_range_MASK (0xFFU)
#define BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_tx_mws_overlap_range_SHIFT (0U)
/*! tx_mws_overlap_range - MWS frequency overlap range for BR/EDR Tx Slots, Under MWS Coex Mode; MWS
 *    frequency overlap range for BR/EDR Tx slots., Bit[7] direction bit:, - Bits[6:0] value:
 *    overlap boundary channel, The overlap boundary indexes the Bluetooth's 0~78 channels. The direction
 *    bit being 0 represents the upper boundary channel and all smaller index channels thereof are
 *    fallen in the overlap range; whereas the bit begin 1 represents the lower boundary channel and
 *    all larger index channels thereof are fallen in the overlap range., 0x0: upper boundary, 0x1:
 *    lower boundary
 */
#define BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_tx_mws_overlap_range(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_tx_mws_overlap_range_SHIFT)) & BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_tx_mws_overlap_range_MASK)

#define BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_ble_tx_mws_overlap_range_MASK (0xFF00U)
#define BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_ble_tx_mws_overlap_range_SHIFT (8U)
/*! ble_tx_mws_overlap_range - MWS frequency overlap range for BLE Tx packets, Under MWS Coex Mode;
 *    MWS frequency overlap range for BLE Tx packets., Bit[7] direction bit:, - Bits[6:0] value:
 *    overlap boundary channel, The overlap boundary indexes the Bluetooth's 0~78 channels. The
 *    direction bit being 0 represents the upper boundary channel and all smaller index channels thereof
 *    are fallen in the overlap range; whereas the bit begin 1 represents the lower boundary channel
 *    and all larger index channels thereof are fallen in the overlap range., 0x0: upper boundary,
 *    0x1: lower boundary
 */
#define BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_ble_tx_mws_overlap_range(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_ble_tx_mws_overlap_range_SHIFT)) & BTU2_BTU_PTA_MWS_TX_OVERLAP_RANGE_ble_tx_mws_overlap_range_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_RX_OVERLAP_RANGE - MWS Frequency Overlap Range for Bluetooth Rx Slot */
/*! @{ */

#define BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_rx_mws_overlap_range_MASK (0xFFU)
#define BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_rx_mws_overlap_range_SHIFT (0U)
/*! rx_mws_overlap_range - MWS frequency overlap range for BR/EDR Rx Slots, Under MWS Coex Mode; MWS
 *    frequency overlap range for BR/EDR Rx slots., Bit[7] direction bit:, - Bits[6:0] value:
 *    overlap boundary, The overlap boundary indexes the Bluetooth's 0~78 channels. The direction bit
 *    being '0' represents the upper boundary channel and all smaller index channels thereof are fallen
 *    in the overlap range; whereas the bit begin '1' represents the lower boundary channel and all
 *    larger index channels thereof are fallen in the overlap range., 0x0: upper boundary, 0x1:
 *    lower boundary
 */
#define BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_rx_mws_overlap_range(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_rx_mws_overlap_range_SHIFT)) & BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_rx_mws_overlap_range_MASK)

#define BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_ble_rx_mws_overlap_range_MASK (0xFF00U)
#define BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_ble_rx_mws_overlap_range_SHIFT (8U)
/*! ble_rx_mws_overlap_range - MWS frequency overlap range for BLE Rx Packets, Under MWS Coex Mode;
 *    MWS frequency overlap range for BLE Rx packets., Bit[7] direction bit:, - Bits[6:0] value:
 *    overlap boundary, The overlap boundary indexes the Bluetooth's 0~78 channels. The direction bit
 *    being '0' represents the upper boundary channel and all smaller index channels thereof are
 *    fallen in the overlap range; whereas the bit begin '1' represents the lower boundary channel and
 *    all larger index channels thereof are fallen in the overlap range., 0x0: upper boundary, 0x1:
 *    lower boundary
 */
#define BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_ble_rx_mws_overlap_range(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_ble_rx_mws_overlap_range_SHIFT)) & BTU2_BTU_PTA_MWS_RX_OVERLAP_RANGE_ble_rx_mws_overlap_range_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_TX_ON_START - MWS Coex Signal BT_TX_ON Start Timer */
/*! @{ */

#define BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_START_bttxonstartreg_MASK (0x3FFU)
#define BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_START_bttxonstartreg_SHIFT (0U)
/*! bttxonstartreg - BT_TX_ON Start Timer, Under MWS Coex Mode; btTxOnStartReg determines the delay
 *    from rifTx assertion to the rising edge of BT_TX_ON. The time between the rising edge of
 *    BT_TX_ON to the rifTx assertion is (btTxOnStartReg+1) unit of 0.25us., This value should never be
 *    program less than 1; other wise unexpected behavior will occur., - Resolution: 0.25 us., Since
 *    this signal can only assert on successful grant from BCA; this timing needs to be greater than
 *    the delay from rifTx to bca_grant_n.
 */
#define BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_START_bttxonstartreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_START_bttxonstartreg_SHIFT)) & BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_START_bttxonstartreg_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_TX_ON_END - MWS Coex Signal BT_TX_ON End Timer */
/*! @{ */

#define BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_END_bttxonendreg_MASK (0x3FFU)
#define BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_END_bttxonendreg_SHIFT (0U)
/*! bttxonendreg - BT_TX_ON End Timer, Under MWS Coex Mode; btTxOnEndReg determines the delay from
 *    rifTx de-assertion to the falling edge of BT_TX_ON. The time between the falling edge of
 *    BT_TX_ON to the rifTx de-assertion is (btTxOnEndReg+1) unit of 0.25us., This value should never be
 *    program less than 1; otherwise unexpected behavior will occur., - Resolution: 0.25 us.
 */
#define BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_END_bttxonendreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_END_bttxonendreg_SHIFT)) & BTU2_BTU_PTA_MWS_COEX_BT_TX_ON_END_bttxonendreg_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST - MWS Coex Signal BT_RX_PRI Start Timer for Master Mode */
/*! @{ */

#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_btrxpristartmstreg_MASK (0xFFFU)
#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_btrxpristartmstreg_SHIFT (0U)
/*! btrxpristartmstreg - BT_RX_PRI Start Timer for Master Mode, In Real Time mode;
 *    btRxPriStartMstReg determines the delay from rifRx (if
 *    bt_rx_pri_mst_tm_sel/bt_rx_pri_page_resp_tm_sel/bt_rx_pri_inq_resp_tm_sel = 0) or rifTx (if
 *    bt_rx_pri_mst_tm_sel/bt_rx_pri_page_resp_tm_sel/bt_rx_pri_inq_resp_tm_sel = 1) assertion to the rising edge of BT_RX_PRI. The time between the rising
 *    edge of BT_RX_PRI to the rifRx (or rifTx) assertion is (btRxPriStartMstReg+1) unit of 0.25us.,
 *    This value should never be program less than 1; other wise unexpected behavior will occur., -
 *    Resolution: 0.25 us., Since this signal can only assert on successful grant from BCA; this
 *    timing needs to be greater than the delay from rifRx (or rifTx) to bca_grant_n.
 */
#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_btrxpristartmstreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_btrxpristartmstreg_SHIFT)) & BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_btrxpristartmstreg_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_RX_PRI_END - MWS Coex Signal BT_RX_PRI End Timer */
/*! @{ */

