zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_END_btrxpriendreg_MASK (0x3FFU)
#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_END_btrxpriendreg_SHIFT (0U)
/*! btrxpriendreg - BT_RX_PRI End Timer, Under MWS Coex Mode; btRxPriEndReg determines the delay
 *    from rifRx de-assertion to the falling edge of BT_RX_PRI The time between the falling edge of
 *    BT_RX_PRI to the rifRx de-assertion is (btRxPriEndReg+1) unit of 0.25us., This value should never
 *    be program less than 1; otherwise unexpected behavior will occur., - Resolution: 0.25 us.
 */
#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_END_btrxpriendreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_END_btrxpriendreg_SHIFT)) & BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_END_btrxpriendreg_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_FRAMESYNC_REFCLK_0 - Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_mwsframesync_refclk_MASK (0xFFFFU)
#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_mwsframesync_refclk_SHIFT (0U)
/*! mwsframesync_refclk - Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt,
 *    Contains the lower 16-bit of the referenceClock[27:2] when the MWS frame sync interrupt pulse is
 *    detected.
 */
#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_mwsframesync_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_mwsframesync_refclk_SHIFT)) & BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_mwsframesync_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_FRAMESYNC_REFCLK_1 - Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_mwsframesync_refclk_MASK (0x3FFU)
#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_mwsframesync_refclk_SHIFT (0U)
/*! mwsframesync_refclk - Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt,
 *    Contains the upper 10-bit of the referenceClock[27:2] when the MWS frame sync interrupt pulse is
 *    detected.
 */
#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_mwsframesync_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_mwsframesync_refclk_SHIFT)) & BTU2_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_mwsframesync_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_mwsframesync_pdbitcnt_MASK (0x1FFFU)
#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_mwsframesync_pdbitcnt_SHIFT (0U)
/*! mwsframesync_pdbitcnt - Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse
 *    Interrupt, Contains the reference pdBitCounter[12:0] when the MWS frame sync interrupt pulse is
 *    detected.
 */
#define BTU2_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_mwsframesync_pdbitcnt(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_mwsframesync_pdbitcnt_SHIFT)) & BTU2_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_mwsframesync_pdbitcnt_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_PATTERN_REFCLK_0 - Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_PATTERN_REFCLK_0_mwspattern_refclk_MASK (0xFFFFU)
#define BTU2_BTU_PTA_MWS_PATTERN_REFCLK_0_mwspattern_refclk_SHIFT (0U)
/*! mwspattern_refclk - Bluetooth Reference Clock Snapshot on MWS_PATTERN Pulse Interrupt, Contains
 *    the lower 16-bit of the referenceClock[27:2] when the MWS_Pattern_Real_Int interrupt pulse is
 *    detected.
 */
#define BTU2_BTU_PTA_MWS_PATTERN_REFCLK_0_mwspattern_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_PATTERN_REFCLK_0_mwspattern_refclk_SHIFT)) & BTU2_BTU_PTA_MWS_PATTERN_REFCLK_0_mwspattern_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_PATTERN_REFCLK_1 - Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_PATTERN_REFCLK_1_mwspattern_refclk_MASK (0x3FFU)
#define BTU2_BTU_PTA_MWS_PATTERN_REFCLK_1_mwspattern_refclk_SHIFT (0U)
/*! mwspattern_refclk - Bluetooth Reference Clock Snapshot on MWS_PATTERN Pulse Interrupt, Contains
 *    the upper 10-bit of the referenceClock[27:2] when the MWS_Pattern_Real_Int interrupt pulse is
 *    detected.
 */
#define BTU2_BTU_PTA_MWS_PATTERN_REFCLK_1_mwspattern_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_PATTERN_REFCLK_1_mwspattern_refclk_SHIFT)) & BTU2_BTU_PTA_MWS_PATTERN_REFCLK_1_mwspattern_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_PATTERN_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on MWS_Pattern_Real_Int Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_MWS_PATTERN_REFPDB_CNT_mwspattern_pdbitcnt_MASK (0x1FFFU)
#define BTU2_BTU_PTA_MWS_PATTERN_REFPDB_CNT_mwspattern_pdbitcnt_SHIFT (0U)
/*! mwspattern_pdbitcnt - Bluetooth Reference pdBitCounter Snapshot on MWS_PATTERN Pulse Interrupt,
 *    Contains the reference pdBitCounter[12:0] when the MWS_Pattern_Real_Int interrupt pulse is
 *    detected.
 */
#define BTU2_BTU_PTA_MWS_PATTERN_REFPDB_CNT_mwspattern_pdbitcnt(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_PATTERN_REFPDB_CNT_mwspattern_pdbitcnt_SHIFT)) & BTU2_BTU_PTA_MWS_PATTERN_REFPDB_CNT_mwspattern_pdbitcnt_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_PATTERN_VAL - MWS Coex Signal MWS_PATTERN Value */
/*! @{ */

#define BTU2_BTU_PTA_MWS_PATTERN_VAL_mwspatternreg_MASK (0x3U)
#define BTU2_BTU_PTA_MWS_PATTERN_VAL_mwspatternreg_SHIFT (0U)
/*! mwspatternreg - MWS Coex Signal MWS_PATTERN Value, Contains the new MWS_PATTERN value being
 *    received. When new MWS_PATTERN is detected; the MWS_Pattern_Real_Int real-time interrupt will be
 *    generated and new value of MWS_PATTERN will be saved in here.
 */
#define BTU2_BTU_PTA_MWS_PATTERN_VAL_mwspatternreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_PATTERN_VAL_mwspatternreg_SHIFT)) & BTU2_BTU_PTA_MWS_PATTERN_VAL_mwspatternreg_MASK)

#define BTU2_BTU_PTA_MWS_PATTERN_VAL_mwsscanfreqreg_MASK (0x1F00U)
#define BTU2_BTU_PTA_MWS_PATTERN_VAL_mwsscanfreqreg_SHIFT (8U)
/*! mwsscanfreqreg - MWS Coex Signal MWS_SCAN_FREQUENCY Value, Contains the new MWS_SCAN_FREQUENCY
 *    value being received. When new non-zero MWS_SCAN_FREQUENCY is detected; the
 *    MWS_Scan_Frequency_Real_Int real-time interrupt will be generated and new value of MWS_SCAN_FREQUENCY will be
 *    saved here.
 */
#define BTU2_BTU_PTA_MWS_PATTERN_VAL_mwsscanfreqreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_PATTERN_VAL_mwsscanfreqreg_SHIFT)) & BTU2_BTU_PTA_MWS_PATTERN_VAL_mwsscanfreqreg_MASK)
/*! @} */

/*! @name BTU_PTA_3DG_CLK_UPDATE_REFCLK_0 - Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt */
/*! @{ */

