zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_bt3dgclkupdate_refclk_MASK (0xFFFFU)
#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_bt3dgclkupdate_refclk_SHIFT (0U)
/*! bt3dgclkupdate_refclk - Bluetooth Reference Clock Snapshot on 3D-Glass Clock Update Pulse
 *    Interrupt, Contrains the lower 16-bit of the referenceClock[27:2] when the 3D-Glass clock update
 *    interrupt pulse is detected.
 */
#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_bt3dgclkupdate_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_bt3dgclkupdate_refclk_SHIFT)) & BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_bt3dgclkupdate_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_3DG_CLK_UPDATE_REFCLK_1 - Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_bt3dgclkupdate_refclk_MASK (0x3FFU)
#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_bt3dgclkupdate_refclk_SHIFT (0U)
/*! bt3dgclkupdate_refclk - Bluetooth Reference Clock Snapshot on 3D-Glass Clock Update Pulse
 *    Interrupt, Contrains the upper 10-bit of the referenceClock[27:2] when the 3D-Glass clock update
 *    interrupt pulse is detected.
 */
#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_bt3dgclkupdate_refclk(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_bt3dgclkupdate_refclk_SHIFT)) & BTU2_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_bt3dgclkupdate_refclk_MASK)
/*! @} */

/*! @name BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on BT_3DG_CLK_UPDATE Pulse Interrupt */
/*! @{ */

#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_bt3dgclkupdate_pdbitcnt_MASK (0x1FFFU)
#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_bt3dgclkupdate_pdbitcnt_SHIFT (0U)
/*! bt3dgclkupdate_pdbitcnt - Bluetooth Reference pdBitCounter Snapshot on 3D-Glass Clock Update
 *    Pulse Interrupt, Contrains the reference pdBitCounter[12:0] when the 3D-Glass clock update
 *    interrupt pulse is detected.
 */
#define BTU2_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_bt3dgclkupdate_pdbitcnt(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_bt3dgclkupdate_pdbitcnt_SHIFT)) & BTU2_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_bt3dgclkupdate_pdbitcnt_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4 - MWS Scan Frequency Overlap Range 1~4 */
/*! @{ */

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_1_MASK (0xFU)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_1_SHIFT (0U)
/*! mws_scan_ovlp_range_1 - MWS scan frequency overlap range 1, The MWS scan frequency overlap range
 *    1 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0001 during MWS scan operation., -
 *    Bit[3] indicates the direction: 0 = represents the upper boundary; the number of subgroups being
 *    overlapped counts forward from subgroup 0. 1 = represents the lower boundary; the number of
 *    subgroups being overlapped counts backward from subgroup 7. Bits[2:0] indicate the number of
 *    Bluetooth channel subgroups that fall into the overlap range., - Pre-defined encoding: 0000: no
 *    overlapped. 1000: all channel 0~78 overlapped. 0001: channel 0~9 are overlapped with lower MWS
 *    scan frequency band; channel 10~78 are not. 0010: channel 0~19 are overlapped with lower MWS
 *    scan frequency band; channel 20~78 are not. ... 1001: channel 70~78 are overlapped with upper
 *    MWS scan frequency band; channel 0~69 are not. 1010: channel 60~78 are overlapped with upper
 *    MWS scan frequency band; channel 0~59 are not. ...
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_1_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_1_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_2_MASK (0xF0U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_2_SHIFT (4U)
/*! mws_scan_ovlp_range_2 - MWS scan frequency overlap range 2, The MWS scan frequency overlap range
 *    2 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0010 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_2(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_2_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_2_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_3_MASK (0xF00U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_3_SHIFT (8U)
/*! mws_scan_ovlp_range_3 - MWS scan frequency overlap range 3, The MWS scan frequency overlap range
 *    3 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0011 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_3(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_3_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_3_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_4_MASK (0xF000U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_4_SHIFT (12U)
/*! mws_scan_ovlp_range_4 - MWS scan frequency overlap range 4, The MWS scan frequency overlap range
 *    4 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0100 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_4(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_4_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_mws_scan_ovlp_range_4_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8 - MWS Scan Frequency Overlap Range 5~8 */
/*! @{ */

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_5_MASK (0xFU)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_5_SHIFT (0U)
/*! mws_scan_ovlp_range_5 - MWS scan frequency overlap range 5, The MWS scan frequency overlap range
 *    5 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0101 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_5(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_5_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_5_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_6_MASK (0xF0U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_6_SHIFT (4U)
/*! mws_scan_ovlp_range_6 - MWS scan frequency overlap range 6, The MWS scan frequency overlap range
 *    6 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0110 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_6(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_6_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_6_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_7_MASK (0xF00U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_7_SHIFT (8U)
/*! mws_scan_ovlp_range_7 - MWS scan frequency overlap range 7, The MWS scan frequency overlap range
 *    7 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0111 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_7(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_7_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_7_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_8_MASK (0xF000U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_8_SHIFT (12U)
/*! mws_scan_ovlp_range_8 - MWS scan frequency overlap range 8, The MWS scan frequency overlap range
 *    8 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1000 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_8(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_8_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_mws_scan_ovlp_range_8_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12 - MWS Scan Frequency Overlap Range 9~12 */
/*! @{ */

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_9_MASK (0xFU)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_9_SHIFT (0U)
/*! mws_scan_ovlp_range_9 - MWS scan frequency overlap range 9, The MWS scan frequency overlap range
 *    9 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1001 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_9(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_9_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_9_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_10_MASK (0xF0U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_10_SHIFT (4U)
/*! mws_scan_ovlp_range_10 - MWS scan frequency overlap range 10, The MWS scan frequency overlap
 *    range 10 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1010 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_10(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_10_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_10_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_11_MASK (0xF00U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_11_SHIFT (8U)
/*! mws_scan_ovlp_range_11 - MWS scan frequency overlap range 11, The MWS scan frequency overlap
 *    range 11 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1011 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_11(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_11_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_11_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_12_MASK (0xF000U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_12_SHIFT (12U)
/*! mws_scan_ovlp_range_12 - MWS scan frequency overlap range 12, The MWS scan frequency overlap
 *    range 12 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1100 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_12(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_12_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_mws_scan_ovlp_range_12_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16 - MWS Scan Frequency Overlap Range 13~16 */
/*! @{ */

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_13_MASK (0xFU)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_13_SHIFT (0U)
/*! mws_scan_ovlp_range_13 - MWS scan frequency overlap range 13, The MWS scan frequency overlap
 *    range 13 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1101 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_13(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_13_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_13_MASK)

