zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_14_MASK (0xF0U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_14_SHIFT (4U)
/*! mws_scan_ovlp_range_14 - MWS scan frequency overlap range 14, The MWS scan frequency overlap
 *    range 14 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1110 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_14(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_14_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_14_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_15_MASK (0xF00U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_15_SHIFT (8U)
/*! mws_scan_ovlp_range_15 - MWS scan frequency overlap range 15, The MWS scan frequency overlap
 *    range 15 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1111 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_15(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_15_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_15_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_16_MASK (0xF000U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_16_SHIFT (12U)
/*! mws_scan_ovlp_range_16 - MWS scan frequency overlap range 16, The MWS scan frequency overlap
 *    range 16 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0000 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_16(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_16_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_mws_scan_ovlp_range_16_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20 - MWS Scan Frequency Overlap Range 17~20 */
/*! @{ */

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_17_MASK (0xFU)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_17_SHIFT (0U)
/*! mws_scan_ovlp_range_17 - MWS scan frequency overlap range 17, The MWS scan frequency overlap
 *    range 17 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0001 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_17(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_17_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_17_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_18_MASK (0xF0U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_18_SHIFT (4U)
/*! mws_scan_ovlp_range_18 - MWS scan frequency overlap range 18, The MWS scan frequency overlap
 *    range 18 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0010 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_18(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_18_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_18_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_19_MASK (0xF00U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_19_SHIFT (8U)
/*! mws_scan_ovlp_range_19 - MWS scan frequency overlap range 19, The MWS scan frequency overlap
 *    range 19 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0011 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_19(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_19_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_19_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_20_MASK (0xF000U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_20_SHIFT (12U)
/*! mws_scan_ovlp_range_20 - MWS scan frequency overlap range 20, The MWS scan frequency overlap
 *    range 20 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0100 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_20(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_20_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_mws_scan_ovlp_range_20_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24 - MWS Scan Frequency Overlap Range 21~24 */
/*! @{ */

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_21_MASK (0xFU)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_21_SHIFT (0U)
/*! mws_scan_ovlp_range_21 - MWS scan frequency overlap range 21, The MWS scan frequency overlap
 *    range 21 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0101 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_21(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_21_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_21_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_22_MASK (0xF0U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_22_SHIFT (4U)
/*! mws_scan_ovlp_range_22 - MWS scan frequency overlap range 22, The MWS scan frequency overlap
 *    range 22 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0110 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_22(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_22_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_22_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_23_MASK (0xF00U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_23_SHIFT (8U)
/*! mws_scan_ovlp_range_23 - MWS scan frequency overlap range 23, The MWS scan frequency overlap
 *    range 23 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0111 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_23(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_23_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_23_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_24_MASK (0xF000U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_24_SHIFT (12U)
/*! mws_scan_ovlp_range_24 - MWS scan frequency overlap range 24, The MWS scan frequency overlap
 *    range 24 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1000 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_24(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_24_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_mws_scan_ovlp_range_24_MASK)
/*! @} */

