zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28 - MWS Scan Frequency Overlap Range 25~28 */
/*! @{ */

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_25_MASK (0xFU)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_25_SHIFT (0U)
/*! mws_scan_ovlp_range_25 - MWS scan frequency overlap range 25, The MWS scan frequency overlap
 *    range 25 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1001 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_25(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_25_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_25_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_26_MASK (0xF0U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_26_SHIFT (4U)
/*! mws_scan_ovlp_range_26 - MWS scan frequency overlap range 26, The MWS scan frequency overlap
 *    range 26 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1010 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_26(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_26_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_26_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_27_MASK (0xF00U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_27_SHIFT (8U)
/*! mws_scan_ovlp_range_27 - MWS scan frequency overlap range 27, The MWS scan frequency overlap
 *    range 27 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1011 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_27(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_27_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_27_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_28_MASK (0xF000U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_28_SHIFT (12U)
/*! mws_scan_ovlp_range_28 - MWS scan frequency overlap range 28, The MWS scan frequency overlap
 *    range 28 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1100 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_28(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_28_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_mws_scan_ovlp_range_28_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31 - MWS Scan Frequency Overlap Range 29~31 */
/*! @{ */

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_29_MASK (0xFU)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_29_SHIFT (0U)
/*! mws_scan_ovlp_range_29 - MWS scan frequency overlap range 29, The MWS scan frequency overlap
 *    range 29 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1101 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_29(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_29_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_29_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_30_MASK (0xF0U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_30_SHIFT (4U)
/*! mws_scan_ovlp_range_30 - MWS scan frequency overlap range 30, The MWS scan frequency overlap
 *    range 30 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1110 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_30(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_30_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_30_MASK)

#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_31_MASK (0xF00U)
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_31_SHIFT (8U)
/*! mws_scan_ovlp_range_31 - MWS scan frequency overlap range 31, The MWS scan frequency overlap
 *    range 31 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1111 during MWS scan operation. See
 *    mws_scan_ovlp_range_1 for bit field description.
 */
#define BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_31(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_31_SHIFT)) & BTU2_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_mws_scan_ovlp_range_31_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL - MWS Coex Early BT_RX_PRI Control */
/*! @{ */

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mode_MASK (0x3U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mode_SHIFT (0U)
/*! bt_rx_pri_mode - BT_RX_PRI mode selection, These select the mode of operation for asserting the
 *    BT_RX_PRI signal., Bit[1] selects the Advance Mode. BT_RX_PRI signal assertion is based on
 *    earlyBtRxPri bit in Frame Descriptor programmed by firmware., Bit[0] selects the Real Time Mode.
 *    BT_RX_PRI signal is asserted in real time by hardware based on Bluetooth Rx packet's priority
 *    and event types.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mode(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mode_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mode_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_mst_MASK (0x4U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_mst_SHIFT (2U)
/*! bt_rx_pri_page_resp_mst - BT_RX_PRI assertion during page response at master side, This bit
 *    enables BT_RX_PRI assertion by BTU for critical Rx during page response at master side.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_mst(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_mst_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_mst_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_MASK (0x8U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_SHIFT (3U)
/*! bt_rx_pri_inq_resp - BT_RX_PRI assertion during inquiry response, This bit enables BT_RX_PRI
 *    assertion by BTU for critical Rx during inquiry response.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_MASK)

