zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_slv_MASK (0x10U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_slv_SHIFT (4U)
/*! bt_rx_pri_page_resp_slv - BT_RX_PRI assertion during page response at slave side, This bit
 *    enables BT_RX_PRI assertion by BTU for critical Rx during page response at slave side.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_slv(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_slv_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_slv_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mst_tm_sel_MASK (0x20U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mst_tm_sel_SHIFT (5U)
/*! bt_rx_pri_mst_tm_sel - BT_RX_PRI advance timing selection in Real Time mode for Bluetooth master
 *    mode, select 100us or 600us range advance timing., 0x0: select 100us range (BT_RX_PRI
 *    assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of the Rx
 *    packet), 0x1: select 600us range (BT_RX_PRI assertion is delayed by,
 *    BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of the preceding Tx, packet)
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mst_tm_sel(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mst_tm_sel_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_mst_tm_sel_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_tm_sel_MASK (0x40U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_tm_sel_SHIFT (6U)
/*! bt_rx_pri_page_resp_tm_sel - BT_RX_PRI advance timing selection during master or slave page
 *    response, select 100us or 600us range advance timing, 0x0: select 100us range. For master;
 *    BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of
 *    each Rx ID, packet. For slave; BT_RX_PRI assertion is delayed by,
 *    BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV from rifRx rising edge of the Rx FHS, packet., 0x1: select 600us range. For master;
 *    BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of
 *    the first Tx ID, packet. For slave; BT_RX_PRI assertion is delayed by,
 *    BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV from correlation hit of the first or second, Rx ID packet.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_tm_sel(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_tm_sel_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_page_resp_tm_sel_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_tm_sel_MASK (0x80U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_tm_sel_SHIFT (7U)
/*! bt_rx_pri_inq_resp_tm_sel - BT_RX_PRI advance timing selection during inquiry response, select
 *    100us or 600us range advance timing, 0x0: select 100us range. BT_RX_PRI assertion is delayed
 *    by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of the FHS packet., 0x1: select
 *    600us range. BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from
 *    rifTx rising edge of the first Tx ID, packet.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_tm_sel(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_tm_sel_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_inq_resp_tm_sel_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_early_bt_rx_pri_deass_fram_cnt_MASK (0x700U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_early_bt_rx_pri_deass_fram_cnt_SHIFT (8U)
/*! early_bt_rx_pri_deass_fram_cnt - Number of frames BT_RX_PRI should be de-asserted, This frame
 *    counter register is used to track how many frames in advance firmware is programming. When the
 *    earlyBtRxPri bit in frame descriptor is set; hardware will load this register value into
 *    hardware counter. BTU will de-assert BT_RX_PRI with appropriate timing on the frame that this
 *    hardware counter decrements to zero. This way firmware only will program earlyBtRxPri frame bit once
 *    for one packet.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_early_bt_rx_pri_deass_fram_cnt(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_early_bt_rx_pri_deass_fram_cnt_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_early_bt_rx_pri_deass_fram_cnt_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_drive_MASK (0x800U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_drive_SHIFT (11U)
/*! bt_rx_pri_drive - Control BT_RX_PRI logic level directly, This bit allows firmware to control
 *    the outgoing BT_RX_PRI logic level directly in real time.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_drive(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_drive_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_drive_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_assrt_lvl_MASK (0x3000U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_assrt_lvl_SHIFT (12U)
/*! bt_rx_pri_assrt_lvl - Specify priority level to assert BT_RX_PRI for BR/EDR packet, Only the
 *    coex_priority with the same or higher level than this setting will cause the assertion of
 *    BT_RX_PRI to BCA.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_assrt_lvl(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_assrt_lvl_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_bt_rx_pri_assrt_lvl_MASK)

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_ble_rx_pri_assrt_lvl_MASK (0xC000U)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_ble_rx_pri_assrt_lvl_SHIFT (14U)
/*! ble_rx_pri_assrt_lvl - Specify priority level to assert BT_RX_PRI for BLE packet, Only the
 *    coex_priority with the same or higher level than this setting will cause the assertion of BT_RX_PRI
 *    to BCA.
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_ble_rx_pri_assrt_lvl(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_ble_rx_pri_assrt_lvl_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_ble_rx_pri_assrt_lvl_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST - MWS Coex Early BT_RX_PRI Start Offset for Master Mode */
/*! @{ */

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_startoffsetmst_MASK (0x1FFFU)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_startoffsetmst_SHIFT (0U)
/*! startoffsetmst - Start Offset in Master Mode, Early indication BT_RX_PRI assertion time offset
 *    in Advance mode of MWS Coex when operating in master mode. Time unit is 0.25us. When the
 *    earlyBtRxPri bit in frame descriptor is set in master mode; hardware will assert BT_RX_PRI at
 *    (earlyBtRxPriStartOffsetMst * 0.25) us after the start of frame. The valid range is 0x2 ~ 0x1387
 *    (1250us).
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_startoffsetmst(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_startoffsetmst_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_startoffsetmst_MASK)
/*! @} */

