zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2.h
/*! @name BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV - MWS Coex Early BT_RX_PRI Start Offset for Slave Mode */
/*! @{ */

#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_startoffsetslv_MASK (0x1FFFU)
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_startoffsetslv_SHIFT (0U)
/*! startoffsetslv - Start Offset in Slave Mode, Early indication BT_RX_PRI assertion time offset in
 *    Advance mode of MWS Coex when operating in slave mode. Time unit is 0.25us. When the
 *    earlyBtRxPri bit in frame descriptor is set in slave mode; hardware will assert BT_RX_PRI at
 *    (earlyBtRxPriStartOffsetSlv * 0.25) us after the start of frame. The valid range is 0x2 ~ 0x1387
 *    (1250us).
 */
#define BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_startoffsetslv(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_startoffsetslv_SHIFT)) & BTU2_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_startoffsetslv_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV - MWS Coex Signal BT_RX_PRI Start Timer for Slave Mode */
/*! @{ */

#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_btrxpristartslvreg_MASK (0xFFFU)
#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_btrxpristartslvreg_SHIFT (0U)
/*! btrxpristartslvreg - BT_RX_PRI Start Timer for Slave Mode, In Real Time mode; btRxPriStartSlvReg
 *    determines the delay from rifRx assertion (or correlation hit if bt_rx_pri_page_resp_tm_sel =
 *    1) to the rising edge of BT_RX_PRI. The time between the rising edge of BT_RX_PRI to the
 *    rifRx assertion is (btRxPriStartSlvReg+1) unit of 0.25us., This value should never be program less
 *    than 1; other wise unexpected behavior will occur., - Resolution: 0.25 us., Since this signal
 *    can only assert on successful grant from BCA; this timing needs to be greater than the delay
 *    from rifRx to bca_grant_n.
 */
#define BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_btrxpristartslvreg(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_btrxpristartslvreg_SHIFT)) & BTU2_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_btrxpristartslvreg_MASK)
/*! @} */

/*! @name BTU_PTA_ANT_SWITCH_CTRL - PTA Antenna Switch Control, Antenna switch control for BCA arbitration. */
/*! @{ */

#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_en_MASK (0x1U)
#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_en_SHIFT (0U)
/*! bca_ant_switch_sts_bypass_en - BCA antenna switch status bypass enable, When
 *    bca_ant_switch_sts_bypass_en is set; BCA antSwitchStatus is controlled by bca_ant_switch_sts_bypass_val
 *    register., 0x0: disable antSwitchStatus bypass, 0x1: enable antSwitchStatus bypass
 */
#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_en_SHIFT)) & BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_en_MASK)

#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_val_MASK (0x2U)
#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_val_SHIFT (1U)
/*! bca_ant_switch_sts_bypass_val - BCA antenna switch status bypass value, When
 *    bca_ant_switch_sts_bypass_en is set; BCA antSwitchStatus is controlled by this register., 0x0: set BCA
 *    antSwitchStatus to zero, 0x1: set BCA antSwitchStatus to one
 */
#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_val(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_val_SHIFT)) & BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ant_switch_sts_bypass_val_MASK)

#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_MASK (0x1F00U)
#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_SHIFT (8U)
/*! bca_ref_antenna - BCA reference antenna override value, When bca_ref_antenna_override is set;
 *    BCA reference antenna is controlled by this register.
 */
#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_SHIFT)) & BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_MASK)

#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_override_MASK (0x8000U)
#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_override_SHIFT (15U)
/*! bca_ref_antenna_override - BCA reference antenna override, When bca_ref_antenna_override is set;
 *    BCA reference antenna is controlled by bca_ref_antenna register., 0x0: disable BCA refAntenna
 *    override, 0x1: enable BCA refAntenna override
 */
#define BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_override(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_override_SHIFT)) & BTU2_BTU_PTA_ANT_SWITCH_CTRL_bca_ref_antenna_override_MASK)
/*! @} */

/*! @name BTU_PTA_RSSI_ARB_CTRL - BTU RSSI Arbitration Control, RSSI Based arbitration register controls like feature enable; RSSI value from EBRAM or register selection; average RSSI orRSSI for last received packet */
/*! @{ */

#define BTU2_BTU_PTA_RSSI_ARB_CTRL_rssi_arb_en_MASK (0x1U)
#define BTU2_BTU_PTA_RSSI_ARB_CTRL_rssi_arb_en_SHIFT (0U)
/*! rssi_arb_en - RSSI based arbitration Feature enable, Software programable feature enable bit for
 *    enabling assertion of interface signals for RSSI based arbitration, 0x0: Disable interface
 *    signals used for RSSI based arbitration, 0x1: Enable interface signals used for RSSI based
 *    arbitrationEnable RSSI based, arbitration output signals
 */
#define BTU2_BTU_PTA_RSSI_ARB_CTRL_rssi_arb_en(x) (((uint16_t)(((uint16_t)(x)) << BTU2_BTU_PTA_RSSI_ARB_CTRL_rssi_arb_en_SHIFT)) & BTU2_BTU_PTA_RSSI_ARB_CTRL_rssi_arb_en_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group BTU2_Register_Masks */


/*!
 * @}
 */ /* end of group BTU2_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_BTU2_H_ */

